{
    "이화여자대학교": {
        "공과대학": {
            "공과대학": [
                {
                    "name": "4차산업혁명시대의미래공학",
                    "description": "제4차 산업 혁명은 물리적, 생물학적, 디지털적 세계를 빅 데이 터에 입각해서 통합시키고 경제 및 산업 등 모든 분야에 영향을 미치는 다양한 신기술이다. 본 교과목에서는, 제 4 차 산업 혁명 의 근간이라고 할 수 있는 로봇 공학, 인공 지능, 나노 기술, 생 명 공업 혁명, 사물인터넷, 3D 프링팅, 무인자동차 등의 내용에 대하여 설명하고, 공학의 다양한 분야와의 접목을 구체적 사례연 구를 통하여 살펴본다."
                }
            ],
            "융합전자반도체공학부": [
                {
                    "name": "디지털공학",
                    "description": "디지털 시스템을 분석하고 설계하는 데 필요한 이산수학의 원리 와 논리회로를 사용하여 이산함수를 구현하는데 필요한 지식을 배운다. 덧셈기, 곱셈기등으로 대표되는 조합 논리 회로와, 레지 스터나 카운터등으로 대표되는 순차 논리 회로에 대하여 다룬다. 상태도를 이용하여, 순차 논리회로를 설계, 분석하는 방법에 대 하여 배운다."
                },
                {
                    "name": "전자회로Ⅱ",
                    "description": "증폭에서의 궤환,안정도 전력증폭기,연산증폭기 등을 다루며 필 터,오실레이터 등 응용회로를 다룬다."
                },
                {
                    "name": "신호및시스템",
                    "description": "이산 또는 연속체계를 갖는 선형 시불변 시스템의 입출력 특성과 수학적 모델링을 공부하고 그러한 시스템 해석을 위한 푸리에의 변환,라플라스 변환, Z변환과 DFT(Discrele Fourier Transformation)를 배운다."
                },
                {
                    "name": "디지털집적회로",
                    "description": "아날로그 및 디지탈 집적회로의 동작원리를 이해하고 이를 해석 할 수 있는 능력을 배양한다. 논리설계에 필요한 스틱 및 패턴 작성원리 및 그 설계 규칙의 원리를 설명한다. 회로의 시간적 표 현능력을 나타내는 단일 및 다중 클럭의 원리 및 그에 따른 회로 구성상의 논리를 설명한다."
                },
                {
                    "name": "회로이론",
                    "description": "전자회로의 기본개념과 해석법을 다루는 과목으로 저항회로 ,RC,RL 및 RLC 회로의 정상상태 및 과도현상 해석법을 다루고 정 현파 전원이 가해진 선형회로에서의 정상상태 해석도 취급한다. 또한 Laplace Transform을 이용한 회로해석방법도 공부한다."
                },
                {
                    "name": "전자장Ⅰ",
                    "description": "벡터해석, 정전계와 정상자계를 공부하고, 시간적으로 변화하는 맥스웰 방정식을 배움으로써 전자기에 대한 전체적인 이해를 갖 추도록 한다."
                },
                {
                    "name": "컴퓨터아키텍처",
                    "description": "전자 계산기의 연산장치, 기억장치,버스등의 전자계산기 구조와 설계법에 관하여 강의한다. 그리고 하드웨어와 직접적으로 관련 이 있는 프로그래밍 구조에 관한 지식을 습득케 한다"
                },
                {
                    "name": "AI디지털신호처리및실습",
                    "description": "연속 또는 이산신호를 선형 시불변 시스템을 이용하여 시간 및 주파수 영역에서 처리하는 방법을 배우고 Z 변환 DFT와 FFT , 아날로그 및 디지털 필터의 설계 등을 취급한다. 신호처리 이론 의 인공지능 응용에 관하여 배운다."
                },
                {
                    "name": "반도체공학Ⅰ",
                    "description": "반도체 소자의 물리학적 원리를 공부하고 결정고체, 고체의 에너 지 밴드의 개념, 반도체 내에서의 전자와 정공의 움직임, P-N접 합특성 등 반도체 및 기타전자와 관련된 물리현상을 다룬다."
                },
                {
                    "name": "통신이론",
                    "description": "푸리에 변환을 이용한 신호스펙트럼 분석,확률 및확률변수에 관 하여 공부하고 아날로그 변조와 복조방법,펄스변조와 복조방식 ,다중화방법 등 통신방식의 기초이론을 다룬다."
                },
                {
                    "name": "반도체공학Ⅱ",
                    "description": "BJT,FET,레이저,스위칭 소자,초고주파 소자 등 각종 반도체소자 의 기본 성질 및 특성을 배우며 이를 기초로 하여 집적회로 구성 을 위한 공정 integration의 기초를 다룬다."
                },
                {
                    "name": "기초회로실험",
                    "description": "전기회로 및 회로소자에 대한 기본적인 동작원리와 개요를 이해 한다. R,L,C 등 수동소자의 특성을 실험하며, 전자공학실험에 필 수적인 전류계, 전압계, 류계발생기, 전원(Power supply), 오실 로스코프의 사용방법을 익힌다."
                },
                {
                    "name": "전자회로Ⅰ",
                    "description": "아날로그 시스템의 기본소자인 다이오드,트랜지스터의 기본 동작 원리 및 회로모델, 이러한 소자를 이용한 정류회로,소신호 증폭 회로,차동증폭기,회로의 주파수 특성을 다룬다."
                },
                {
                    "name": "SoC설계및실습",
                    "description": "Verilog와 같은 HDL을 이용한 디지털 시스템 설계에 관하여 공부 한다. HDL의 기본 문법을 익히고, 이를 이용하여 디지털 시스템 의 기본 블록들을 설계하고 검증한다."
                },
                {
                    "name": "확률및랜덤프로세스",
                    "description": "정보의 확률적 특성이나 통신 채널의 잡음의 특성, 통신망에서 데이터의 발생의 확률 통계적인 특성을 고려하여 통신 시스템을 설계하여야 한다. 신호와 잡음의 다양한 확률 통계적인 기본 모 델과 그 기초적인 응용에 대하여 배운다."
                },
                {
                    "name": "전자회로실험",
                    "description": "다이오드와 트랜지스터 회로, 트랜지스터와 FET의 바이어스 방법 , 증폭기의 저주파및 고주파 모델, 증폭기의 주파수 특성등 기본 적인 전자회로의 동작을 실험을 통하여 확인한다."
                },
                {
                    "name": "공학수학",
                    "description": "본 과목에서는 컴퓨터공학을 비롯해 일반적인 공학분야에서 기본 적으로 다루어져야 하는 수학적 지식인 상미분방정식, 편미분방 정식, 벡터해석, 푸리에 해석, 복소해석 등을 강의한다."
                },
                {
                    "name": "임베디드시스템설계및실습",
                    "description": "임베디드 하드웨어 시스템의 기본 이론에 대하여 배우고 실습한 다. 임베디드 하드웨어 프로그래밍 이해, 개발환경 구축, 임베디 드 리눅스 이해, 임베디드 프로세서를 포함한 제반 하드웨어 구 조에 대한 이해와 함께 시스템 초기화 프로그래밍, 디바이스 드 라이버 개념을 확립하고, 입출력 장치에 대한 제어 프로그래밍을 학습한다."
                },
                {
                    "name": "융합전자반도체공학종합설계",
                    "description": "저학년에서 습득한 공학설계의 의미와 접근방법에 관한 지식을 이용하여 실제적인 문제들의 해결을 설계과정에 따라 직접 수행 하게 한다."
                },
                {
                    "name": "고급프로그래밍및실습",
                    "description": "전자공학전공에 필요한 C/C++ 언어의 고급 기능과 객체지향 프로 그래밍의 기본 개념, MATLAB을 공부한다. 그리고, C/C++과 MATLAB을 사용하여 다양한 응용 프로그래밍을 해 봄으로써 학생 들의 프로그래밍 능력을 향상시킨다."
                },
                {
                    "name": "기초프로그래밍및실습",
                    "description": "전자공학적 문제의 해결에 필수적인 프로그래밍을 공부하고 직접 실습한다. 컴퓨터의 구조와 동작원리의 이해를 바탕으로한 C언어 와 MATLAB를 기반으로 프로그래밍을 통한 공학문제 해결 방법을 배운다."
                },
                {
                    "name": "선형시스템수학",
                    "description": "선형시스템의 해석에 필요한 행렬 및 선형대수에 관한 기초이론 과 관련 기법들을 익히고, 그 응용 예들을 학습한다. 이를 위하 여 벡터와 행렬, 선형방정식의 해법, 행렬-벡터공간 해석, 고유 값 및 고유벡터, 유사변환, 최소자승문제 해석 등을 수학한다."
                },
                {
                    "name": "공학수치해석",
                    "description": "전자공학의 근간이 되는 수학적 모델을 수치해석적 방법으로 풀 고 그 결과를 분석하기 위한 알고리즘과 프로그래밍 기법을 학습 한다."
                },
                {
                    "name": "머신러닝및실습",
                    "description": "데이터로부터 학습하여 실행할 수 있는 알고리즘인 머신러닝의 개념을 학습하고 응용을 실습한다."
                },
                {
                    "name": "응용수학",
                    "description": "미분방정식, 복소함수, 급수, 수치해석, 최적화등의 응용수학 학 습을 통하여 전자공학도에게 필요한 수학적 해석능력을 배양하고 설계능력을 갖추도록 한다."
                },
                {
                    "name": "인공지능개론",
                    "description": "컴퓨터비젼, 확률적 모델링 및 추론 등과 같은 인공지능의 핵심 적 아이디어와 기술에 대하여 배운다."
                }
            ],
            "전자전기공학": [
                {
                    "name": "인공지능시대의정보산업이해",
                    "description": "급속한 정보사회의 변화를 보다 적극적으로 이해하고 해석하기 위하여, 정보가치의 계량화 기법들을 공부한다. 엔트로피 및 게 임이론을 바탕으로 정보의 고유가치, 전략적 가치, 네트워크 공 유가치 등의 관점을 토론하며, 각각에 대응된 현재와 미래 정보 산업의 유형을 학습한다. 응용계로서는 바이오 및 메디칼 분야에 서의 신정보산업, 미래인터넷, 로봇 및 자율자동차에서 본 집합 지능의 설계 등을 사례로 공부한다."
                },
                {
                    "name": "디지털통신",
                    "description": "디지털 통신시스템의 변복조방식,동기방식,최적 검파,정보 이론 ,오류정정 부호 등 통신시스템의 전반적인 원리에 대하여 공부한 다."
                },
                {
                    "name": "전자장Ⅱ",
                    "description": "전자파 대한 이론을 강의하고 유무선에서의 전자파 전송에 대한 기초 현상을 이해시킨다."
                },
                {
                    "name": "무선시스템분석",
                    "description": "디지털통신이론을 바탕으로 미래의 핵심 기술로 부각되고 있는 이동통신의 기술적 원리와 개념에 대하여 배운다."
                },
                {
                    "name": "통신공학실험",
                    "description": "아날로그 및 디지털 통신에 사용되는 기본적인 개념들에 관한 실 험을 수행한다. 필터, 증폭기, 변/복조기, AM, FM 등의 회로를 이용한 아날로그 통신, 그리고 펄스 변조, 라인 복호, 분할 다중 방식, 주파수 편이 방식, 위상 편이 방식등의 회로를 이용한 디 지털 통신의 기초 이론을 이해하고 이를 실습을 통하여 작동 원 리를 이해한다."
                },
                {
                    "name": "데이터네트워크",
                    "description": "컴퓨터 네트웍은 세계 각지에 흩어져 있는 컴퓨터들을 연결하여 서로 데이타 교환이 가능하도록 한 통신망을 말하며, 우리가 사 용하고 있는 인터넷은 하나의 거대한 통신망이라 할 수있다. 이 과목에서는 인터넷에 중점을 두어 여러가지 통신망 기술과 프로 토콜들에 대해 배운다."
                },
                {
                    "name": "자료구조및알고리즘",
                    "description": "다양한 전자공학 문제를 해결하기 위한 수치해석 및 응용프로그 램과 여러 전자기기에 사용되는 운영체제를 이용한 응용프로그램 설계 기법을 학습한다."
                },
                {
                    "name": "AI영상처리",
                    "description": "인공지능 기술을 기반으로 하는 영상처리 기법에 대해서 배운다. 영상 개선, 영상 복원, 영상 압축, 패턴 인식등을 위한 디지털 영상 처리 기술의 기본 이론과 전통적인 영상처리 기법을 배우고 Convolutional Neural Network 등의 인공지능 기법을 사용하여 영상처리, 머신비전의 성능을 향상 시키는 방법을 학습한다."
                },
                {
                    "name": "전자공학산학실무설계Ⅰ",
                    "description": "학교 및 학과에서 인정하는 전자공학 관련 산업체에서 인턴쉽을 한 학기동안 수행한다."
                },
                {
                    "name": "전자공학산학실무설계Ⅱ",
                    "description": "학교 및 학과에서 인정하는 전자공학 관련 산업체에서 인턴쉽을 한 학기동안 수행한다."
                },
                {
                    "name": "전자공학산학실무설계Ⅲ",
                    "description": "학교 및 학과에서 인정하는 전자공학 관련 산업체에서 인턴쉽을 한 학기동안 수행한다."
                },
                {
                    "name": "전자공학산학협력인턴십Ⅰ",
                    "description": "3학년 및 4학년 학생들이 계절학기 동안 산업체에서 인턴십을 수 행하는 프로그램."
                },
                {
                    "name": "바이오전자공학",
                    "description": "바이오관련 산업과 연구에 사용되는 전자공학 기술의 최근 현황 과 기본적인 원리를 배운다. 기초적인 해부학과 신경생리학의 지 식을 습득한 후, 전자공학과 밀접한 관련이 있는 bioelectric phenomena, bioinstrumentation, biosensors 등의 원리를 학습한 다. 또한 최근에 크게 발전하고 있는 의학영상기술, 인공청각 (cochlear implant), 심뇌부자극(deep brain stimulation), 인공 시각(artificial retina) 등의 이식형 신경자극 전자시스템의 원 리 및 현재 기술에 대해 공부한다."
                },
                {
                    "name": "마이크로/나노시스템공학",
                    "description": "본 과목에서는 마이크로/나노 시스템 Micro/Nano-Electro- Mechanical Systems)의 기초가 되는 기본 법칙, 제작 공정과 응 용 분야에 대해 이해한다. 이를 위하여 전자공학과 기계공학의 기본 지식과 다양한 microfabrication 기술들을 학습함으로써 MEMS/NEMS의 설계, 재료, 제작 등과 관련된 다양한 문제점들을 이해하고 문제 해결 능력을 배양한다."
                },
                {
                    "name": "해외재능기부현장실습",
                    "description": "저개발 국가의 사회복지단체 및 NGO에 단기간 파견되어 아동 및 청소년, 현지 교사들에게 학생 개개인의 재능을 발휘하고 본교에 서 배운 전공 지식을 활용하여 교육 봉사 활동을 한다. 수원국 대학생과 함께 실습하며, 현지의 문화와 환경, 사회경제적 현황 을 학습한다."
                },
                {
                    "name": "전자공학자기설계프로젝트Ⅰ",
                    "description": "전자공학의 다양한 분야에서 학생 스스로 도전적인 연구/학습 주 제를 설정하고 이를 수행하는 교과목으로, 창의성과 도전성을 갖 춘 내용을 다루게 된다."
                },
                {
                    "name": "전자공학자기설계프로젝트Ⅱ",
                    "description": "전자공학의 다양한 분야에서 학생 스스로 도전적인 연구/학습 주 제를 설정하고 이를 수행하는 교과목으로, 창의성과 도전성을 갖 춘 내용을 다루게 된다."
                },
                {
                    "name": "전자공학산학협력인턴십Ⅱ",
                    "description": "3학년 및 4학년 학생들이 계절학기 동안 산업체에서 인턴십을 수 행하는 프로그램."
                },
                {
                    "name": "전자공학산학협력인턴십Ⅲ",
                    "description": "3학년 및 4학년 학생들이 계절학기 동안 산업체에서 인턴십을 수 행하는 프로그램."
                },
                {
                    "name": "전자공학글로벌필드트레이닝Ⅰ",
                    "description": "글로벌 사회 진출에 필요한 글로벌 커리어 경험과 커뮤니케이션 및 현장지식 및 기술역량을 배양하는 것을 목표로 하며, 국내외 다양한 커리어 개발을 권장한다."
                },
                {
                    "name": "전자공학글로벌필드트레이닝Ⅱ",
                    "description": "글로벌 사회 진출에 필요한 글로벌 커리어 경험과 커뮤니케이션 및 현장지식 및 기술역량을 배양하는 것을 목표로 하며, 국내외 다양한 커리어 개발을 권장한다."
                },
                {
                    "name": "전자공학글로벌필드트레이닝Ⅲ",
                    "description": "글로벌 사회 진출에 필요한 글로벌 커리어 경험과 커뮤니케이션 및 현장지식 및 기술역량을 배양하는 것을 목표로 하며, 국내외 다양한 커리어 개발을 권장한다."
                },
                {
                    "name": "전력및에너지시스템",
                    "description": "교류 및 전력변환 회로, 전력전송과 시스템 운용, 스마트그리드 에 대하여 학습한다."
                },
                {
                    "name": "지능시스템",
                    "description": "현대제어와 지능시스템을 다룬다. 제어이론과 적용을 포함하여 제어 시스템 설계를 위한 디지털 제어 이론과 지능제어를 다룬다 ."
                },
                {
                    "name": "최적화개론",
                    "description": "최적화의 기초 개념과 응용분야를 다룬다. 선형 벡터공간, 선형 연산자, 선형 추정 및 필터링, 함수 해석학, 최적 제어, 신경 회 로망 등을 다룬다."
                },
                {
                    "name": "제어공학",
                    "description": "시스템의 동적 반응, 안정도, 수학적 모델링과 전달함수, 궤환 제어 및 응용, 시간 및 주파수영역에서의 궤환 시스템의 해석, 상태변수에 의한 시스템 해석 및 설계 등을 수학한다."
                },
                {
                    "name": "광통신공학",
                    "description": "본 과목에서는 광통신의 기본 개념과 이에 사용되는 각종 광학, 전자, 통신 기술을 강의한다. 본 과목의 구체적인 내용은 광통신 의 개요, 기본적 광학이론, 광섬유, 광수신기 설계 및 잡음 분석 , 광통신 시스템 디자인 등을 포함한다."
                },
                {
                    "name": "운영체제및시스템프로그래밍",
                    "description": "현대의 컴퓨터 운영체제의 structure, process/memory/storage management, I/O subsystem 등에 대해서 배우고 실습해본다."
                },
                {
                    "name": "광전자공학",
                    "description": "광전자 소자에 사용되는 화합물 반도체 전반에 대한 기본 개념과 Wave guiding, wave propagation 등의 광학 및 광전효과(electro optic effect)에 대하여 강의하고, 이를 기초로 한 광전자소자 (LED, Laser Diode, Photo detector, Optical Modulator, Optical Switch, 광 집적 회로 등)들의 동작원리와 광통신 네트 워크를 비롯한 응용 영역 전반에 대하여 강의한다."
                },
                {
                    "name": "로봇공학",
                    "description": "본 과목은 로봇 공학을 위한 수학적 기초 이론을 학습하고, 구체 적 응용 예제들을 탐구하며, 수업시간에 다루어진 내용을 실험, 실습을 통해 구현해 보는 과목이다. 본 과목에서 배우게 될 주요 내용들은 로봇 기구학, 로봇 동역학, 센싱 및 구동, 제어 방법론 , 환경 모델링, 로봇 학습 등이 있다."
                }
            ],
            "지능형반도체공학": [
                {
                    "name": "기초디지털실험",
                    "description": "디지털 논리회로 과목의 이론적 내용을 실험을 통하여 검증하고, 이를 응용한 프로젝트를 수행할 수 있는 능력을 함양한다."
                },
                {
                    "name": "반도체물리전자",
                    "description": "반도체의 물리적인 성질을 이해하기 위한 결정구조, 양자역학, 양자속박 구조, 에너지밴드, 전자 및 정공, 통계, 상태밀도, 페 르미 준위, 캐리어 농도, 캐리어 수송현상과 전류, 캐리어 발생 과 재결합, 홀 효과 등에 대해 공부한다."
                },
                {
                    "name": "마이크로프로세서",
                    "description": "ISA와 프로세서를 구성하는 pipeline의 기본적인 구조 및 동작에 관하여 배운다. 또한 memory hierarchy와 cache에 대하여 배우고 , TLB, branch predictor, prefetching 등에 프로세서의 기본적 인 구조 및 동작에 대하여 학습한다."
                },
                {
                    "name": "메모리소자",
                    "description": "DRAM/SRAM/NVM 등의 반도체 메모리소자들의 구조와 동작특성을 살펴보고 고속화, 저전력화를 위한 회로기술들을 공부한다."
                },
                {
                    "name": "운영체제및시스템프로그래밍",
                    "description": "현대의 컴퓨터 운영체제의 structure, process/memory/storage management, I/O subsystem 등에 대해서 배우고 실습해본다."
                },
                {
                    "name": "반도체공학자기설계프로젝트Ⅰ",
                    "description": "반도체공학의 다양한 분야에서 학생 스스로 도전적인 연구/학습 주제를 설정하고 이를 수행하는 교과목으로, 창의성과 도전성을 갖춘 내용을 다루게 된다."
                },
                {
                    "name": "반도체공학자기설계프로젝트Ⅱ",
                    "description": "반도체공학의 다양한 분야에서 학생 스스로 도전적인 연구/학습 주제를 설정하고 이를 수행하는 교과목으로, 창의성과 도전성을 갖춘 내용을 다루게 된다."
                },
                {
                    "name": "반도체디스플레이",
                    "description": "디스플레이 개론, 공정, 재료, 동작원리, 향후 디스플레이 산업 동향에 대해 배우며, 다양한 디스플레이 관련 이해도를 높이고, LCD(Liquid Crystal Display), OLED(Organic Light Emitting Diode) 등 다양한 디스플레이의 구조 및 작동 원리에 관하여 학 습한다."
                },
                {
                    "name": "집적회로공정",
                    "description": "집적회로 제작에 공통인 공정기술들을 소개하여 더 높은 수준의 공정과 설계 과목을 이해하기 위해 필요한 기반을 공부한다."
                },
                {
                    "name": "첨단로직소자",
                    "description": "현대에서 사용되는 나노미터 이하의 규격을 가지는 소자들의 물 리전기적 특성을 논하고 이들을 이용하여 제작된 소자의 동작원 리를 배운다."
                },
                {
                    "name": "첨단센서공학",
                    "description": "인공지능 및 IoT 등 첨단 산업에서 그 수요가 증가하고 있는 센 서의 종류와 원리, 설계, 제조 및 응용사례에 대하여 폭넓게 학 습한다. 마이크로센서, RF MEMS 센서, 광학 센서 및 바이오 MEMS 센서 등 다양한 센서를 학습하며, 센서들을 응용하기 위한 기술 적 요소에 대해 고찰한다."
                },
                {
                    "name": "TCAD시뮬레이션및실습",
                    "description": "반도체 소자 및 공정의 기초이론을 바탕으로 반도체 소자 및 공 정 시뮬레이터를 통해, 소자 및 공정의 특성 개선을 위한 방법을 공부한다."
                },
                {
                    "name": "뉴로모픽소자및시스템",
                    "description": "인공지능 및 Deep learning 알고리즘을 수행하는데, 많은 연산과 데이터 전송이 필요하므로 기존 CPU, GPU, Memory로 이를 구현하 는 것은 매우 비효율적이다. 이러한 문제점을 해결하기 위해 현 재 개발되고 있는 뉴로모픽 소자들을 이해하고 이를 이용해 인공 지능 하드웨어를 효과적으로 설계할 수 있는 방법을 학습한다."
                },
                {
                    "name": "메모리기술이해",
                    "description": "반도체 메모리 기술을 메모리 기술 개요, 메모리 소자, 회로 및 구조 설계, 메모리 공정 기술 및 설계, 메모리 검사 및 성능 평 가, 메모리 응용, 메모리 기술의 발전추세 등의 세부 분야로 나 누어 심도 있게 다룬다. 다루는 메모리 종류는 SRAM, DRAM 등의 휘발성 메모리와 Flash memory와 같은 비휘발성 메모리이며, 고 속 동작을 위한 메모리 구조도 다룬다."
                },
                {
                    "name": "반도체신뢰성공학",
                    "description": "반도체 제품의 신뢰성 요구사항을 개발하고,신뢰성 프로그램을 수립하고,신뢰성 분석을 위한 다양한 신뢰성 이론, 파괴 메커니 즘, 수명 및 수율 등의 개념을 배운다. 반도체 소자의 신뢰성 시 험 방법 및 반도체 소자 및 제조의 신뢰성을 향상시킬 수 있는 기술 및 평가 방법 그리고 신뢰성 통계 분석에 대해 학습한다."
                },
                {
                    "name": "아날로그회로설계및실습",
                    "description": "반도체 산업계의 숙련된 RFIC 설계 엔지니어에 대한 요구가 매우 절실하므로, 교과과정 내에 RFIC 설계에 대한 간단하면서도 폭넓 은 범위를 다루는 과목을 개설하게 되었다. 이 과목에서는 RF 시 스템에 대한 소개, RF IC의 구조 및 회로단계에서의 분석 및 설 계를 CMOS 공정을 중심으로 다룬다. 수강자는 전자회로에 대한 지식, 예를 들어 공통소스, 공통게이트, 캐스코드 차동 증폭기, 주파수 응답 등을 갖추면 좋다."
                },
                {
                    "name": "지능형시스템구조설계",
                    "description": "학습 및 추론 등 인공지능 알고리 즘 구현에 요구 되는 대규모 데이터 처리를 위한 기존 반도체 회로 및 시스템의 한계점을 극 복하기 위해 개발된 새로운 회로 및 시스템 기술을 배운다. 인공 신경망 딥러닝 연산의 가속을 위한 디지털 기반 가속기 설계로부 터 다양한 형태의 회로와 소자를 이용한 새로운 컴퓨팅에 기반한 시스템의 구현까지 소개한다."
                },
                {
                    "name": "반도체공학산학실무설계Ⅰ",
                    "description": "학교 및 학과에서 인정하는 반도체공학 관련 산업체에서 인턴쉽 을 한 학기동안 수행한다."
                },
                {
                    "name": "반도체공학산학실무설계Ⅱ",
                    "description": "학교 및 학과에서 인정하는 반도체공학 관련 산업체에서 인턴쉽 을 한 학기동안 수행한다."
                },
                {
                    "name": "반도체공학산학실무설계Ⅲ",
                    "description": "학교 및 학과에서 인정하는 반도체공학 관련 산업체에서 인턴쉽 을 한 학기동안 수행한다."
                },
                {
                    "name": "반도체공학산학협력인턴십Ⅰ",
                    "description": "3학년 및 4학년 학생들이 계절학기 동안 산업체에서 인턴십을 수 행하는 프로그램"
                },
                {
                    "name": "반도체공학산학협력인턴십Ⅱ",
                    "description": "3학년 및 4학년 학생들이 계절학기 동안 산업체에서 인턴십을 수 행하는 프로그램"
                },
                {
                    "name": "반도체공학산학협력인턴십Ⅲ",
                    "description": "3학년 및 4학년 학생들이 계절학기 동안 산업체에서 인턴십을 수 행하는 프로그램"
                },
                {
                    "name": "반도체공학글로벌필드트레이닝Ⅰ",
                    "description": "글로벌 사회 진출에 필요한 글로벌 커리어 경험과 커뮤니케이션 및 현장지식 및 기술역량을 배양하는 것을 목표로 하며, 국내외 다양한 커리어 개발을 권장한다."
                },
                {
                    "name": "반도체공학글로벌필드트레이닝Ⅱ",
                    "description": "글로벌 사회 진출에 필요한 글로벌 커리어 경험과 커뮤니케이션 및 현장지식 및 기술역량을 배양하는 것을 목표로 하며, 국내외 다양한 커리어 개발을 권장한다."
                },
                {
                    "name": "반도체공학글로벌필드트레이닝Ⅲ",
                    "description": "글로벌 사회 진출에 필요한 글로벌 커리어 경험과 커뮤니케이션 및 현장지식 및 기술역량을 배양하는 것을 목표로 하며, 국내외 다양한 커리어 개발을 권장한다."
                },
                {
                    "name": "해외재능기부현장실습",
                    "description": "저개발 국가의 사회복지단체 및 NGO에 단기간 파견되어 아동 및 청소년, 현지 교사들에게 학생 개개인의 재능을 발휘하고 본교에 서 배운 전공 지식을 활용하여 교육 봉사 활동을 한다. 수원국 대학생과 함께 실습하며, 현지의 문화와 환경, 사회경제적 현황 을 학습한다."
                }
            ],
            "식품생명공학과": [
                {
                    "name": "식품공정조작",
                    "description": "식품 제품 생산을 위해 필요한 단위 조작을 공학적인 측면에서 다룬다. 이를 위해 기기 디자인 및 가공 공정이 식품 품질에 미 치는 영향을 배운다."
                },
                {
                    "name": "식품화학",
                    "description": "식품 내 주요성분들인 수분, 탄수화물, 지질, 단백질의 화학적ㆍ 생화학적 특성을 고찰하며, 식품의 가공 및 저장 중 이들 성분들 에 일어나는 화학적 반응 및 변화를 이해하고자 한다."
                },
                {
                    "name": "식품감성공학",
                    "description": "인간/소비자의 식품선택에 영향을 미치는 인자들을 파악하여 소 비자가 만족할 수 있고, 소비자의 안녕과 웰빙을 위한 식품을 생 산/공급할 수 있는 방안으로 감각 및 소비자 과학에 기초한 식품 감성공학 접근방법을 배운다."
                },
                {
                    "name": "식품공학",
                    "description": "식품 가공 및 공정을 위해 필요한 기본적인 공학적 원리 및 조작 법을 배우며, 이에는 열전달, 가열공정, 냉장/냉동, 유체, 분리, 혼합, 분쇄, 수분조절 등이 포함된다. 그리고, 기기 및 공정 조 절, 물질 및 에너지 평형에 대한 기본적인 개념을 익히도록 한다 ."
                },
                {
                    "name": "식품미량구성성분및첨가물",
                    "description": "식품 중에 있는 미량성분인 비타민, 미네랄, 효소, 향미성분, 색 소, 물성, 유독성분 및 첨가제의 화학적ㆍ생물학적 특성을 고찰 하고, 이들 성분들이 식품의 품질 특성에 미치는 영향을 공부한 다."
                },
                {
                    "name": "식품미생물학",
                    "description": "세균, 바이러스 등 미생물의 형태, 구조, 생리, 유전정보, 유전 자발현과 같은 기초지식을 공부함으로써 식중독균과 식품유용미 생물을 종합적으로 이해한다."
                },
                {
                    "name": "식품분석실험",
                    "description": "화학적, 물리적, 기기분석적인 방법을 이용하여 식품의 기초적인 정성적ㆍ정량적 분석을 배우고자 한다. 특히, 실제 식품 내 다양 한 성분들의 분석법을 직접 다루고 익힌다."
                },
                {
                    "name": "식품미생물실험",
                    "description": "식품 유용미생물 및 식품 위해미생물의 생물학적/생화학적/유전 학적 특성을 실험을 통해 학습하고, 미생물 상호작용에 관한 실 험과 설계를 통해 식품과학 분야에서 미생물 응용법을 익힌다."
                },
                {
                    "name": "생물전환및미생물공학",
                    "description": "생물촉매로서 효소와 미생물의 화학적, 생물학적 특성을 이해하 고 이들이 식품산업에서의 고부가가치 물질들 (예로 아미노산, 핵산, 비타민, terpenoids, carotenoids)의 생산에 어떻게 이용 되는지 공부한다."
                },
                {
                    "name": "식품가공학",
                    "description": "고온 및 저온 처리, 습도조절, 농축, 건조 등 일반적인 식품 공 정과 함께 새로운 식품 공정 기술을 소개하며, 이를 적용하기 위 한 화학, 미생물학, 공학의 상호작용에 대해서 배운다. 또한, 식 품 산업에서 이용되는 저온살균, 살균, 냉장, 냉동 등의 저장방 법과 기술에 대하여 학습한다."
                },
                {
                    "name": "식품감각평가이론및실험",
                    "description": "식품이나 제품을 경험하면서 감지하는 감각특성을 평가하고, 감 각 및 감성특성의 감지를 통해 인간/소비자가 평가하는 제품의 기호품질을 측정, 분석, 해석하는 연구방법을 배운다."
                },
                {
                    "name": "나노바이오소재공학",
                    "description": "나노바이오공학을 공부하고, 나노바이오공학을 활용한 나노/바이 오소재의 (생)합성과 활용에 대해 공부한다."
                },
                {
                    "name": "식품위생및HACCP",
                    "description": "식품안전 확보 및 국민 보건 증진을 위해 식품위생에 관한 기초 개념부터 식품 매개 질환, 인체에 위해로 작용할 수 있는 생물학 적/화학적/물리적 위해요소에 대해 학습한다. 또한 식중독 사고 의 선제적 예방 시스템인 HACCP(hazard analysis and critical control point, 식품안전관리인증기준)의 과학적인 개념과 7원칙 을 이해한다."
                },
                {
                    "name": "식품산업현장실습Ⅱ",
                    "description": "식품회사를 방문하여 식품회사 직원/연구원들의 교육하에 실제 현장에서 심화된 경험을 얻는다."
                },
                {
                    "name": "발효공학",
                    "description": "미생물을 이용한 생물전환 공정 및 발효공정을 공부한다. 특히, 생물전환과 발효 중에 일어나는 생화학 반응에 대해 상세히 공부 한다."
                },
                {
                    "name": "식품종합설계",
                    "description": "식품산업 현장에서 필요한 연구 및 개발을 수행하는 방법을 익히 고 제품설계 프로젝트를 수행한다."
                },
                {
                    "name": "유기화학Ⅰ",
                    "description": "유기화학은 탄소화합물에 대한 화학이며, 생체화합물의 대부분이 유기화학에 속한다. 이는 생물화학의 바탕이 될 뿐만 아니라, 생 물학 및 의약학과도 밀접한 관계를 가진다. 일상 생활과 밀접한 관계를 가지고 있는 유기화합물의 구조, 반응, 응용 등 세 부분 으로 나누어 기초부터 고도의 지식까지 다룬다."
                },
                {
                    "name": "생화학이론및실험Ⅰ",
                    "description": "생명체의 기본 단위인 세포를 구성하는 생체기본물질들, 지방, 탄수화물, 핵산등의 화학 구조적 특성 및 세포 내에서의 역할을 이해한다."
                },
                {
                    "name": "생화학이론및실험Ⅱ",
                    "description": "생화학 I에서 배운 내용을 바탕으로 세포내탄수화물, 지방, 단백 질의 물질대사과정과 이들 대사들이 조절되고 통합되는 과정을 배운다."
                },
                {
                    "name": "푸드테크비즈니스모델과식품정보시스템",
                    "description": "변화하는 산업사회환경과 푸드테크의 개념을 이해하고 이에 대응 한 창의적인 비즈니스 모델을 도출하는 데 필요한 기본 개념과 소통할 수 있는 능력을 배운다."
                },
                {
                    "name": "식품소비자행동및감각마케팅",
                    "description": "마케팅 접근방법의 기본 개념을 이해하고 전략적 식품 마케팅 실현을 위한 비즈니스 모델을 학습함. 또한 마케팅 연구를 위한 소비자 심리계측학 적용 및 감각마케팅 분야에 대해 글로벌 역량 을 배양함."
                },
                {
                    "name": "해외재능기부현장실습",
                    "description": "저개발 국가의 사회복지단체 및 NGO에 단기간 파견되어 아동 및 청소년, 현지 교사들에게 학생 개개인의 재능을 발휘하고 본교에 서 배운 전공 지식을 활용하여 교육 봉사 활동을 한다. 수원국 대학생과 함께 실습하며, 현지의 문화와 환경, 사회경제적 현황 을 학습한다."
                },
                {
                    "name": "식품산업현장실습Ⅰ",
                    "description": "식품회사를 방문하여 식품회사 직원/연구원들의 교육하에 실제 현장에서 경험을 얻는다."
                },
                {
                    "name": "식품공학전공설계심화Ⅰ",
                    "description": "학생들이 자신의 학습 목표를 스스로 세우고, 학습 목표 달성에 필요한 다양한 활동들을 스스로 설계하고 진행한다. 학생들은 산 업체 인턴 프로그램, 해외 기관 인턴 프로그램, 연구실 인턴 프 로그램 등에 참여하고 이를 활용할 수 있다."
                },
                {
                    "name": "식품공학전공설계심화Ⅱ",
                    "description": "학생들이 자신의 학습 목표를 스스로 세우고, 학습 목표 달성에 필요한 다양한 활동들을 스스로 설계하고 진행한다. 학생들은 산 업체 인턴 프로그램, 해외 기관 인턴 프로그램, 연구실 인턴 프 로그램 등에 참여하고 이를 활용할 수 있다."
                },
                {
                    "name": "식품산업현장심화실습Ⅰ",
                    "description": "식품회사를 방문하여 식품회사 직원/연구원들의 교육하에 실제 현장에서 심화된 경험을 얻는다."
                },
                {
                    "name": "식품산업현장심화실습Ⅱ",
                    "description": "식품회사를 방문하여 식품회사 직원/연구원들의 교육하에 실제 현장에서 심화된 경험을 얻는다."
                },
                {
                    "name": "식품공학글로벌필드트레이닝Ⅰ",
                    "description": "글로벌 사회 진출에 필요한 글로벌 커리어 경험과 커뮤니케이션 및 현장지식 및 기술역량을 배양하는 것을 목표로 하며, 국내외 다양한 커리어 개발을 권장한다."
                },
                {
                    "name": "식품공학글로벌필드트레이닝Ⅱ",
                    "description": "글로벌 사회 진출에 필요한 글로벌 커리어 경험과 커뮤니케이션 및 현장지식 및 기술역량을 배양하는 것을 목표로 하며, 국내외 다양한 커리어 개발을 권장한다."
                },
                {
                    "name": "식품공학글로벌필드트레이닝Ⅲ",
                    "description": "글로벌 사회 진출에 필요한 글로벌 커리어 경험과 커뮤니케이션 및 현장지식 및 기술역량을 배양하는 것을 목표로 하며, 국내외 다양한 커리어 개발을 권장한다."
                },
                {
                    "name": "식품공정수학",
                    "description": "식품공정과 연관된 단위, 데이터분석, 물질수지, 열수지 등 수학 적 기초지식에 대하여 학습한다."
                },
                {
                    "name": "식품기능성및독성학",
                    "description": "식품에서 유래하는 생리기능성 및 독성물질들을 이해하고 이들이 생체에 미치는 효과에 대한 평가방법, 작용기전에 대하여 학습한 다."
                },
                {
                    "name": "식품공학통계분석",
                    "description": "식품 산업에서 다양한 비즈니스 목적을 과학적이고 합리적으로 달성하는데 필요한 선형회귀분석과 이와 연계된 다양한 통계 분 석 방법의 원리를 이론적, 실용적 측면에서 학습한다."
                },
                {
                    "name": "효소공학이론및실습",
                    "description": "생물촉매로서 효소의 속도론적 특성과 반응메카니즘을 이해하고 이들이 식품 및 바이오산업에서의 고부가가치 소재 (예로, 알코 올, 아민, 카르복실산)의 생합성에 어떻게 이용되는지 공부한다."
                },
                {
                    "name": "식품위생실험",
                    "description": "식품위생에 관한 일련의 실험기법을 익히는 강의로, 식품 중 발 생할 수 있는 위해요소의 정량/정성평가, 다양한 식중독세균의 분리 및 동정, 신속검출법, 위해요소 제어기술 등 다양한 실험을 실습한다."
                },
                {
                    "name": "식품생물고분자공학",
                    "description": "식품소재 내 생물고분자(탄수화물, 단백질, 지방)의 물리화학적 특성을 학습하고, 추출, 가공, 응용방법에 대한 전반적인 방법을 이해한다."
                },
                {
                    "name": "식품미생물유전체학",
                    "description": "식중독균과 숙주, 세균과 세균, 세균과 바이러스 상호작용 등 미 생물 군집 수준에서 식품 및 인체의 상태를 이해하고, 식중독균 을 모니터링/제어하기 위한 합성생물학적/생물정보학적 실험/분 석법을 학습한다."
                },
                {
                    "name": "식품가공설계및실험",
                    "description": "식품가공학을 중심으로 이와 관련된 신규 공학기술분야의 주요 원리 및 이론과 가공장비, 품질평가에 대해 학습한다. 강의내용 을 바탕으로 식품가공현장에 적용가능한 실례 실습으로 진행한다 ."
                }
            ],
            "화공신소재공학과": [
                {
                    "name": "화공양론",
                    "description": "화학공학 및 신소재 공정에서 발생하는 전반적인 문제해결의 기 초가 되는 단위환산, 물질수지, 에너지 수지의 기본적인 이론들 과 계산방법을 학습한다."
                },
                {
                    "name": "화공열역학",
                    "description": "화학공학 분야에서 응용될 수 있는 고전 열역학의 기본 개념을 습득한다. 열역학 법칙, 안정성과 평형의 개념, 순수물질과 혼합 물의 상태방정식, 상평형과 화학평형 등에 대하여 학습한다."
                },
                {
                    "name": "화공유체역학",
                    "description": "화공유체역학은 유체가 가해지는 힘에 대하여 어떻게 반응하는지 를 배우는 과목이다. 화학공학 뿐만 아니라 기계공학, 항공공학, 기상학 및 동물학 분야에서 매우 중요한 응용분야를 가진 고전 물리학의 한 분야이다. 대부분의 화학 공정이 유체 단계에서 부 분적으로 또는 전체적으로 수행되기 때문에 화공유체역학에 관한 이해는 화공엔지니어에게 필수적이다."
                },
                {
                    "name": "반응공학",
                    "description": "본 강의에서는 반응기의 종류, 전환율과 이에 따른 반응기의 크 기 결정, 등온반응기의 설계, 반응속도 자료의 해석, 복합반응 등에 대해 다룰 것이다. 특히, 다양한 화학반응 시스템에서의 반 응기의 적절한 선택 및 설계방정식을 활용한 크기 결정에 대해 학생들 스스로 공학적 수식 문제를 해결할 수 있도록 하는데 주 안점을 둔다."
                },
                {
                    "name": "재료공학개론",
                    "description": "재료와 관련된 열역학 법칙 및 상태량, 결정질 및 비정질 상태, 대칭성, 점/선/면 결정결함, 회절 및 이를 이용한 결정 구조 해 석 등 재료공학의 기본을 다룬다."
                },
                {
                    "name": "화공신소재기초실험",
                    "description": "화학평형 원리를 중심으로 화학공정에서 실제로 접하게 되는 중 요한 사항들에 대한 이론을 체계적으로 소개하고 실험을 통해 중 요 분석법에 대한 기술을 습득하게 한다."
                },
                {
                    "name": "열및물질전달",
                    "description": "본 강좌에서는 정상 상태, 비정상 상태 열전도 및 확산, 복사 열 전달, 층류 및 난류에서의 대류 현상 등 열 및 물질 전달의 기본 개념을 습득한다. 특히 현상의 이해를 통한 열 및 물질 전달 문 제에 대한 실제 해결 능력 배양에 그 초점을 둔다."
                },
                {
                    "name": "화공단위조작실험",
                    "description": "화학공학에서는 원료를 에너지를 주어 변화시키거나 분리하여 유 용한 제품을 만드는 프로세스(공정)를 다룬다. 대부분의 프로세 스에서는 고체나 유체를 수송하고, 열이나 다른 형태의 에너지를 한 물체에서 다른 물체로 전달하며, 건조, 분쇄, 증류, 증발 등 의 단위조작을 수행한다. 이러한 단위조작들을 체계화하면 프로 세스를 통일적이고 간편하게 다룰 수 있다. 본 과목은 이러한 단 위조작의 기본 개념들을 학습하고 실험과 모델링을 통하여 종합 적으로 이해할 수 있도록 구성되어 있다."
                },
                {
                    "name": "화공수치해석",
                    "description": "화공수치해석은 화학 반응기 설계, 열 및 물질 전달 분석 및 공 정 최적화를 비롯하여 중요한 화학 공학 문제를 해결하는 데있어 최신 계산 및 수학 기법을 이해하고 실제로 활용하는 기술을 습 득하는데 초점을 둔다."
                },
                {
                    "name": "공정제어시스템",
                    "description": "글로벌 경쟁, 급변하는 경제 상황, 더 빠른 제품 개발 및보다 엄격한 환 경 및 안전 규제로 인해 프로세스 산업에서 프로세스 제어가 점차 중요 해지고 있다. 프로세스 제어 및 관련 프로세스 모델링 및 최적화 분야는 고 부가가치 제품을 생산하기위한보다 유연하고 복잡한 프로세스 개발에 중요하다. 또한, 저렴한 디지털 기술의 지속적인 개발로 인해 고성능 계 측 및 제어 시스템이 산업 플랜트의 필수 부분이되었다. 전반적으로 프로 세스 제어 기술의 범위와 중요성은 21 세기에도 계속 확장 될 것임이 분 명하다. 결과적으로 화공엔지니어는 현대 가공 공장을 개발, 설계 및 운 영 할 수 있도록이 주제를 마스터해야한다."
                },
                {
                    "name": "신소재실험",
                    "description": "본 교과목에서는 소재의 합성 및 평가를 포함한 소재 처리의 전 공정에서 사용될 수 있는 다양한 응용, 고급 기법에 대한 실험 및 실습을 진행한다."
                },
                {
                    "name": "화학공정설계",
                    "description": "본 교과목에서는 산업계에서 이용되는 화학공정설계에 대한 실습 을 행한다. 특히 규모 추산 기법, 부분 및 전체 공정의 경제성 분석, 최적화 방법론 등을 전산 기법을 습득하여, 실용적 설계능 력을 배양한다."
                },
                {
                    "name": "고분자공학",
                    "description": "본 강좌에서는 산업계에서 응용되는 고분자의 합성과 물리화학적 특성에 대한 기초 지식을 학습한다. 중합 반응 등 고분자 합성방 법 및 고분자의 열역학적, 화학적, 형태학적 고찰, 기계적/전기 적/광학적 물성 및 고분자 혼합물 등에 대한 개념을 강의한다."
                },
                {
                    "name": "촉매공학",
                    "description": "화학적 변환 과정에 사용되는 다양한 촉매의 설계와 구현에 관한 기초 지식을 다룬다. 특히 친환경, 지속가능한 화학 공정을 중심 으로 실제 산업체에서 광범위하게 사용되는 촉매 공정을 소개하 여 실무 적응력을 배양한다."
                },
                {
                    "name": "전기화학공학",
                    "description": "본 교과목에서는 전기화학과 전기화학공학의 기본 원리를 다룬다 . 특히 에너지 저장과 변환에 관련된 전기화학 시스템이나 공정, 즉, 배터리, 연료전지, 전기반응로 및 전기화학적 해석 기법에 그 초점을 맞춘다."
                },
                {
                    "name": "화공신소재공학인턴십Ⅰ",
                    "description": "본 교과목은 화공신소재공학과 현장실습을 강화하기 위한 실습수 업으로서 산업체 및 국공립연구소 등 관계기관의 현장에서 이루 어진다. 학생들은 현장에서 학교에서 배운 화학신소재공학의 기 초지식을 실제적인 문제에 적용하는 방법을 배운다."
                },
                {
                    "name": "화공신소재공학종합설계",
                    "description": "화공신소재공학에서 요구되는 실제적인 문제 해결을 설계과정에 따라 직접 수행하게 하는 교과임. 본 교과목을 통해 그간 습득한 전공지식을 종합적으로 적용, 수행해 나갈 수 있는 능력을 배양 한다."
                },
                {
                    "name": "공학유기화학Ⅰ",
                    "description": "공학유기화학I은 공학인이 지녀야할 유기화학 지식을 전달한다. 화학신소재공학이 다루는 대부분의 소재가 유기물이며, 소재의 분자 수준 이해는 유기물의 명명, 구조, 특성, 반응 특성에 대한 지식을 필요로 한다. 공학유기화학 I에서는 이러한 유기 화학의 전반적인 지식 습득을 목표로 한다."
                },
                {
                    "name": "공학물리화학Ⅰ",
                    "description": "공학물리화학은 화학신소재공학 관점에서 물리화학의 여러 분야 를 다룰 것이다. 공학물리화학 I은 그 가운데에서도 열역학을 주 로 다룬다."
                },
                {
                    "name": "공학유기화학Ⅱ",
                    "description": "공학유기화학II는 공학유기화학I의 후속 과목으로, 다양한 유기 반응의 원리에 대한 지식 습득을 목표로 한다."
                },
                {
                    "name": "공학물리화학Ⅱ",
                    "description": "공학물리화학II는 공학물리화학I의 후속 과목으로, 반응속도론과 관련되는 분야를 주로 다룬다."
                },
                {
                    "name": "공학기기분석",
                    "description": "다양한 화학 성분을 분석하기 위해서는 여러 방법을 사용하며, 주로 기기를 활용하게 된다. 공학기기분석에서는 그 방법들의 원 리를 이해하고, 그 방법을 활용한 기기들의 원리와 응용방법을 주로 배울 것이다."
                },
                {
                    "name": "생물화학공학",
                    "description": "생물화학공학은 발효, 미생물을 이용한 화학제품 생산, 그리고 연관한 약학, 의학, 생명과학 분야와의 연계를 통한 생물학적 지 식을 공학적으로 활용하는 방법에 대한 학문이다. 생물화학공학 에 대한 입문과정으로 기본적인 생물과 공학적인 지식의 융합적 인 활용에 대해 주로 배울 것이다."
                },
                {
                    "name": "응용생화학",
                    "description": "생물화학공정을 개발, 활용하기 위해서는 생물학에 관련된 여러 현상을 화학적으로 이해하는 것이 필요하다. 응용생화학에서는 생물화학공정에 응용하기 위한 생물학적 현상을 분자 수준에서의 이해하는 방법론을 다룬다."
                },
                {
                    "name": "무기재료화학",
                    "description": "유기 금속 분자, 배위 화합물, 결정 재료의 이해와 응용에 필수 적으로 요구되는 무기 화학의 기초 지식, 즉 bond theory, group theory, molecular orbital theory, 및 coordination chemistry 를 습득한다."
                },
                {
                    "name": "화공신소재공학인턴십Ⅱ",
                    "description": "본 교과목은 화공신소재공학과 현장실습을 강화하기 위한 실습수 업으로서 산업체 및 국공립연구소 등 관계기관의 현장에서 이루 어진다. 학생들은 현장에서 학교에서 배운 화학신소재공학의 기 초지식을 실제적인 문제에 적용하는 방법을 배운다."
                },
                {
                    "name": "화공신소재공학인턴십Ⅲ",
                    "description": "본 교과목은 화공신소재공학과 현장실습을 강화하기 위한 실습수 업으로서 산업체 및 국공립연구소 등 관계기관의 현장에서 이루 어진다. 학생들은 현장에서 학교에서 배운 화학신소재공학의 기 초지식을 실제적인 문제에 적용하는 방법을 배운다."
                },
                {
                    "name": "화공신소재공학글로벌인턴십",
                    "description": "본 교과목은 화공신소재공학과 해외 현장실습을 강화하기 위한 인턴십 프로그램으로 등 해외 산업체에서 이루어진다. 학생들은 현장에서 학교에서 배운 화학신소재공학의 기초지식을 실제적인 문제에 적용하는 방법을 배운다."
                },
                {
                    "name": "화공신소재공학글로벌필드트레이닝Ⅰ",
                    "description": "글로벌 사회 진출에 필요한 글로벌 커리어 경험과 커뮤니케이션 및 현장지식 및 기술역량을 배양하는 것을 목표로 하며, 국내외 다양한 커리어 개발을 권장한다."
                },
                {
                    "name": "화공신소재공학글로벌필드트레이닝Ⅱ",
                    "description": "글로벌 사회 진출에 필요한 글로벌 커리어 경험과 커뮤니케이션 및 현장지식 및 기술역량을 배양하는 것을 목표로 하며, 국내외 다양한 커리어 개발을 권장한다."
                },
                {
                    "name": "화공신소재공학글로벌필드트레이닝Ⅲ",
                    "description": "글로벌 사회 진출에 필요한 글로벌 커리어 경험과 커뮤니케이션 및 현장지식 및 기술역량을 배양하는 것을 목표로 하며, 국내외 다양한 커리어 개발을 권장한다."
                },
                {
                    "name": "화공신소재공학자기설계프로젝트Ⅰ",
                    "description": "학생들이 자신의 학습 목표를 스스로 세우고, 학습 목표 달성에 필요한 다양한 활동들을 스스로 설계하고 진행한다. 학생들은 산 업체 인턴 프로그램, 해외 기관 인턴 프로그램, 연구실 인턴 프 로그램 등에 참여하고 이를 활용할 수 있다."
                },
                {
                    "name": "화공신소재공학자기설계프로젝트Ⅱ",
                    "description": "학생들이 자신의 학습 목표를 스스로 세우고, 학습 목표 달성에 필요한 다양한 활동들을 스스로 설계하고 진행한다. 학생들은 산 업체 인턴 프로그램, 해외 기관 인턴 프로그램, 연구실 인턴 프 로그램 등에 참여하고 이를 활용할 수 있다."
                },
                {
                    "name": "화공신소재공학고급실험Ⅰ",
                    "description": "화공신소재공학 각 분야의 최신 연구에 직접 참여하여 실험 결과 를 도출한다. 과학적인 실험 설계 방법, 실험 원리 이해, 결과 해석 등 연구 리더의 실험을 접한다."
                },
                {
                    "name": "화공신소재공학고급실험Ⅱ",
                    "description": "화공신소재공학 각 분야의 최신 연구에 직접 참여하여 실험 결과 를 도출한다. 과학적인 실험 설계 방법, 실험 원리 이해, 결과 해석 등 연구 리더의 실험을 접한다."
                },
                {
                    "name": "화공신소재공학고급실험Ⅲ",
                    "description": "화공신소재공학 각 분야의 최신 연구에 직접 참여하여 실험 결과 를 도출한다. 과학적인 실험 설계 방법, 실험 원리 이해, 결과 해석 등 연구 리더의 실험을 접한다."
                },
                {
                    "name": "화공수학",
                    "description": "공학의 기반이 되는 수학인 공업수학 대해 공부한다. 행렬, 푸리 에분석, 푸리에함수, 편미분방정식 등의 다양한 해법에 대해 알 아보고 수학적인 해의 의미를 이해한다."
                },
                {
                    "name": "반도체전자재료",
                    "description": "반도체 전자 재료의 전기적, 자기적 성질을 발생시키는 원자 수 준의 이해를 다루며 구조-특성 상관성을 습득한다."
                },
                {
                    "name": "화공신소재공학입문",
                    "description": "화공신소재공학전공의 세부전공 안내를 통해 화학공학과 신소재 공학의 교육 및 연구분야에 대한 심도있는 이해를 도모한다. 화 공신소재공학전공의 신입생들이 화공신소재공학전공의 졸업 후에 진출할 수 있는 산학연 분야에 대해 이해하고, 졸업 후의 커리어 를 주도적으로 설계할 수 있는 능력을 배양한다."
                },
                {
                    "name": "에너지공학",
                    "description": "본 과목에서는 대체 에너지원을 이용하여 전기에너지를 생산-변 환-저장하는 첨단기술 분야에 있어서 금속, 세라믹스, 폴리머, 복합재료에 대해 학습하고, 태양전지, 리튬이온전지, 수퍼캐패시 터, 연료전지 산업 내 재료공학적인 측면에서 이루어지고 있는 기술개발의 트렌드를 알아본다."
                },
                {
                    "name": "분리공정",
                    "description": "화학공정의 대표적 공정인 분리기술의 기본 원리와 이에 수반되 는 물질 및 에너지 수지, 실제 적용되는 분리 방법 및 범용 기술 에 대해 알아본다. 주어진 조건과 요구에 맞는 분리기술을 선택 하고, 분리 공정을 설계할 수 있는 방법을 습득한다."
                },
                {
                    "name": "반도체공정",
                    "description": "반도체 가공에 필요한 화학 공정의 기본 원리를 습득한다. 이를 통하여 식각, 증착, 산화 등의 반도체산업의 주요 공정들에 화공 신소재공학의 기본 원리들이 어떻게 적용되는지를 이해할 수 있 다."
                },
                {
                    "name": "화공전산설계",
                    "description": "본 과목에서는 최근 화공신소재공학 관련 산업계와 학계에서 필 수적으로 요구되고 있는 역량인 컴퓨터 과학을 화공신소재공학 적용을 중심으로 소개하고자 한다. 이론적으로는 머신러닝, 최적 화, 수치해석 등을 파이썬 코딩을 통해 구현하는 것을 기본으로 하며, 이를 소재물성예측, 공정(반도체, 베터리 등 포함) 최적화 , 제품 역설계 등에 적용할 수 있는 능력을 배양한다."
                }
            ],
            "건축학과": [
                {
                    "name": "K-MOOC:건축으로읽는사회문화사",
                    "description": "이 과목은 고대에서 바로크에 이르는 서양건축역사에 대해 배운다. 고대 에서는 이집트와 근동건축, 그리스에서는 에게 해와 그리스 본토 건축, 로마에서는 왕조사에 따르는 전개과정과 구조공법, 초기기독교에서는 바 실리카와 무덤형 교회의 형성과정, 비잔틴건축에서는 펜던티브 돔에 의한 중앙집중형 교회 등에 대해 배운다. 중세는 로마네스크와 고딕으로 나누 어진다. 로마네스크에서는 고대 고전주의에서 중세 유기주의로의 전환에 대해서, 고딕에서는 플라잉버트레스, 리브 볼트, 다발기둥 등의 유기구조 공법에 대해 배운다. 초기근대는 르네상스와 바로크로 나누어진다. 르네 상스에서는 고전 리바이벌과 매너리즘에 대해서, 바로크에서는 가톨릭 부 활과 절대왕정의 등장에 따른 새로운 건축양식에 대해 배운다."
                },
                {
                    "name": "건축설계2",
                    "description": "건축의 기본적 관계인 형식과 내용의 관계를 이해하고, 특정 내 용을 담는 용기를 디자인하고 제작함으로서 재료의 물성과 구축 을 터득한다. 또한 건축과 대지, 이들을 둘러싼 환경 간의 기 초적 관계를 이해하고, 건축 사용자의 활동 및 프로그램(상점)을 해석하여 이를 디자인에 반영하는 과정을 습득한다. 또한 매체를 통해 자신의 아이디어를 표현하고 의사소통하는 발전된 방법을 습득한다."
                },
                {
                    "name": "건축설계3",
                    "description": "중소규모 건물을 대상으로, 건축에 있어서 개념의 중요성을 인식 하고 프로그램적 활동(문화시설)을, 대지와 환경 등을 적극적으 로 해석하며 건축적으로 수용하는 방식을 학습한다. 또한 구조와 시공에 대한 개론적 이해를 바탕으로 건축의 물리적 구축방법이 디자인과 맺는 관계를 파악하고 이들을 총체화 하는 기초적 과정 을 학습하는 것과 함께 설계과정 상의 매체, 그리고 표현상의 매 체 활용을 숙지한다."
                },
                {
                    "name": "건축설계4",
                    "description": "중규모 이상의 건물에서 요구되어지는 설계과정의 체계화를 익힌 다. 대지 및 주변 환경의 분석 및 프로그램의 해석과 이러한 상 황에 대한 총합화를 밀도 있게 작업하며, 구조와 시공에 대한 발 전된 이해를 바탕으로 건축의 물리적 구축방법과 건축 재료의 물 성을 이해하고, 이들을 아우르는 개념설정과 그것의 건축화 능력 을 배양한다."
                },
                {
                    "name": "건축설계5",
                    "description": "도시의 요소, 구성 방식, 도시의 활동 등에 대한 이해를 바탕으 로 건축이 그 환경과 관계 맺는 방식을 밀도 있게 탐구할 뿐만 아니라 건축이 역사적, 정치적, 사회적, 문화적 시대상황과 관계 하는 방식을 탐구한다."
                },
                {
                    "name": "건축설계X",
                    "description": "본 교과목은 학년별로 동일한 프로그램으로 진행되는 기존 스튜 디오 방식에서 벗어나, 각 분반별로 설계 튜터의 전문성, 교육철 학 및 교수법에 맞춰 특화된 개별 주제로 운영되는 실험적인 스 튜디오이다. 급격히 변화하는 시대의 흐름에 대응하여 건축의 새 로운 가능성을 제시하거나 융합적인 관점에서 건축의 경계를 확 장시킬 수 있는 새로운 건축적 시도들을 소개하고 교육한다."
                },
                {
                    "name": "건축졸업설계(종합설계)",
                    "description": "역사적, 동시대적 상황의 이해를 배경으로 관심주제를 설정하고 그 주제를 밀도 있게 탐구하며 건축에서의 새로운 가능성에 대해 서 탐구하는 것과 함께 그에 대한 이론화 또는 체계화 방법을 모 색한다. 이러한 작업의 과정과 결과물들을 총체적이며 효과적으 로 의사소통할 수 있는 방식을 습득한다. 본 설계결과물은 졸업 전시회에 출품하는 것으로 원칙으로 한다."
                },
                {
                    "name": "디자인과표현1",
                    "description": "3차원 디자인 영역의 다양한 표현기법과 방법론에 대한 전반적인 이해를 제공한다. 디자인과 표현에 대한 이론적인 개괄과 함께 스케치, 정투영법, 투시도법, 콜라쥬, 사진 등 다양한 표현기법 적 내용과 핸드 드로잉에서부터 컴퓨터 그래픽까지 관련 기술을 경험하고 실습한다. 이를 통해 학생들은 디자인을 탐구하고 표현 하는 개인 고유의 표현기법 개발을 시도한다."
                },
                {
                    "name": "디자인과표현2",
                    "description": "건축공간의 기본 개념과 기초적인 건축도면의 이해 및 작성, 모 형 및 투시도 표현등을 습득한다. 설계초기 개념의 설정과 이의 발전을 통한 공간의 구축을 경험하며, 기능적, 심미적 이해를 바 탕으로 어떻게 이를 다양한 방법으로 표현할 것인지 실습한다. 이러한 과정을 통해 학생들은 건축도면 및 다이어그램, 렌더링, 모형, 동영상에 이르기까지 다양한 표현방법을 시도한다."
                },
                {
                    "name": "건축사2",
                    "description": "이 과목은 18-19세기의 프레모던과 20세기 전반부의 모더니즘 건축에 대 해 배운다. 프레모던기에는 신고전주의와 낭만주이가 양대축을 이루는 가 운데 과학정신, 합리주의, 신건축운동 등 모더니즘의 전초적 운동들이 나 타났다. 모더니즘은 아르누보와 미술공예운동의 초기 단계를 거쳐 미래주 의를 기점으로 아방가르드기에 진입했다. 이후 1910년대의 표현주의를 거 쳐 1920년대에 데수틸, 르코르뷔지에, 신즉물운동, 바우하우스, 구성주의 등 추상회화운동에서 절정에 달했다. 이런 움직임은 1930년대 국제주의로 발전하면서 모더니즘을 대표하는 양식운동이 되었다. 1930년대에는 이외 에 나치즘, 파시즘, 스탈린주의 등 전체주의 정권을 위한 건축이 또 다른 한 축을 이끌었다."
                },
                {
                    "name": "어반랜드스케이프",
                    "description": "본 교과목은 광범위한 도시의 외부 건조환경을 계획하고 설계하 는데 필요한 기초이론과 설계방법을 배우는 것을 목표로 한다. 이를 위해 전통적인 조경계획뿐만 아니라 외부공간을 자연과 생 태, 사회적 맥락과 인간행태, 기능적, 심미적인 관점에서 접근하 는 다양한 기초이론과 사례학습을 통해 공원, 광장, 가로, 단지 및 소규모 도시공간 등의 오픈 스페이스를 대상으로 외부공간을 통합적으로 계획하고 창의적으로 설계할 수 있는 방법을 배운다."
                },
                {
                    "name": "디지털디자인",
                    "description": "디지털디자인의 이론적 배경을 바탕으로, 파라메트릭 디자인 및 디지털 패브리케이션 등 새로운 디자인과 기술의 경향에 대해 이 해한다. 단순한 형태 재현의 도구를 넘어서 기하학적 구축원리에 근거한 자유로운 형태 생성과 변형의 도구로써의 디지털 디자인 을 실습한다. 더 나아가 새로운 재료와 첨단 디지털 장비를 통한 디지털 패브리케이션 과정의 기본을 이해한다."
                },
                {
                    "name": "한국건축사",
                    "description": "고대에서 근대에 이르기까지 한국인의 가치관이 반영된, 그리고 그 자취로서 나타난 건축의 양식과 내용을 알아봄으로써 전통 문 화의 고유성과 독창성을 이해하고 또한 새로운 건축 문화 창조에 적극적인 관점을 갖도록 준비된 교과목이다."
                },
                {
                    "name": "도시설계",
                    "description": "본 강좌는 도시설계의 여러 가지 이론과 과정을 논의하고, 도시 설계의 수법과 실천사례를 학습한다. 수강생들은 세미나 차원에 서 넓은 탐색과 깊은 관찰을 통하여 도시설계의 의미를 터득하며 , 서울을 대상으로 과제를 수행한다."
                },
                {
                    "name": "주거학",
                    "description": "주거의 의의와 개념 및 주거공간의 역사, 주거문제, 주거관련 법 규, 주거 건축의 구조와 시공 등 주거를 중심으로 한 건축 전반 의 기초적 지식을 습득한다. 특히 오늘날 주거의 일반적 양상이 된 공동주택 계획과 설계에 대한 다양한 이론 및 사례를 탐구한 다."
                },
                {
                    "name": "건축제도와정책",
                    "description": "건축행위는 건축가 개인의 예술 창작 행위이기 이전에 한 지역 내의 경제 산업활동인 것이며, 더 기본적으로는 사람들이 들어가 사는 주거공간을 짓는 행위이다. 따라서 건축 행위는 공공의 복 리를 준수하기 위한 목적하에 최소한도의 제한을 받게 되는데 이 것이 바로 건축 법규이다. 이 과목은 이와 관련된 기본 내용을 습득함을 목적으로 한다."
                },
                {
                    "name": "현대건축",
                    "description": "이 과목은 2차 대전 이후 20세기 후반부의 현대건축에 대해 배운다. 현대건축은 2차 대전에서 자행된 기계폭력에 대한 반성적 대안찾기로 시작되었다. 이것은 곧 독단적 모더니즘에 대한 비판이기도 했다. 이런 움직임은 1950년대 뉴브루털리즘부 터 시작되어 1960년대의 자유정신 운동으로 발전했다. 자유정신 운동에는 팝 건축, 포스트모더니즘, 복합공간 운동 등이 있었다. 1970년대는 1960년대에 대한 반발로 합리주의시기였다. 이때에는 뉴욕 5, 하이테크, 후기 모더니즘, 구조주의, 구조미 학, 미니멀리즘, 신합리주의 등이 있었다. 1980년대는 다시 1970년대에 대한 반발 로 신주관주의 시기였다. 이때에는 해체주의, 신표현주의, 네오바로크, 상대주의 공간운동 등이 있었다. 1990년대는 네오 모더니즘이 이끌었다. 신추상 운동을 필두 로 네오 코르뷔지안 건축, 네오 데스틸, 신구성주의 등이 대표적 운동이었다."
                },
                {
                    "name": "건축과도시",
                    "description": "건축가가 설계하는 건축물은 95% 이상이 도시 내에 지어지게 되 며 따라서 도시에서 건축물이 차지하는 의미를 해석해 내는 능력 은 건축물 자체를 다루는 능력과 함께 중요하게 요구되는 사항이 다. 이 과목에서는 도시의 역사를 통하여 도시를 건설한 도시계 획과 도시 디자인의 방법들을 배우게 된다."
                },
                {
                    "name": "건축통합시스템",
                    "description": "건물의 건설과정에 필수적으로 고려해야 하는 재료, 설비, 방재, 구조, 환경시스템 등을 평가, 선정 후 통합함으로써 설계에 이용 할 수 있도록 한다."
                },
                {
                    "name": "건축실무및취창업",
                    "description": "건축실무에 적용되는 사무소조직, 사업계획, 마케팅, 협상, 재정 관리 등의 기본원칙 및 건축도서의 체계와 그 작성을 인지함과 함께, 프로젝트의 시작부터 계약, 설계, 행정, 감리, 건물의 준 공 및 사후평가에 이르기까지의 건축가의 실무적 역할을 이해한 다."
                },
                {
                    "name": "건축기획",
                    "description": "사회 변화에 따른 건축에 대한 요구조건의 변화를 수용하기 위해 그 중요성이 점점 커지고 있는 건축기획분야를 다룬다. 특히 건 축과 경제의 관계, 삶에 대한 가치 변화 수용, 다분야간 접근 방식 등 건축계의 현안으로 부각되는 문제들을 주로 다루어 실 무지향적인 접근방식으로 진행한다."
                },
                {
                    "name": "건축사1",
                    "description": "이 과목은 고대에서 바로크에 이르는 서양건축역사에 대해 배운다. 고대 에서는 이집트와 근동건축, 그리스에서는 에게 해와 그리스 본토 건축, 로마에서는 왕조사에 따르는 전개과정과 구조공법, 초기기독교에서는 바 실리카와 무덤형 교회의 형성과정, 비잔틴건축에서는 펜던티브 돔에 의한 중앙집중형 교회 등에 대해 배운다. 중세는 로마네스크와 고딕으로 나누 어진다. 로마네스크에서는 고대 고전주의에서 중세 유기주의로의 전환에 대해서, 고딕에서는 플라잉버트레스, 리브 볼트, 다발기둥 등의 유기구조 공법에 대해 배운다. 초기근대는 르네상스와 바로크로 나누어진다. 르네 상스에서는 고전 리바이벌과 매너리즘에 대해서, 바로크에서는 가톨릭 부 활과 절대왕정의 등장에 따른 새로운 건축양식에 대해 배운다."
                },
                {
                    "name": "건축구조시스템",
                    "description": "본 수업은 건축물을 구성하는 구조요소를 이해하며, 이에 대한 구조재료별 구성방법, 구축의 방식 등을 습득하고 그에 관한 역 학적 관계 등을 기술적, 체감적으로 이해하는 하는 것과 함께 공 간의 쓰임새와 조형적, 공법적 상황 등을 감안하여 적합한 구조 시스템을 이해하고 적용할 수 있는 능력을 배양하는 것을 목적으 로 한다."
                },
                {
                    "name": "건축환경시스템",
                    "description": "본 수업은 건축의 열환경, 빛환경, 음환경, 공기질, 에너지(효율 , 전달) 등에 대한 이해와 함께 건축설계 의도에 부합하는 적정 한 건축환경시스템을 선정하고, 건축설계의 디자인에도 적용할 수 있는 능력을 배양함을 목적으로 한다."
                },
                {
                    "name": "건축시공시스템",
                    "description": "본 수업은 건물재료의 물리적 특성과 재료의 사용, 생성, 적용을 방법론적으로 탐구하고, 건축시공의 각종 공법 및 공정과 시공관 리(CM)의 영역까지 포괄하며 건축프로젝트의 상황과 설계의도에 따른 적정한 시공 방식과 체계를 설정하는 방법을 이해하고 그 능력을 배양함을 목적으로 한다."
                },
                {
                    "name": "건축론세미나",
                    "description": "고급 의사소통역량 강화를 목표로 한 세미나 형식의 수업으로서, 유수 건축가들의 건축이론과 건축작품, 그리고 양자의 상호관계 에 대해 학습한다. 선행연구사례와 방법론에 대한 강의, 강독과 더불어 학생들은 세미나 주재 및 토론, 선택주제에 대한 독립연 구를 수행한다."
                },
                {
                    "name": "해외교류스튜디오",
                    "description": "방학중 해외 건축학교육프로그램과 공동으로 진행되는 스튜디오 교과목을 개설하고 상호 학생교류와 공동 스튜디오지도를 통해 학생들의 해외경쟁력강화와 국제적 수준의 설계실습교육을 목표 로 한다."
                },
                {
                    "name": "건축실무인턴십Ⅰ",
                    "description": "건축 설계실무의 경험을 쌓기 위해 건축학과에서 승인한 설계사 무실에 파견되어 한 학기동안 주 당 정해진 시간을 기준으로 근 무한다. 교과과정을 통해 익힌 설계 및 건축 관련 지식을 실제 프로젝트에 적용해 보고 현장학습을 통해 실무 업무를 경험하고 학습한다. 인턴십 기간 동안 실무실습일지 및 인턴십 보고서를 제출한다."
                },
                {
                    "name": "해외건축과어버니즘",
                    "description": "여름계절학기로 개설되는 본 교과목은 해외 도시를 방문, 해외 도시 및 건축물 탐방을 통한 실질적인 건축적 경험을 목표로 한 다. 해외 도시와 건축물의 이해를 위해 국내외 전문가의 강연 및 도시가 형성되는 사회적 문화적 물리적 배경을 직접 체험함으로 써 각 도시의 건축과 도시 공간의 특성을 비교 분석할 수 있는 능력을 기른다. 각 해외건축과 어버니즘에 나타나는 특이한 지역 성를 찾아보고 또한 해외 도시에서 공통적으로 나타나는 세계화 의 현상도 탐구하는 것을 목표로 한다."
                },
                {
                    "name": "건축구조의이해",
                    "description": "건축물의 설계 및 시공을 위하여 기본적으로 고려하여야 하는 구 조개념을 소개하고, 건축물의 구성법 및 축조법의 기본적 기술을 학습한다. 각종 구조재료의 역학적 특성과 구조물에 작용하는 하 중 및 건축구조설계를 위하여 고려하여야 할 필요조건 등에 대하 여 강의한다. 그리고 현재 완공되었거나 시공중인 각종 건축구조 물의 구조형식 등에 대하여 강의함으로써 건축에서의 구조원리를 이해하도록 한다."
                },
                {
                    "name": "건축재료",
                    "description": "본 교과목은 건축재료의 기본적인 물성과 재료의 구축에 대한 전 반적인 이해를 바탕으로, 주요 마감에서 활용되는 주요자재의 특 성, 시공법등에 대한 지식전달을 목적으로 한다. 건축재료에 따 라 적용되는 디테일 및 구축법에 대한 이해를 바탕으로 건축가들 의 재료와 선택과 구축방법이 어떻게 이루어졌는지 학습한다. 또 한, 전통적인 건축재료의 영역을 넘어서 각종 합성재료, 스마트 머티리얼 등 고성능 건축자재들의 최신 동향을 연구하고, 재료의 특성에 기인한 실험적인 디자인 접근법에 대해 탐구한다."
                },
                {
                    "name": "친환경건축",
                    "description": "본 교과목은 건물 내부 및 외부의 공간환경을 조정하는 건축적, 기계적 방식에 대해서 조절하고 통제하는 시스템을 이해하고 건 물에 필요한 에너지를 효율적으로 관리하기 위한 저탄소, 저에너 지 사용의 원리와 방법에 대해 이해한다."
                },
                {
                    "name": "해외재능기부현장실습",
                    "description": "저개발 국가의 사회복지단체 및 NGO에 단기간 파견되어 아동 및 청소년, 현지 교사들에게 학생 개개인의 재능을 발휘하고 본교에 서 배운 전공 지식을 활용하여 교육 봉사 활동을 한다. 수원국 대학생과 함께 실습하며, 현지의 문화와 환경, 사회경제적 현황 을 학습한다."
                },
                {
                    "name": "건축실무인턴십Ⅱ",
                    "description": "건축 설계실무의 경험을 쌓기 위해 건축학과에서 승인한 설계사 무실에 파견되어 한 학기동안 주 당 정해진 시간을 기준으로 근 무한다. 교과과정을 통해 익힌 설계 및 건축 관련 지식을 실제 프로젝트에 적용해 보고 현장학습을 통해 실무 업무를 경험하고 학습한다. 인턴십 기간 동안 실무실습일지 및 인턴십 보고서를 제출한다."
                },
                {
                    "name": "건축글로벌산학실무실습Ⅰ",
                    "description": "건축 설계실무의 경험을 쌓기 위해 건축학과에서 승인한 설계사 무실 혹은 외국회사에 파견되어 정해진 시간을 기준으로 근무한 다. 교과과정을 통해 익힌 설계 및 건축 관련 지식을 실제 프로 젝트에 적용해 보고 현장학습을 통해 실무 업무를 경험하고 학습 한다. 인턴쉽 기간 동안 실무실습일지 및 인턴쉽 보고서를 제출 한다."
                },
                {
                    "name": "건축글로벌산학실무실습Ⅱ",
                    "description": "건축 설계실무의 경험을 쌓기 위해 건축학과에서 승인한 설계사 무실 혹은 외국회사에 파견되어 정해진 시간을 기준으로 근무한 다. 교과과정을 통해 익힌 설계 및 건축 관련 지식을 실제 프로 젝트에 적용해 보고 현장학습을 통해 실무 업무를 경험하고 학습 한다. 인턴쉽 기간 동안 실무실습일지 및 인턴쉽 보고서를 제출 한다."
                },
                {
                    "name": "건축글로벌산학실무실습Ⅲ",
                    "description": "건축 설계실무의 경험을 쌓기 위해 건축학과에서 승인한 설계사 무실 혹은 외국회사에 파견되어 정해진 시간을 기준으로 근무한 다. 교과과정을 통해 익힌 설계 및 건축 관련 지식을 실제 프로 젝트에 적용해 보고 현장학습을 통해 실무 업무를 경험하고 학습 한다. 인턴쉽 기간 동안 실무실습일지 및 인턴쉽 보고서를 제출 한다."
                },
                {
                    "name": "건축도시읽기",
                    "description": "이 과목은 건축학전공 1학년 학생들을 대상으로 건축과 도시에 대한 개괄적인 강의와 세미나, 그리고 필드트립으로 진행된다. 도시건축을 문화적 현상으로 이해하는 인문학적 접근과 실질적인 사례조사를 통해, 학생들은 삶과 역사의 인문학적 축적으로서 건 축과 도시를 탐구하고 체험한다."
                },
                {
                    "name": "건축컴퓨터프로그램실습",
                    "description": "이 과목은 디지털 환경에서 시각 표현 수단으로 널리 활용되는 어도비 포토샵(Adobe Photoshop)과 일러스트레이터 (Illustrator), 인디자인(Indesign) 소프트웨어의 기본적인 테크 닉을 배우고 이를 활용하여 이미지를 조형적으로 표현하는 방법 을 습득한다. 디자인의 기초 이론을 바탕으로 이미지의 조정, 합 성 변형, 레이아웃을 통한 자연스러운 프리젠테이션 연출을 위한 실습을 진행한다."
                },
                {
                    "name": "디자인워크숍",
                    "description": "본 교과목은 여름 혹은 겨울학기 중 개설되는 집중 실무 교과목 으로 건축내외의 전문가의 특강 및 실습을 통해서 건축에 직접 적으로 적용되고 사용되는 최신의 테크닉을 습득하고 직접 기획 되고 디자인된 프로젝트를 실제 결과물의 완성를 목표로 한다."
                },
                {
                    "name": "건축자기설계프로젝트Ⅰ",
                    "description": "학생들이 자신의 학습 목표를 스스로 세우고, 학습 목표 달성에 필요한 다양한 활동들을 스스로 설계하고 진행한다. 학생들은 산 업체 인턴 프로그램, 해외 기관 인턴 프로그램, 연구실 인턴 프 로그램 등에 참여하고 이를 활용할 수 있다."
                },
                {
                    "name": "건축자기설계프로젝트Ⅱ",
                    "description": "학생들이 자신의 학습 목표를 스스로 세우고, 학습 목표 달성에 필요한 다양한 활동들을 스스로 설계하고 진행한다. 학생들은 산 업체 인턴 프로그램, 해외 기관 인턴 프로그램, 연구실 인턴 프 로그램 등에 참여하고 이를 활용할 수 있다."
                },
                {
                    "name": "건축학개론",
                    "description": "건축학부에 진학한 1학년 학생들을 대상으로 건축을 구성하는 제 분야에 대한 개론적 소개를 통해 향후 수학에 도움을 주기 위한 목적을 갖는다. 건축을 구성하는 다양한 분야에 대한 개괄적인 소개와 함께 각종 세미나와 사례 조사를 통해 각 분야별 세부 전 공에 대한 이해를 높이고 아울러 각 분야별 실무에 대한 소개로 건축학을 전공하면서 갖춰야 하는 다양한 지식과 경험의 틀을 제 공하고자 한다."
                },
                {
                    "name": "디자인기초",
                    "description": "건축에 관계되는 조형의 기본원리와 방법을 통해서 공간의 형태 및 그 조직과 구성에 대해서 학습하며, 인공 환경의 구성적 질서 의 발견 및 개념의 조형적 표현능력을 증진하도록 한다."
                },
                {
                    "name": "건축설계1",
                    "description": "본 설계교과목은 인간에게 가장 기본적인 건축공간으로서 ‘주거 공간’을 설계한다. 거주의 의미와 인간 삶의 기본적 필요와 욕 구에 대한 이해를 바탕으로, 건축의 구성요소, 형태, 공간생성논 리와 구축논리 등을 종합하여 주택이라는 건축공간으로 완성하는 과정을 학습한다."
                },
                {
                    "name": "건축종합설계",
                    "description": "본 교과목은 설계스튜디오의 마지막 단계로서 스튜디오별로 주제 를 설정하되 건축담론의 이론적 이해를 바탕으로 한 새로운 건축 적, 도시적 실험이나 타 분야와의 융합관점에서 실험실습실기방 식으로 교육된다."
                },
                {
                    "name": "디자인컴퓨테이션",
                    "description": "이 교과목은 디자인 사고, 계산 및 인공지능의 교차점을 탐구하 는 고급 과정입니다. 학생들은 알고리즘 사고와 기계 학습 알고 리즘을 사용하여 건축 디자인을 생성, 분석 및 최적화하는 방법 을 배울 것입니다. 학생들은 또한 건축과 디자인에 인공지능을 사용하는 것의 윤리적, 사회적 의미에 대해 배울 것입니다."
                },
                {
                    "name": "공간정보와데이터분석",
                    "description": "이 교과목은 학생들에게 지리 정보 시스템(GIS)과 빅 데이터 분 석을 계획 및 설계에 효과적으로 사용하는 데 필요한 기술과 지 식을 제공할 것입니다. 학생들은 GIS를 사용하여 빅데이터를 시 각화하는 방법과 GIS 데이터의 분석을 향상시키기 위해 빅데이터 를 사용하는 방법, 그리고 다양한 이해 관계자들에게 자신의 결 과를 효과적으로 전달하는 방법도 배울 것입니다."
                }
            ],
            "건축도시시스템공학과": [
                {
                    "name": "재료역학",
                    "description": "구조물이 하중을 받을 때 보, 기둥 등의 부재 내부에서 발생하는 응력과 변형, 그리고 이외에도 축력, 휨, 전단 등에 관한 기초지 식을 습득하고 이러한 기초지식을 응용하여 건축설계에 활용하는 방안을 모색한다."
                },
                {
                    "name": "건축사업비관리",
                    "description": "건설공사에 소요되는 공사비를 산출하기 위해 필요한 공사비 구 성체계, 공종별 물량산출기준, 단가산정방법 등에 대하여 강의하 고, 공동주택이나 오피스 등의 실제 건축프로젝트를 대상으로 공종별 물량산출, 단가적용, 전체공사비 산정, 사업비관리 등의 실습을 시행한다."
                },
                {
                    "name": "구조재료실험",
                    "description": "재료실험은 건축 구조재료의 종류에 대한 이해력 증진 및 구조적 특성의 체험을 위한 실험 및 실습을 위한 과목이다. 각 실험의 내용은 골재의 종류 및 특성과 재료적 특성을 시험하는 방법, 굳 지 않은 콘크리트의 재료적 특성을 이해하는 방법 및 실험, 콘크 리트 공시체의 제작 방법과 강도 실험에 대한 실습을 수행한다. 이 수업에서는 실험 실습과목의 특성상 참여의식이 필수적이며, 각 개인의 이해력 증진을 위하여 토론식 수업이 함께 병행된다."
                },
                {
                    "name": "친환경건축계획및사례",
                    "description": "저에너지 친환경건축을 위한 국내외 기준, 제도를 고찰한다. 국 내외 친환경인증 건축물의 평가부문별 설계, 시공 내용을 통해 주요 기술사례를 학습하고, 국내외 저에너지 친환경건축 사례들 을 연구 분석함으로써, 저에너지 친환경건축을 효과적으로 계획 할 수 있게 한다."
                },
                {
                    "name": "공정원가통합관리",
                    "description": "건설공사 관리의 핵심요소인 공정 및 원가관리를 효과적으로 수 행하기 위하여 요구되는 이론과 방법들에 대해서 이해하고, 실 제 프로젝트를 대상으로 WBS작성, 공기산출, 공정표수립, 원가흐 름분석, 원가공정통합관리 계획수립 등의 실습을 시행한다."
                },
                {
                    "name": "강구조및설계",
                    "description": "강재의 재료적 성질 및 역학적 특성을 다루고, 철골 구조의 구조 시스템, 부재의 설계 방법(허용 응력법 및 극한 강도 설계법)을 소개한다. 구조역학에 대한 이론에 기초하여 휨재, 휨과 압축을 동시에 받는 부재, 접합부 등에 대하여 해석과 설계를 병행하여 강의한다."
                },
                {
                    "name": "지속가능한건축구조",
                    "description": "노후화된 건축구조물의 문제점을 파악하고, 지속가능성에 초점을 둔 건축구조재료와 보수보강공법에 대해 다룬다."
                },
                {
                    "name": "그린리모델링및에너지분석",
                    "description": "건물부문 탄소중립의 핵심인 제로에너지와 그린리모델링 정책 및 사례를 학습한다. 또한 건물 에너지 진단, 해석 및 경제성분석 기법을 배우고 실습한다."
                },
                {
                    "name": "건축도시시스템종합설계",
                    "description": "학생들이 그 동안 배운 지식을 바탕으로 건축/도시시스템에 필요 한 요소기술에 대해 창의적인 아이디어를 제안하고 이를 실제로 건물이나 도시시스템에 적용할 수 있는지 평가한다."
                },
                {
                    "name": "스마트도시안전방재계획",
                    "description": "도시공간에서 자연적 및 인위적 재난 해저드에 대한 리스크 평가 및 관리의 기본 개념을 다룬다. 또한 공공 안전 및 보안, 산업 안전 및 보건의 기본 원칙에 대해서도 습득한다. 스마트 도시 재 난 관리 및 공공 안전에서 첨단 정보통신기술의 활용방법 또한 습득한다."
                },
                {
                    "name": "건축구조와재난대응",
                    "description": "재난에 대응할 수 있는 건축구조공법에 대해 알아보고, 태풍이나 지진, 화재와 같은 극한하중을 적용한 건축물의 구조성능평가와 구조설계기법을 배운다."
                },
                {
                    "name": "제로에너지건축기술",
                    "description": "에너지 절약을 위한 최근의 주요 건축/설비/신재생에너지 기술들 을 건물에서의 적용 실례와 함께 학습하고 이해함으로써, 제로에 너지 건축을 효과적으로 구현할 수 있게 한다."
                },
                {
                    "name": "건설제도및계약관리",
                    "description": "공사목적물의 완성을 위한 계약 진행과정과 구조를 파악하여 건 설 시설물의 완성과정에 필요로 되는 건설관련 계약조건의 작성 취지와 내용을 이해하고 활용할 수 있도록 한다. 또한, 건설계약 의 의의와 중요성을 인식하고 건설계약이 건설 시설물의 효율적 인 완성에 미치는 영향을 파악하도록 한다."
                },
                {
                    "name": "건축통합설계",
                    "description": "건축공학에서 배운 건축구조-설비-시공 및 적산 요소기술을 활용 하여 지정된 건축물을 대상으로 통합설계를 수행해 본다."
                },
                {
                    "name": "구조의이해",
                    "description": "건축구조물의 설계 및 시공을 위하여 기본적으로 고려하여야 하 는 구조계념을 소개하고, 건축물의 구성법 및 축조법의 기본적 기술을 내용으로 하며 지반과 기초, 구체의 재료, 구성, 시공법 상의 각종 구조와 건축성능상의 방화, 방습, 방음구조, 굴호 및 수장 구조 등을 다룬다. 각종 구조재료의 역학적 특성과 구조물 에 작용하는 하중 및 건축구조설계를 위하여 고려하여야 할 필요 조건 등에 대하여 강의한다. 그리고 현재 완공되었거나 시공 중 인 각종 건축구조물의 구조형식 등에 대하여 강의함으로써 건축 에서의 구조원리를 이해하도록 한다."
                },
                {
                    "name": "건축열·공기환경계획",
                    "description": "인간에게 영향을 미치는 건축 열·공기환경 인자 및 이에 대한 자연형 조절 방법을 연구함으로써, 쾌적하고 건강하며 에너지 절 약적인 건물을 계획할 수 있도록 한다."
                },
                {
                    "name": "건축프로젝트관리",
                    "description": "건축프로젝트를 수행하기 위한 전반적인 과정과 프로젝트 관리기 법에 대해 소개한다. 건축프로젝트와 관련된 발주 및 계약제도, 참여자들의 역할 등 프로젝트 환경적인 측면에서부터 프로젝트 목표를 이루기 위한 원가, 공정, 품질 등에 대한 관리기법을 배 우고, 이와 관련된 최신 기술 동향을 소개한다."
                },
                {
                    "name": "건축빛·음환경계획",
                    "description": "인간에게 영향을 미치는 건축 빛환경 및 음환경 인자와 이에 대 한 자연형 조절 방법을 연구함으로써, 쾌적하고 에너지 절약적인 건물을 계획할 수 있도록 한다."
                },
                {
                    "name": "건축시공기술및관리",
                    "description": "본 교과목은 설계도서에 대한 이해를 바탕으로 각종 건설재료 및 장비, 인력, 기법 등을 사용하여 건축시설물을 구현하는 기초지 식을 함양하고자 한다. 이를 위해 수강생들로 하여금 전반적인 건축사업 프로세스를 이해하고, 개별 공종의 공사기술 상세, 관 리계획, 및 공사품질관리 등 공사수행 시 필요한 제반사항에 대 한 지식을 배양하도록 한다."
                },
                {
                    "name": "구조역학",
                    "description": "구조물의 힘의 관계 즉 힘의 흐름(force system)과 평형, 구조물 의 변형, 변위 및 안정에 관한 기본적인 역학이론과 구조물 해석 법을 주요 내용으로 하며 하중, 구조 재료의 성질, 정정구조물의 해석, 탄성체의 기본성질, 부재단면의 응력도 등을 다룬다."
                },
                {
                    "name": "철근콘크리트공학",
                    "description": "철근 콘크리트의 재료적 성질 및 역학적 거동 등에 근거하여 철 근 콘크리트 구조의 설계 방법인 허용 응력법 및 극한 강도 설계 법에 대한 이론을 소개하고, 철근 콘크리트 구조의 특성을 이해 하도록 한다."
                },
                {
                    "name": "건축기계설비시스템",
                    "description": "급배수, 급탕, 환기, 냉난방공조, 소화설비 등 건축 기계설비 시 스템 전반의 개념과 기본원리, 냉난방 부하계산 방법을 이해하고 , 기계설비 설계시 기본이 되는 이론을 습득한다."
                },
                {
                    "name": "첨단도시건축기술",
                    "description": "건축도시시스템의 기획, 설계, 엔지니어링, 시공, 운영, 유지관 리, 리모델링 등 각 과정을 수행하는 데 효율성을 높일 수 있는 BIM, GIS, 센서, 빅데이터, 시뮬레이션, 데이터분석, 최적화, 인 공지능, 디지털트윈 등의 첨단건축기술을 소개한다. 첨단건축도 시기술을 적용하여 해결할 수 있는 관련 분야의 프로젝트를 수행 한다."
                },
                {
                    "name": "건축도시시스템공학기초설계",
                    "description": "수업시간에 배운 전공지식을 실제 현업에 적용할 수 있는 능력을 배양하여 주는 건축도시시스템 설계과목의 입문과정으로 종합적 인 기술응용능력 제고와 함께 사업타당성조사, 계획 설계 등과 같은 프로젝트 초기 단계에서의 디자인 소양을 습득하도록 한다."
                },
                {
                    "name": "프로젝트개발및파이낸싱",
                    "description": "건축프로젝트개발에 필요한 입지분석, 법규분석, 개발기획, 타당 성분석, 자금조달 등의 기법에서부터, 건축물 운영관리, 포트폴 리오 관리 등에 대해 다루며, 실제 사례분석을 통해 사업과정 전 반에 대한 이해를 높인다."
                },
                {
                    "name": "구조물의동적거동",
                    "description": "정적거동과 동적거동의 차이를 이해하고, 거동방정식을 통해 시 간에 따른 구조물의 변형이력을 도출해 본다."
                },
                {
                    "name": "건축환경성능시뮬레이션",
                    "description": "취업/창업, 인턴쉽, 산학 협력을 위한 IT기반 실무적 건축환경 및 에너지성능 시뮬레이션 프로그램의 실습을 수행한다. (전열해 석프로그램, 냉난방부하해석 프로그램, 에너지해석 프로그램 등)"
                },
                {
                    "name": "건축도시정보모델링및활용",
                    "description": "건축정보모델링(BIM)에 대한 개념을 소개하고 소프트웨어를 활용 하여 건축정보모델을 작성하는 방법을 습득한다. 건축과 도시정 보모델을 활용하여 건축도시시스템의 설계, 엔지니어링, 시공, 건설관리, 유지관리, 리모델링, 도시정비 및 개발 등에 활용할 수 있는 방법을 소개한다. 또한 도시정보분석과 모델링(CIM)의 기초적인 개념을 습득한다."
                },
                {
                    "name": "해외재능기부현장실습",
                    "description": "저개발 국가의 사회복지단체 및 NGO에 단기간 파견되어 아동 및 청소년, 현지 교사들에게 학생 개개인의 재능을 발휘하고 본교에 서 배운 전공 지식을 활용하여 교육 봉사 활동을 한다. 수원국 대학생과 함께 실습하며, 현지의 문화와 환경, 사회경제적 현황 을 학습한다."
                },
                {
                    "name": "건축도시시스템인턴십Ⅱ",
                    "description": "본 강의는 현장실습을 통해 수강생으로 하여금 실무에 대한 이해 를 증진하고, 교과과정을 통하여 습득된 지식이 어떠한 방식으로 현업에 적용될 수 있는지 직접 체험할 수 있도록 한다."
                },
                {
                    "name": "건축도시시스템인턴십Ⅰ",
                    "description": "본 강의는 현장실습을 통해 수강생으로 하여금 실무에 대한 이해 를 증진하고, 교과과정을 통하여 습득된 지식이 어떠한 방식으로 현업에 적용될 수 있는지 직접 체험할 수 있도록 한다."
                },
                {
                    "name": "건축도시시스템자기설계프로젝트Ⅰ",
                    "description": "본 교과목은 도전학기를 수행하는 학생만 신청할 수 있는 교과목 으로 스스로 설계한 프로젝트를 수행한다."
                },
                {
                    "name": "건축도시시스템자기설계프로젝트Ⅱ",
                    "description": "본 교과목은 도전학기를 수행하는 학생만 신청할 수 있는 교과목 으로 스스로 설계한 프로젝트를 수행한다."
                },
                {
                    "name": "건축도시시스템인턴십Ⅲ",
                    "description": "본 강의는 현장실습을 통해 수강생으로 하여금 실무에 대한 이해 를 증진하고, 교과과정을 통하여 습득된 지식이 어떠한 방식으로 현업에 적용될 수 있는지 직접 체험할 수 있도록 한다."
                },
                {
                    "name": "건축도시시스템인턴십Ⅳ",
                    "description": "본 강의는 현장실습을 통해 수강생으로 하여금 실무에 대한 이해 를 증진하고, 교과과정을 통하여 습득된 지식이 어떠한 방식으로 현업에 적용될 수 있는지 직접 체험할 수 있도록 한다."
                },
                {
                    "name": "건축도시시스템인턴십Ⅴ",
                    "description": "본 강의는 현장실습을 통해 수강생으로 하여금 실무에 대한 이해 를 증진하고, 교과과정을 통하여 습득된 지식이 어떠한 방식으로 현업에 적용될 수 있는지 직접 체험할 수 있도록 한다."
                },
                {
                    "name": "건축도시시스템산학연계Ⅰ",
                    "description": "본 강의는 중장기 또는 국제 현장실습을 통해 수강생으로 하여금 실무에 대한 이해를 증진하고, 교과과정을 통하여 습득된 지식이 어떠한 방식으로 현업에 적용될 수 있는지 직접 체험할 수 있도 록 한다."
                },
                {
                    "name": "건축도시시스템산학연계Ⅱ",
                    "description": "본 강의는 중장기 또는 국제 현장실습을 통해 수강생으로 하여금 실무에 대한 이해를 증진하고, 교과과정을 통하여 습득된 지식이 어떠한 방식으로 현업에 적용될 수 있는지 직접 체험할 수 있도 록 한다."
                },
                {
                    "name": "건축도시시스템산학연계Ⅲ",
                    "description": "본 강의는 중장기 또는 국제 현장실습을 통해 수강생으로 하여금 실무에 대한 이해를 증진하고, 교과과정을 통하여 습득된 지식이 어떠한 방식으로 현업에 적용될 수 있는지 직접 체험할 수 있도 록 한다."
                },
                {
                    "name": "건축도시시스템산학연계Ⅳ",
                    "description": "본 강의는 중장기 또는 국제 현장실습을 통해 수강생으로 하여금 실무에 대한 이해를 증진하고, 교과과정을 통하여 습득된 지식이 어떠한 방식으로 현업에 적용될 수 있는지 직접 체험할 수 있도 록 한다."
                },
                {
                    "name": "건축도시시스템글로벌필드트레이닝Ⅰ",
                    "description": "글로벌 사회 진출에 필요한 글로벌 커리어 경험과 커뮤니케이션 및 현장지식 및 기술역량을 배양하는 것을 목표로 하며, 국내외 다양한 커리어 개발을 권장한다."
                },
                {
                    "name": "건축도시시스템글로벌필드트레이닝Ⅱ",
                    "description": "글로벌 사회 진출에 필요한 글로벌 커리어 경험과 커뮤니케이션 및 현장지식 및 기술역량을 배양하는 것을 목표로 하며, 국내외 다양한 커리어 개발을 권장한다."
                },
                {
                    "name": "건축도시시스템글로벌필드트레이닝Ⅲ",
                    "description": "글로벌 사회 진출에 필요한 글로벌 커리어 경험과 커뮤니케이션 및 현장지식 및 기술역량을 배양하는 것을 목표로 하며, 국내외 다양한 커리어 개발을 권장한다."
                },
                {
                    "name": "건축도시시스템컴퓨터프로그래밍",
                    "description": "건축도시시스템 관련 문제해결에 필수적인 컴퓨터프로그래밍의 기본원리를 소개하고, 프로그래밍을 통한 공학문제 해결 방법을 배운다."
                },
                {
                    "name": "건축도시시스템공학개론",
                    "description": "건축도시시스템공학 분야의 발전과정, 학문분야, 공학윤리, 공학 자의 역할, 미래 유망 분야 등에 대한 내용을 소개하고, 최근 문 제로 대두되고 있는 도시화/고령화, 기후변화, 에너지 수요증가, 산업 고부가가치화, 사회안전 및 복지향상 등 건축도시시스템공 학과 관련된 문제에 대한 이해를 높이기 위한 산업체 전문가 특 강, 견학, 사례분석 등 다양한 활동을 수행한다."
                },
                {
                    "name": "디지털커뮤니케이션",
                    "description": "건축물을 이루는 건축, 구조, 설비 등의 시스템을 도면으로 표현 하는 방법을 이해한다. 이를 바탕으로 대상 건축물을 CAD, Sketch-Up등의 소프트웨어를 활용하여 표현하는 능력을 함양한다 ."
                },
                {
                    "name": "건축물리학",
                    "description": "지속가능한 건축물과 도시시스템을 이해하기 위한 기초적인 물리 학 이론과 해석 방법을 이해한다. 건물이나 도시시스템에서 열이 나 전기에너지, 유체의 흐름 등 다양한 현상을 물리학적 개념으 로 표현할 수 있는 능력을 함양한다."
                },
                {
                    "name": "전산수치해석",
                    "description": "공학분야에서 사용되는 다양한 계산들을 수치해석적으로 해결하 는 방법에 대해 익힌다. 매트랩과 같은 상용프로그램을 통해 수 치해석을 수행하는 실습과정을 거친다."
                },
                {
                    "name": "도시인프라계획및개발",
                    "description": "사회를 이루고 있는 기초시설인 도시인프라에 대한 전반적인 내 용을 소개하고, 도시인프라 계획 및 개발과 관련된 방법과 정책, 사업기획과 타당성분석, 자금조달, 엔지니어링, 시공, 사후관리 등의 내용을 소개한다."
                },
                {
                    "name": "도시계획",
                    "description": "도시계획의 기본적인 이론과 기법을 소개하고, 다양한 지역 계획 의 중요한 \"중추\"인 토지이용계획에 대한 이론적 배경과 실무 지 식을 이해한다."
                },
                {
                    "name": "도시공간정보시스템",
                    "description": "이 과정에서는 지리정보시스템(GIS)에 대한 기본적인 이해를 바 탕으로 GIS 소프트웨어를 활용하여 도시공간정보를 분석하는 방 법을 습득한다. 지도 제작, 좌표계, 데이터 수집, 데이터 정확도 , 데이터베이스 개발, 공간 분석, 도시 빅데이터 분석과 같은 다 양한 지리 공간에 대한 데이터 처리 및 분석 기법을 습득한다."
                },
                {
                    "name": "도시환경계획",
                    "description": "환경친화적인 도시를 위한 도시환경계획 개념과 관련 정책을 소 개한다. 환경영향평가기법, 환경을 고려한 도시개발 및 단지계획 , 공원녹지계획, 생태경관보전, 친환경건축 관련한 이론과 방법 을 습득한다."
                },
                {
                    "name": "도시인프라자산관리",
                    "description": "도시를 이루고 있는 인프라를 효율적으로 개발 및 운영관리하기 위한 방법을 소개한다. 경제적, 공학적, 환경적 측면에서 도시인 프라에 대한 분석을 수행하며 이를 바탕으로 관리방안을 수립한 다."
                },
                {
                    "name": "건축공학수학",
                    "description": "본 과목을 통하여 미분방정식의 해의 의미와 도출 및 해석법을 배운다. 상미분방정식의 의미와 함께 그 해석적인 풀이법을 학습 한다. 미분방정식 풀이 능력을 바탕으로 컴퓨터정보통신 공학 관 련 분야에 응용할 수 있는 능력을 습득하고 공학문제를 모델 공 식화하고 해결할 수 있는 능력을 배양한다."
                }
            ],
            "환경공학과": [
                {
                    "name": "인류문명과환경과학",
                    "description": "본 과목은 현대 사회에서 건강하고 쾌적한 삶을 살아가는데 필요 한 환경기초지식을 공부한다. 인류문명 발달과 함께 야기된 다양 한 환경문제, 산업화 과정 동안의 환경위기 극복을 위한 노력, 그리고 21세기 인류가 직면한 새로운 환경 도전 등도 함께 다룬 다."
                },
                {
                    "name": "과학과허구",
                    "description": "본 강의는 미디어/영화, 일상생활 속에서 흔히 접하는 과학 (혹 은 유사과학, 허구적 과학) 이론에 대하여 구체적인 과학적 원리 를 설명하고 정확한 지식을 전달하는 것을 목적으로 함. 재미있 고 쉬운 일례를 통해 과학/공학에 대한 흥미를 고취시키고자 함. 강의의 전반부는 일상생활 속 과학으로서 미용, 비만/다이어트, 운동, 환경 및 보건 등을 강의하고 후반부는 각종 영화 속에 등 장하는 과학의 진실 또는 허구를 밝혀봄."
                },
                {
                    "name": "자연과의대화,환경생태",
                    "description": "본 강의는 자연환경 구성요소인 야생동식물의 생태적 위협요인을 이해하고 지구의 생명공동체 인식을 확산하여 생물종 멸종요인 및 생물다양성 보전방안에 대한 능력 증진을 배양하는 것을 도모 하고자 함. 생물종에 대한 사회적 인식증진과 이를 통해 우리가 얻을 수 있는 다양한 생태계서비스 효과에 대해서 강의함. 특히, 생태계파괴, 서식지파편화 등을 해결하는 정책대안을 모색함과 자연환경에 대한 기초지식을 습득을 위해 식물조사 현장학습 및 DMZ 등 생태우수지역 방문(참여)수업을 수행함."
                },
                {
                    "name": "환경재난과국제협력",
                    "description": "본 과목은 지구와 인류 역사에서 발생한 다양한 형태의 환경재난 을 사례별로 환경지식과 함께 공부한다. 아울러, 현재 인류가 직 면한 다양한 지구환경문제의 발생 원인을 이해하고 이를 해결하 기 위한 유엔의 역할과 세계 환경동향, 국제환경협약 등을 논의 한다."
                },
                {
                    "name": "인류세의사회와환경",
                    "description": "이 과목은 자연과학 및 사회과학의 기초 이론 및 최신 연구에 기 초해 지질시대의 최신 시기인 인류세의 세계 경제와 지구 환경이 처한 경제-환경-기후 복합위기의 원인과 현황 및 대안을 소개한 다. 여러 분야를 아우르는 융합적 접근법과 최신 자료를 활용하 여 복잡하게 얽힌 자본주의와 지구 환경의 위기를 통합적으로 인 식하고 지속가능한 미래에 대해 상상하는 능력을 배양할 수 있다 ."
                },
                {
                    "name": "수질관리및실습",
                    "description": "하천, 강, 저수지, 호수, 하구, 항만 등 자연 수체에서 일어나는 수질변화 과정을 이해하고 이를 관리하는 원리, 방법, 대책 등을 공부한다. 또한, 자연 수체의 수질관리를 위한 주요 도구로 사용 되는 수질모델의 원리와 개발과정 그리고 적용 방법 등을 수체의 특성에 따라 공부한다."
                },
                {
                    "name": "환경영향평가",
                    "description": "환경영향평가 제도의 필요성과 대형 개발사업이 수환경, 대기환 경, 토양환경, 생물환경, 그리고 사회경제문화에 미치는 영향을 예측평가하는 것을 공부하고 환경영향평가서 작성방법을 학습한 다."
                },
                {
                    "name": "대기관리및실습",
                    "description": "대기권의 구조와 변동, 에너지 변환과정, 화학반응, 기상현상 등 에 관한 기초 이론을 공부한다. 또한 대기오염 현상의 기본 원리 , 오염 물질, 배출원, 피해, 저감기술을 이해한다. 이와 함께 대 기확산모델을 실습한다"
                },
                {
                    "name": "환경유체공학",
                    "description": "환경공학에 적용되는 유체역학의 법칙, 원리 및 기타 유체의 성 질과 특성을 파악한다. 관수로와 개수로의 제반문제와 하구, 유 역, 하천, 호수 등에 관한 지표수의 동력학, 분산, 확산 등에 대 하여 강의한다."
                },
                {
                    "name": "환경독성학",
                    "description": "배출업소에서 배출되는 오염물질 및 오염도가 인체에 미치는 영 향, 중독 증상 및 그 작용기전에 대하여 독성학적으로 강의한다. 실습과정은 실제 자료를 활용하여 영향 분석에 대한 경헙을 쌓게 한다."
                },
                {
                    "name": "환경생태학",
                    "description": "무기환경과 생물 또 그들과 인간과의 관계를 이해하며, 또한 생 태계 안에서 에너지와 물질이 흘러가는 원리, 생물 개체들의 상 호 조절작용, 생태계의 발전과정 등을 다룬다."
                },
                {
                    "name": "상수도공학",
                    "description": "안전하고 위생적인 음용수와 생활 및 공업용도에 적합한 용수를 생산하고 공급하기 위한, 정수처리를 중심으로 한 상수도시스템 에 대한 지식을 습득하며 설계능력을 개발한다. 또한 실습시간에 는 최근의 연구 개발 동향에 대한 이해와 현장학습을 통하여 연 구와 실무에 종사할 수 있는 자질을 배양한다."
                },
                {
                    "name": "환경보건학",
                    "description": "의.식.주에 관한 공중보건문제. 인간의 산업활동에 기인되는 각 종 환경오염문제와 그에 따른 위생문제를 다룬다. 또한 인간의 건강장애를 예방하고 안전하고 쾌적한 위생환경을 창출하기 위한 제반조건들을 강의한다."
                },
                {
                    "name": "환경화학",
                    "description": "환경에서 일어나는 전반적인 화학적 현상에 대해 이해하기 위해 속도론 및 평형론을 기초로 하여 대기화학, 수질화학, 폐기물 관 련 화학, 그리고 토양화학 등으로 구분하여 강의한다."
                },
                {
                    "name": "폐수처리공학",
                    "description": "폐수처리에 이용되는 물리, 화학, 생물학적인 원리 및 과정들, 하.폐수처리장 설계 운영 방법 및 현장에서 발생할 수 있는 제반 문제들을 학습한다."
                },
                {
                    "name": "폐기물관리",
                    "description": "생활폐기물 및 산업폐기물의 종류, 집수, 운반, 처리 및 처분방 법, 재활용 등 제반 폐기물 관리방법을 습득하도록 한다."
                },
                {
                    "name": "생태복원공학",
                    "description": "생태공학의 개념 및 원리, 생태계를 보존하고 수복하는데 생태공 학이 어떻게 응용되고 있는지 구체적인 사례를 중심으로 강의한 다."
                },
                {
                    "name": "환경정보학및실습",
                    "description": "환경자료 수집과 평가에 관한 이론과 방법을 공부한다. 관측한 환경자료의 환경계에서 나타나는 무작위 현상과 자료의 통계분석 법을 공부한다. 실습과정은 컴퓨터를 활용 지상 및 인공위성 측 정 환경자료를 분석하여 의미 있는 환경정보를 도출하는데 초점 을 둔다."
                },
                {
                    "name": "환경공학개론",
                    "description": "환경과학과 공학을 공부하는데 필요한 기초지식을 공부한다. 강 의는 세계적인 환경문제 사례와 함께 다음과 같은 분야를 개괄적 으로 다룬다: (1)생태계에 미치는 인간의 영향, (2)물, 대기, 토 양에서의 오염과 제어기술, (3)폐기물 관리, (4)환경정책 등"
                },
                {
                    "name": "환경에너지공학",
                    "description": "환경문제 특히 에너지 사용과 관련된 분야에 대한 전반적인 개요 및 과학적 지식을 배운다. 다루는 주제는 에너지의 종류, 에너지 연소 특성, 에너지 사용이 대기환경과 지구환경에 미치는 영향 및 그에 대한 대응 등이다."
                },
                {
                    "name": "환경경영공학",
                    "description": "환경친화적 기업경영에 필요한 기초지식을 공부하는 과목으로, 오염물질 배출과 환경문제, 기업의 기후변화 대응, 전과정평가, 환경감사, 환경경영체제 등에 관하여 학습한다."
                },
                {
                    "name": "환경교과교재연구및지도법",
                    "description": "환경교육을 위한 교재의 바탕이 되고 있는 이론적, 실제적 문제 를 고찰함과 동시에 수준별 교유고가정, 열린 교육 등 현장 교육 과 관련하여 교재의 본질, 특성, 구성 체계, 평가에 대한 이론을 학습하고 실제 교재 제작을 연습한다."
                },
                {
                    "name": "환경교과교육론",
                    "description": "환경 학습 이론들을 고찰하고 환경교육에 관한 이론적 배경과 문 제들을 검토한다. 아울러 환경교육의 시대적 변천, 환경 교과 교 수 방법을 탐구하고 수준별 교육과정, 열린 교육 등의 고찰을 통 하여 우리나라 현장에 적합한 교과과정 및 교수방안을 모색한다."
                },
                {
                    "name": "언론환경학",
                    "description": "환경문제와 언론의 역할, 과학기사 작성법, 언론과 환경운동 등 의 주제를 다루며, 방송기상학과 연관하여 일기도 해석 및 날씨 기사 작성법을 배우고 TV 출연 실습 및 스튜디오 평가까지 포함 한다."
                },
                {
                    "name": "환경정책및법규",
                    "description": "중앙 및 지방정부의 환경정책방향, 재원조달방안, 환경기술개발 및 환경산업 육성정책, 효율적인 환경규제 및 관리제도, 국제환 경협약 등에 대하여 공부하고, 환경법의 필요성과 법체계를 소개 하고 관련기준과 제도를 강의한다."
                },
                {
                    "name": "기초생물학",
                    "description": "환경공학과 식품공학 분야에서 요구되는 세포 특성, 유전학, 생 명의 진화와 다양성 및 생태학 등과 같은 생물학적 지식을 강의 한다."
                },
                {
                    "name": "공정수학계산",
                    "description": "환경공학 및 식품공학의 각종 공정에서 발생하는 전반적인 문제 해결의 기초가 되는 단위환산, 물질수지, 에너지 수지의 기본적 인 이론들과 계산방법을 학습한다."
                },
                {
                    "name": "공학수학연습",
                    "description": "공학수학연습(36573)에서는 공학수학(36341)에서 습득한 공학전 반의 이론에 대한 수학적 해석 능력을 바탕으로 실제 문제 해결 과정을 연습한다."
                },
                {
                    "name": "환경교과논리및논술",
                    "description": "환경교사양성을 위한 교육공학적 논리 및 논술에 관한 과목으로 환경공학전공자 중 교사를 지망하는 학생들에게 교육학적 접근 및 훈련을 위한 논리 및 논술과목"
                },
                {
                    "name": "환경공학산학협력인턴십Ⅰ",
                    "description": "본 과목은 환경공학과의 현장실습을 강화하기 위해 개설하는 실 습수업으로, 산업체 및 국공립연구소 등 관계기관의 현장에서 학 교에서 배운 환경과학 및 공학의 기초지식을 적용하는 기회를 가 진다."
                },
                {
                    "name": "기초물리학",
                    "description": "공학도에 필요한 물리학의 기초 지식을 학습한다. 다루는 주제는 학생의 요구 사항에 맞추어 변동될 수 있으나, 주로 고전역학, 전자기학 또는 기초적인 양자역학적 개념을 다루는 것을 목표로 한다."
                },
                {
                    "name": "해외재능기부현장실습",
                    "description": "저개발 국가의 사회복지단체 및 NGO에 단기간 파견되어 아동 및 청소년, 현지 교사들에게 학생 개개인의 재능을 발휘하고 본교에 서 배운 전공 지식을 활용하여 교육 봉사 활동을 한다. 수원국 대학생과 함께 실습하며, 현지의 문화와 환경, 사회경제적 현황 을 학습한다."
                },
                {
                    "name": "캄보디아교육,환경,문화의이해",
                    "description": "캄보디아의 사회복지단체 및 NGO에 단기간 파견되어 아동 및 청 소년, 현지 교사들에게 학생 개개인의 재능을 발휘하고 본교에서 배운 전공 지식을 활용하여 교육 봉사 활동을 한다. 캄보디아 대 학생과 함께 실습하여 현지 교육, 환경, 문화를 이해하고, 현지 대학의 사회적 책무를 유도한다. 앙코르와트 사원 등 세계적 문 화유산을 탐방하며 캄보디아의 문화를 깊이 이해한다."
                },
                {
                    "name": "환경공학자기설계프로젝트Ⅰ",
                    "description": "학생들이 자신의 학습 목표를 스스로 세우고, 학습 목표 달성에 필요한 다양한 활동들을 스스로 설계하고 진행한다. 학생들은 산 업체 인턴 프로그램, 해외 기관 인턴 프로그램, 연구실 인턴 프 로그램 등에 참여하고 이를 활용할 수 있다."
                },
                {
                    "name": "환경공학자기설계프로젝트Ⅱ",
                    "description": "학생들이 자신의 학습 목표를 스스로 세우고, 학습 목표 달성에 필요한 다양한 활동들을 스스로 설계하고 진행한다. 학생들은 산 업체 인턴 프로그램, 해외 기관 인턴 프로그램, 연구실 인턴 프 로그램 등에 참여하고 이를 활용할 수 있다."
                },
                {
                    "name": "환경공학산학협력인턴십Ⅱ",
                    "description": "본 과목은 환경공학과의 현장실습을 강화하기 위해 개설하는 실 습수업으로, 산업체 및 국공립연구소 등 관계기관의 현장에서 학 교에서 배운 환경과학 및 공학의 기초지식을 적용하는 기회를 가 진다."
                },
                {
                    "name": "환경공학산학협력인턴십Ⅲ",
                    "description": "본 과목은 환경공학과의 현장실습을 강화하기 위해 개설하는 실 습수업으로, 산업체 및 국공립연구소 등 관계기관의 현장에서 학 교에서 배운 환경과학 및 공학의 기초지식을 적용하는 기회를 가 진다."
                },
                {
                    "name": "환경공학장기글로벌인턴십",
                    "description": "해외 유수의 연구소/대학/국제기구에서 일정기간의 인턴쉽 활동 을 통해 선진 과학기술 및 국제협력 활동을 체험한다."
                },
                {
                    "name": "환경공학글로벌필드트레이닝Ⅰ",
                    "description": "글로벌 사회 진출에 필요한 글로벌 커리어 경험과 커뮤니케이션 및 현장지식 및 기술역량을 배양하는 것을 목표로 하며, 국내외 다양한 커리어 개발을 권장한다."
                },
                {
                    "name": "환경공학글로벌필드트레이닝Ⅱ",
                    "description": "글로벌 사회 진출에 필요한 글로벌 커리어 경험과 커뮤니케이션 및 현장지식 및 기술역량을 배양하는 것을 목표로 하며, 국내외 다양한 커리어 개발을 권장한다."
                },
                {
                    "name": "환경공학글로벌필드트레이닝Ⅲ",
                    "description": "글로벌 사회 진출에 필요한 글로벌 커리어 경험과 커뮤니케이션 및 현장지식 및 기술역량을 배양하는 것을 목표로 하며, 국내외 다양한 커리어 개발을 권장한다."
                },
                {
                    "name": "환경공학기초설계",
                    "description": "공학설계과목의 입문과정으로 종합적인 문제해결 능력의 배양을 목표로, 문제해결과정, 팀워크, 의사소통, 시각화 및 모형화를 다룬다."
                },
                {
                    "name": "환경공학종합설계",
                    "description": "환경공학 관련 프로젝트 기획 및 설계하고 연구 프로젝트를 직접 수행하며, 환경공학 관련 연구문제 해결 방법을 익힌다."
                },
                {
                    "name": "토양오염학",
                    "description": "토양 환경의 기본 특성을 파악하고 대표적 오염 현상에 대해 공 부한다. 또한 오염된 토양을 복원할 수 있는 다양한 공학적 접근 법에 대해 알아본다."
                },
                {
                    "name": "환경공학실험Ⅰ",
                    "description": "수질오염학, 토양오염학, 대기오염학 분야 실험을 융합하여 주요 환경분석법에 대한 원리 및 기술을 제공하고 학생들은 실험을 통 하여 기술을 습득한다."
                },
                {
                    "name": "환경위해성평가",
                    "description": "환경보전과 생물다양성의 보전 및 지속적인 이용에 미치는 화학 물질의 위해를 사전에 방지하기 위하기 위해 환경에 대한 안전성 과 환경에 대한 위해성을 알아보고 영향을 평가해본다."
                },
                {
                    "name": "환경공학실험Ⅱ",
                    "description": "환경미생물학, 환경분석화학 및 기기분석화학 분야 실험을 융합 하여 주요 환경분석법에 대한 원리 및 기술을 제공하고 학생들은 실험을 통하여 기술을 습득한다."
                },
                {
                    "name": "환경미생물학",
                    "description": "미생물의 분류방법 및 특성을 이해하고, 미생물을 구성하는 세포 의 구조와 기능을 파악한다. 또한, 물질대사 기작, 분자 유전학 적 특징, 효소의 특징과 반응 속도, 생장속도 및 미생물 생태에 대한 기본 지식을 이해한다."
                },
                {
                    "name": "대기오염학",
                    "description": "대기오염에 관한 이해를 돕기 위한 기본이론과 대기중에서 이동 원리 및 대기오염물질의 종류, 성질 등을 살펴보고 그 방지대책 에 대한 지식을 익힌다."
                },
                {
                    "name": "생활하수관리",
                    "description": "생활하수관리를 위한 생물학적 처리 및 고도처리 기술이 소개된 다. 또한 반응조 설계와 단위공정에 대한 기초지식 습득 및 설계 능력을 향상한다. 최근 연구개발 동향에 대한 이해와 현장학습을 통하여 실무에 종사할 수 있는 자질을 배양한다."
                },
                {
                    "name": "지구환경관리",
                    "description": "지구적 차원의 환경문제에 대한 원인과 현황을 분석하고 문제 해 결을 위한 환경관리방안을 탐색한다. 생태계 파괴, 종다양성 감 소, 생지화학적 물질순환의 교란 및 온실기체 감축을 통한 기후 변화 대응 방안을 소개한다."
                },
                {
                    "name": "글로벌공학교육실습",
                    "description": "개발도상국가의 공학교육을 직접 설계하고 현장에서 실습하면서 수원국 공학기술 수요와 환경, 국제개발협력의 개념을 이해한다."
                },
                {
                    "name": "환경공학단기글로벌인턴십",
                    "description": "환경공학 관련 산업체에서 실무 능력을 키우기 위하여 현장 및 연구소에서 이론 및 기술을 배우며 적용하여 졸업 후 바로 산업 체에서 일할 수 있는 능력을 배양한다."
                },
                {
                    "name": "환경안전관리",
                    "description": "환경보건 및 안전관리의 기본 원칙 및 공중 및 산업체의 작업자 건강에 영향을 줄 수 있는 인자들의 효과적인 관리 방법을 학습 한다. 환경과 연관된 화학물질 및 생물체기인물질의 안전관리 방 법을 습득한다."
                },
                {
                    "name": "환경공학장기산학협력인턴십",
                    "description": "본 과목은 환경공학과의 현장실습을 강화하기 위해 개설하는 실 습수업으로, 산업체 및 국공립연구소 등 관계기관의 현장에서 학 교에서 배운 환경과학 및 공학의 기초지식을 적용하는 기회를 가 진다."
                },
                {
                    "name": "통합환경관리입문",
                    "description": "통합환경관리입문 교과목에서는 학부생(3학년, 4학년)이 통합환 경관리제도 개론, 통합법의 주요골자 및 하위법령 내용을 습득하 고 관련된 주요 개념을 이해하여 제도 운영에 필요한 최소한의 기초 지식을 얻게 하는 것을 그 목적으로 한다."
                },
                {
                    "name": "공학기초화학Ⅰ",
                    "description": "환경공학 분야에서 요구되는 화학 의 기본 개념에 관하여 학습한 다. 기체, 액체, 고체의 화학적 성질과 화학 결합, 열화학 등에 관한 내용을 다룬다."
                },
                {
                    "name": "공학기초화학실험Ⅰ",
                    "description": "공학기초화학I에서 습득한 화학 이론을 활용하여 실험을 진행함 으로서, 학생들의 화학에 대한 이해를 향상시키는 것을 목표로 한다. 뿐만 아니라, 실험 기구 및 시약을 다루는 방법과 같은 화 학실험의 기본을 배운다."
                },
                {
                    "name": "공학기초화학Ⅱ",
                    "description": "공학에서 필요한 화학 일반원리와 응용을 이해하는데 목적이 있 으며, 화학반응속도 및 평형, 산/염기 반응, 산화/환원 반응에 대한 기본적인 이론과 개념을 공부한다."
                },
                {
                    "name": "공학기초화학실험Ⅱ",
                    "description": "공학기초화학II 교과과정을 구체적으로 이해하고, 화학실험의 기 초적 방법들을 배우며 실험현상의 관찰, 해석, 문제해결 능력을 키운다."
                },
                {
                    "name": "공학확률및통계",
                    "description": "공학에서 필요한 확률 및 통계의 개념과 이의 응용분야를 배운다 . 공학실험에서 적용하는 확률 분포 및 검정, 분산분석, 회귀분 석, 신뢰성분석 등 통계분석의 응용분야를 학습한다."
                },
                {
                    "name": "환경기기분석및센서",
                    "description": "본 수업에서는 환경 분석에 있어서 기본이 되는 화학평형, 기기 분석, 데이터분석의 기초 원리와 응용을 소개하며, 환경센서 및 모니터링의 새로운 흐름 또한 접할 수 있도록 한다."
                },
                {
                    "name": "환경전기화학",
                    "description": "전기화학은 최근 다양한 환경공학 분야에서 기존의 기술을 보완 하거나 대체할 수 있는 새로운 기술로 각광 받고 있다. 본 수업 에서는 환경공학 분야에서 필요한 전기화학의 기본 개념과 관련 예시들을 간략히 다루어, 학생들이 전기화학의 기초 이론을 익히 고 이를 다양한 실제 환경문제 해결에 적용할 수 있는 능력을 키 울 수 있도록 한다."
                },
                {
                    "name": "고도처리공학",
                    "description": "최근 미량오염물질에 대응하기 위해 상수 및 하수처리에서 필요 한 다양한 고도처리기술을 이해하고, 최신 수처리 공정 개발 현 황에 대해 강의한다."
                },
                {
                    "name": "해양환경학",
                    "description": "지구환경의 중요한 축인 해양환경과 과학에 대한 이론 및 기술을 함양하여 해양의 연구, 보전 및 개발에 대한 지식을 습득한다."
                }
            ],
            "기후에너지시스템공학과": [
                {
                    "name": "해외재능기부현장실습",
                    "description": "저개발 국가의 사회복지단체 및 NGO에 단기간 파견되어 아동 및 청소년, 현지 교사들에게 학생 개개인의 재능을 발휘하고 본교에 서 배운 전공 지식을 활용하여 교육 봉사 활동을 한다. 수원국 대학생과 함께 실습하며, 현지의 문화와 환경, 사회경제적 현황 을 학습한다."
                },
                {
                    "name": "기후에너지시스템",
                    "description": "지구기후시스템에 대한 기본적인 메커니즘을 이해하고, 이를 변 화시키는 자연적 및 온실가스와 같은 인위적 요인들에 대해 학습 하며, 인위적 요인에 의한 기후변화가 초래할 영향들을 이해한다 ."
                },
                {
                    "name": "수문기후학",
                    "description": "전지구적인 물 순환을 이해하고, 구름 및 강수물리, 대류에 연관 된 역학 및 열역학, 대류성 스톰의 발달, 집중호우 및 홍수를 유 발하는 기상시스템, 강수예보를 위한 레이더의 활용 등에 대해 배운다."
                },
                {
                    "name": "대기열역학",
                    "description": "열적인 원인으로 대기중에서 발생하는 다양한 현상을 다루는 과 목으로 열역학 제1, 제2법칙을 이용하여 상변화를 일으키는 수증 기가 존재하는 공기중에서의 열에너지 변환 및 이에 따른 각종 변화를 이해하고, 에너지 전달에 따른 대기상태를 분석하고 이해 할 수 있도록 한다."
                },
                {
                    "name": "기후에너지기초설계",
                    "description": "습득한 지식을 전공별로 지정된 관련 기관에서 행하는 실습과정 에 적용토록 유도함으로서 이론적인 이해도를 증진시키도록 한다 ."
                },
                {
                    "name": "기후물리",
                    "description": "지구의 에너지수지와 흐름, 에너지 불균형과 대기, 해양 대류, 물순환과의 관계, 구름과 수증기 등 에너지 조절 인자를 통한 기 후피드백과 기후민감도를 이해한다."
                },
                {
                    "name": "기후예측",
                    "description": "가설 검증, 선형/비선형 회귀분석, 시계열 분석 등의 다양한 통 계 기법을 이용하여 기상자료의 객관적 처리, 종합 및 분석 방법 을 습득한다."
                },
                {
                    "name": "재해기상기후학",
                    "description": "다양한 기상재해사례(태풍, 폭우/폭설, 폭염, 한파, 미세먼지 등 )의 분석을 통해 발생원인, 피해원인을 고찰하고 대책을 토의한 다."
                },
                {
                    "name": "신재생에너지",
                    "description": "지속가능한 산업 사회를 위한 신재생에너지(풍력, 태양광, 수소 에너지 등)에 대한 공학적 기초지식을 습득하고, 기후시스템과 에너지기술 간 상호작용에 대한 이해도를 높인다."
                },
                {
                    "name": "탄소에너지",
                    "description": "산업 사회의 기본 에너지원인 탄소에너지(석유, 천연가스, 석탄 등)에 대한 공학적 기초지식을 습득한다."
                },
                {
                    "name": "기초대기역학",
                    "description": "대규모의 대기운동을 이해하기 위해 필요한 유체역학의 기본원리 (질량 보존 법칙, 열역학 제1, 2법칙)를 이해하고, 이를 서술하 는 방정식들 (균형류, 온도풍, 유선/유적, 이상기체 상태방정식, 와도방정식)을 유도한다."
                },
                {
                    "name": "지구관측시스템",
                    "description": "기상장비를 이용하여 주요 대기변수를 측정하고 그에 따른 결과 자료를 처리하는 기술을 다루며 현장실습을 위한 실험디자인의 설계를 배운다."
                },
                {
                    "name": "수치모델링및실습",
                    "description": "대기/해양의 지배방정식, 준지균 방정식, 원형방정식, 대기/해양 파동, 규모분석 등 기상/기후 수치예보를 위한 기본적인 대기/해 양 역학을 리뷰한다. 다양한 형태의 편미분방정식계의 이해와 기 초적인 차분화 방법을 배우고 수치해법의 다양한 방안의 특성을 이해하고, 계산 안정도를 분석한다."
                },
                {
                    "name": "기후역학",
                    "description": "기후시스템의 각 구성간 상호작용을 공부하고 기후변동성, 기후 변화에 대해 다룬다"
                },
                {
                    "name": "스마트그리드",
                    "description": "스마트그리드의 기초 이론과 실무에 관한 지식을 습득한다. 전력 계통의 기초 지식부터 스마트 그리드의 개념, 전력망의 계측 및 통제 시스템에 대해 학습한다."
                },
                {
                    "name": "에너지자원수치해석",
                    "description": "본 교과목은 에너지자원분야의 공학자에게 필요한 기본적인 수치 해석 기법을 강의한다. 다양한 반복해 기법을 이용해 비선형 방 정식의 해를 구하는 기법, 수치적분법, 다양한 경우를 모사할 수 있는 추계학적 기법을 공부한다. 유한차분법을 이용한 모델링 기 법을 통하여 행렬방정식의 풀이법에 대하여 학습한다. 저류층 시 뮬레이션 프로그래밍의 원리 및 기초를 배운다."
                },
                {
                    "name": "중위도대기순환",
                    "description": "지균역학, 대기의 불안정성, 종관규모 운동의 특성과, 대기의 진 동, 대규모 순환을 역학적으로 설명한다."
                },
                {
                    "name": "원격탐사",
                    "description": "대기복사이론을 기초로 위성관측의 원리를 배우고 대기의 구조와 지표 관측을 위하여 위성 관측 데이터를 어떻게 응용할 수 있는 가를 소개한다."
                },
                {
                    "name": "전력시스템해석및설계",
                    "description": "에너지수요관리의 기초 지식, 주요 특성 및 요소에 대해 학습한 다. 에너지수요공급예측기술에 대해 주로 배우며, 에너지시스템 모델링, 전산모사 및 최적화 방법을 습득한다."
                },
                {
                    "name": "이산화탄소포집,활용및저장",
                    "description": "탄소포집, 활용 및 저장에 대한 지식을 습득한다. 개발 및 시연 수준의 다양한 상용화 포집 기술에 대해 학습하며, 탄소 포집 및 저장(CCS) 프로젝트 수행에 필요한 탄소지중저장에 대한 기본 지 식을 습득한다."
                },
                {
                    "name": "수소에너지시스템",
                    "description": "저탄소 에너지 시스템의 이해를 위하여, 에너지 시스템의 열역학 , 화학, 및 전달현상을 학습하고 그 지식을 응용하여 에너지 시 스템의 해석과 최적화 과정을 실습한다."
                },
                {
                    "name": "구름물리",
                    "description": "구름 미세물리와 대기 응결핵이 빗방울로 성장하여 강수로 연결 되는 일련의 강수과정을 중점적으로 배운다."
                },
                {
                    "name": "지구통계학",
                    "description": "에너지 자원 및 지표·지하공간을 다루는 지형 및 지질의 공간정 보를 지구통계를 통해 분석하는 방법과 관련 프로그래밍 기법을 다루며, 지구통계 소프트웨어를 실습한다."
                },
                {
                    "name": "기후에너지데이터분석",
                    "description": "지상관측, 재분석, 기후모델, 위성관측 등 다양한 경로로 생산된 기후자료의 형식 및 특성(해상도, 구조, 불확실성 등), 이를 읽 고 표출, 분석, 해석하는 최신 기법을 공부한다."
                },
                {
                    "name": "종관분석",
                    "description": "실제 기상 관측 자료를 이용하여 일기도를 작성하고 대기의 움직 임과 특성을 파악하여 일기를 분석함으로써 일기예보에 필요한 기술을 습득한다."
                },
                {
                    "name": "기후에너지기술경영",
                    "description": "기후에너지기술경영은 기후문제, 환경문제, 에너지문제가 공학기 술과 만났을 때 일어나는 다양한 현상 중 특히 공과대학생이 간 과하기 쉬운 경제-경영적인 측면을 분석하고 토론하는 교과목이 다. 강의의 주요 내용은 경제성분석, 에너지산업경영분석, 그리 고 기술대안분석 등이며 경쟁형 팀별 실습 및 토론에 중점을 두 어 수업을 진행한다."
                },
                {
                    "name": "지속가능경영",
                    "description": "유엔기후변화협약에 따른 우리나라 온실가스 배출권거래제, 온실 가스에너지목표관리제 등 온실가스관리 정책, 이에 대응하는 기 업경영을 다룬다."
                },
                {
                    "name": "기후에너지시장분석",
                    "description": "본 교과목은 기후에너지시장의 예측 및 분석을 위한 기법을 학습 한다. 시계열 계량경제기법을 위주로 한 분석기법을 학습하며, 실제자료를 활용한 팀별 분석실습과 토론학습을 진행한다."
                },
                {
                    "name": "기후에너지종합설계",
                    "description": "기후에너지시스템공학 관련 프로젝트 기획 및 설계하고 연구 프 로젝트를 직접 수행하며, 기후에너지시스템 관련 연구문제 해결 방법을 익힌다."
                },
                {
                    "name": "기후에너지글로벌인턴십",
                    "description": "기후, 에너지관련 해외 유수의 연구소/대학/국제기구에서 일정기 간의 인턴쉽 활동을 통해 선진 과학기술 및 국제협력 활동을 체 험한다."
                },
                {
                    "name": "기후에너지인턴십Ⅰ",
                    "description": "기후, 에너지관련 국내 기업/국공립 연구소에서 일정기간의 인턴 쉽 활동을 통해 현장 업무를 체험한다."
                },
                {
                    "name": "기후에너지인턴십Ⅱ",
                    "description": "기후, 에너지관련 국내 기업/국공립 연구소에서 일정기간의 인턴 쉽 활동을 통해 현장 업무를 체험한다."
                },
                {
                    "name": "기후에너지인턴십Ⅲ",
                    "description": "기후, 에너지관련 국내 기업/국공립 연구소에서 일정기간의 인턴 쉽 활동을 통해 현장 업무를 체험한다."
                },
                {
                    "name": "개도국기후변화와에너지세미나",
                    "description": "개도국의 기후변화 및 에너지 문제, 이를 해결하기 위한 적정기 술 및 우리나라의 개발원조를 수원국 현지 전문가 및 학생들과 함께 고민하고 토론한다."
                },
                {
                    "name": "기후에너지글로벌필드트레이닝Ⅰ",
                    "description": "글로벌 사회 진출에 필요한 글로벌 커리어 경험과 커뮤니케이션 및 현장지식 및 기술역량을 배양하는 것을 목표로 하며, 국내외 다양한 커리어 개발을 권장한다."
                },
                {
                    "name": "기후에너지글로벌필드트레이닝Ⅱ",
                    "description": "글로벌 사회 진출에 필요한 글로벌 커리어 경험과 커뮤니케이션 및 현장지식 및 기술역량을 배양하는 것을 목표로 하며, 국내외 다양한 커리어 개발을 권장한다."
                },
                {
                    "name": "기후에너지글로벌필드트레이닝Ⅲ",
                    "description": "글로벌 사회 진출에 필요한 글로벌 커리어 경험과 커뮤니케이션 및 현장지식 및 기술역량을 배양하는 것을 목표로 하며, 국내외 다양한 커리어 개발을 권장한다."
                },
                {
                    "name": "기후에너지시스템자기설계프로젝트Ⅰ",
                    "description": "기후에너지시스템 자기설계 프로젝트는 학생 스스로 기후에너지 관련 이슈를 분석하고 문제를 해결하는 방안을 학습하는 내용을 중심으로 한다."
                },
                {
                    "name": "기후에너지시스템자기설계프로젝트Ⅱ",
                    "description": "기후에너지시스템 자기설계 프로젝트는 학생 스스로 기후에너지 관련 이슈 분석을 심화하고 스스포 문제를 해결하는 해법을 찾아 가는 학습을 심화하는 과정이다."
                },
                {
                    "name": "시추공학",
                    "description": "시추는 석유와 가스 그리고 광물자원의 탐사와 개발을 위한 중요 한 수단이다. 본 과목은 시추계획, 시추장비, 케이싱 설계, 유정 제어, 시추문제와 해결책, 유정평가, 그리고 유정완결에 대하여 강의한다. 천부시추와 심부시추, 해상시추와 육상시추, 그리고 광물자원의 탐사를 위한 시추의 특징을 공부한다."
                },
                {
                    "name": "생산시스템공학",
                    "description": "에너지의 생산 및 수송 과정에서 발생하는 관내 유체유동 분석에 관한 이론을 학습하고, 수학 및 컴퓨터 모델을 활용하여 유체 유 동을 모사한다."
                },
                {
                    "name": "대기복사",
                    "description": "에너지가 전달되는 하나의 방법인 전자기복사 현상을 다루는 과 목으로 복사가 방출되는 원리, 전달되는 과정에서의 매질과의 상 호작용 등을 중점적으로 다룬다. 이를 통해 복사전달을 이용하는 다양한 분야, 지구에너지 수지, 원격탐사, 태양에너지 효율 등에 서 요구되는 기본적인 지식을 익히게 된다."
                },
                {
                    "name": "기후에너지자료동화",
                    "description": "기후에너지시스템공학에서 사용하는 수치모델링 관련 분야에서 최적의 초기조건 및 모수값을 얻어 수치예측의 정확도를 높이는 방법에 대해 이론적 배경과 기초적인 실습을 진행한다."
                },
                {
                    "name": "에너지기상학",
                    "description": "태양광에너지 및 풍력에너지의 안정적인수급을 위해서는 태양복 사 및 바람에 대한 보다 정확한 예측정보가 필수적이다. 본 과목 에서는 이러한 예측정보의 생산 방법과 실제 에너지 관련 산업현 장에서 이를 어떻게 사용하는지에 대해 배운다."
                }
            ],
            "휴먼기계바이오공학과": [
                {
                    "name": "해외재능기부현장실습",
                    "description": "저개발 국가의 사회복지단체 및 NGO에 단기간 파견되어 아동 및 청소년, 현지 교사들에게 학생 개개인의 재능을 발휘하고 본교에 서 배운 전공 지식을 활용하여 교육 봉사 활동을 한다. 수원국 대학생과 함께 실습하며, 현지의 문화와 환경, 사회경제적 현황 을 학습한다."
                },
                {
                    "name": "공학제도",
                    "description": "기계공학도의 기본언어인 공학제도의 방법을 실습을 통하여 습득 한다. SolidWorks를 이용하여 표준화된 원칙에 따라 다양한 도면 을 작성해보며, 작성된 도면을 이해하는 능력을 개발한다."
                },
                {
                    "name": "휴먼기계바이오공학기초",
                    "description": "휴먼기계바이오공학의 융합기계, 의생명공학 및 바이오데이타 트 랙에서 필요한 물리학, 수학 및 컴퓨터의 기초적인 지식을 배운 다. 또한 간단한 공작기계를 이용해 기계부품가공 및 조립기술을 연마하며 이를 응용한 최신 연구 동향을 공부해 휴먼기계바이오 공학의 세 트랙에 대한 관심 및 이해를 증대시킴에 목적이 있다."
                },
                {
                    "name": "열역학",
                    "description": "에너지 기본개념, 상태방정식과 순수물질의 성질, 밀폐시스템에 서의 열역학 제1법칙 및 제2법칙 개방시스템에서의 열역학 제1법 칙 및 제2법칙, 증기동력사이클, 기체동력사이클을 다룬다."
                },
                {
                    "name": "고체역학",
                    "description": "공학문제를 이해하는데 필요로 하는 역학의 기본적인 사고방법과 해석능력을 높이고 현대적 공학문제를 취급할 수 있도록 작용력 을 주었을 때 그에 대한 반응과 움직임의 효과를 예상할 수 있도 록 학습하며, 구조물의 창조적인 설계와 적용을 수행할 수 있는 능력 배양에 목적을 둔다."
                },
                {
                    "name": "생체역학",
                    "description": "생체계 역학적 원리를 이해하고 기능적 변화를 예측함으로써 인 간의 몸이 움직이는 원리, 동작 등을 분석한다. 강좌를 통해 인 간의 근골격계, 심혈관계, 호흡기계 등의 움직임 등을 분석한 후 이를 활용하여 인간에게 유용한 기구, 방법 등이 무엇인지를 이 해한다."
                },
                {
                    "name": "생체재료학",
                    "description": "체내에 이식할 수 있는 금속, 세라믹, 폴리머 등의 생체적합성을 지닌 생체재료의 특성을 파악하고 이식장기의 현황 및 문제점을 파악한다."
                },
                {
                    "name": "인공지능프로그래밍",
                    "description": "기계학습 알고리즘 구현을 위한 프로그래밍 방법을 익히며, 특히 인공신경망 모델을 pytorch 와 같은 프레임워크로 구현하는데 초 점을 준다."
                },
                {
                    "name": "휴먼기계바이오공학실험Ⅰ",
                    "description": "본 과목에서는 고체역학, 열역학, 유체역학 등에서 배웠던 중요 한 개념들에 대한 이해를 실험 및 데이터 분석을 통해 심화시킨 다."
                },
                {
                    "name": "동역학",
                    "description": "역학의 한 분야인 동역학은 질량을 가진 물체 또는 시스템의 운 동을 다루는 운동학과 운동을 일으키는 외력을 다루는 운동역학 으로 구성된다. 본 수업은 벡터에 기반한 뉴턴역학을 바탕으로 2차원 평면운동을 하는 질점 또는 강체로 단순화된 물체 또는 시 스템의 동역학을 배운다. 특히, 다양한 시스템을 입자 또는 강체 로 단순화하고, 각 구성 물체들의 자유물체도를 그린 후 뉴턴의 운동법칙과 그에 기반한 원리를 적용하여 운동방정식을 유도하는 과정을 배우는 것이 핵심이다."
                },
                {
                    "name": "유체역학",
                    "description": "본 과목에서는 유체를 연속체로 취급하며 해석방법으로는 오일러 방식을 택하고 비압축성 유동에 국한하여 유체의 성질과 유동현 상을 이해하고 내부 및 외부유동의 다양한 경우에 적용할 수 있 는 능력을 습득하고 그 결과를 해석할 수 있는 능력을 배양한다."
                },
                {
                    "name": "구조해석및설계",
                    "description": "기계공학전공 학생들에게 역학적 지식을 활용하여 기계부품과 이 들로 구성된 시스템에 대해 문제를 정의하고 설계하는 과정을 습 득할 수 있는 기회를 제공한다. 본 과목은 기존의 이론을 바탕으 로 하는 축, 베어링, 나사, 기어 등의 기계부품의 해석 및 설계 를 중심으로 이루어지며 동시에 새로이 대두되고 있는 설계 방법 을 소개한다."
                },
                {
                    "name": "기계진동학",
                    "description": "진동이라는 물리적 현상을 이해하고 동역학의 법칙을 활용하여 진동현상을 모델링하고 해석하는 방법을 배운다. 기계시스템의 진동 분석을 위치, 속도, 가속도의 관점에서 배우고 기계설계에 어떻게 반영하는가를 학습한다."
                },
                {
                    "name": "재활공학",
                    "description": "급격히 증가하는 노령층과 장애인의 삶을 편리하게 하고 향상시 키는데 필요한 하드웨어 및 소프트웨어 기술을 사용자 맞춤 제작 , 개발, 서비스하는 이론과 임상의 실제적용에 관한 내용을 배운 다. 재활운동과 필요한 보조기구의 공학적 이론 및 기계제작에 관한 최근 주제를 다룬다."
                },
                {
                    "name": "통계적기계학습이론",
                    "description": "이 과목은 먼저 학생들에게 기본적인 통계이론을 숙지시킨 후, 최근 머신 러닝 기술과 알고리즘들을 소개를 통해 기초적인 개념 과 직관력을 심어주는 것을 목적으로 한다. 강의에서 다룰 내용 은 perceptron과 같은 고전적 개념에서부터 boosting, support vector machine, graphical model 등 최신 개념까지 포괄한다. 이 강의에서 소개될 대부분의 알고리즘은 통계적 추론을 기반으 로 한다."
                },
                {
                    "name": "휴먼기계바이오공학종합설계Ⅰ",
                    "description": "기업(기관) 내 핵심 직무에 관한 이해를 통해 원활한 사회진출을 할 수 있도록 직무 역량을 개발하고 훈련하는데 목적이 있다. 이 를 위해 학생들은 직업을 선택하고 경력개발에 관한 기본적인 지 식을 습득 및 활용한다. 자기소개서 및 PT 작성, 면접 등의 지도 를 통해 직무 역량을 향상시키기 위한 기초 과목으로 활용한다."
                },
                {
                    "name": "자율주행시스템",
                    "description": "지능형 자율주행시스템의 기본 개념과 사용되는 기술들을 익히고 , 효과적인 제어를 위한 방법론을 배운다. 자율주행시스템의 안 전 문제에 대해 논의하고 이를 위한 해결책을 공부한다."
                },
                {
                    "name": "컴퓨터응용해석",
                    "description": "본 교과목에서는 컴퓨터를 이용한 다양한 기계설계분야의 해석과 정을 다룬다. 유한요소법의 기본 개념을 간단히 소개하고 상용소 프트웨어 패키지의 활용법을 익혀 효과적인 설계를 돕는 해석방 법을 익힌다."
                },
                {
                    "name": "열전달",
                    "description": "시스템에 전달된 열에 의한 온도 변화와 분포, 단위시간/면적당 전달되는 열량을 구하는 방법을 배운다. 전도, 대류 및 복사열전 달 현상과 기본법칙들을 이해하고 이를 응용 할 수 있는 기본 능 력을 배양한다."
                },
                {
                    "name": "바이오센서",
                    "description": "바이오 센서는 생물학적 성분과 물리화학적인 탐지기의 결합을 이용하는 분석기기다. 바이오 센서는 현재 의료 진단과 치료 시 생체 내의 화학 물질 계측에 있어 필수불가결한 요소가 되고 있 다. 이 강의에서 바이오 센서에 대한 개념 소개, 응용 등 센서 기술에 대해서 학습한다."
                },
                {
                    "name": "로봇공학개론",
                    "description": "본 수업은 로봇공학을 위한 개론 수업으로 로봇의 구조 및 설계, 기구학, 그리고 동역학 및 응용을 다룬다. 특히, 회전행렬과 좌 표변환행렬에 대한 이해를 바탕으로, 정/역기구학, 미분기구학, 경로계획, 동역학을 공부하며, 이에 따라 동역학과 시스템해석및 제어를 선수과목으로 한다."
                },
                {
                    "name": "휴먼기계바이오공학실험Ⅱ",
                    "description": "본 과목에서는 세포공학, 조직공학, 생체 재료학 등 의공학 관련 교과목에서 배웠던 중요한 이론적 개념들에 대한 이해를 실험 및 데이터 분석을 통해 심화시키는 것을 학습 목표로 한다."
                },
                {
                    "name": "세포공학",
                    "description": "동물세포의 특성, 세포배양의 원리 및 배양조건, 세포주 등에 관 하여 강의하고, 동물세포배양을 이용한 다양한 생명공학 연구기 법 소개한다."
                },
                {
                    "name": "의학영상처리",
                    "description": "본 교과목에서는 의료 영상처리의 기본 개념을 익힌 후, 공간영 역에서의 영상 향상(LUT, 히스토그램, 공간필터링, multi- channel 영상 향상, Angio-masking)의 개념을 배우고 프로그램으 로 구현하는 방법을 배운다. 주파수 영역에서의 의료 영상 처리 (주파수변화, 저주파, 고주파필터링)의 개념을 배우고 프로그램 으로 구현하는 방법을 배운다."
                },
                {
                    "name": "유전체와맞춤의료",
                    "description": "임상 의료정보와 유전체 데이터의 통합분석이 매우 강조되고 있 는 최근의 추세에 따라, 사용되고 있는 다양한 분석 및 올바른 통계학적 도구 사용의 최근 동향에 대하여 학습한다."
                },
                {
                    "name": "강화학습",
                    "description": "본 수업에서는 강화학습을 위한 기본 이론 및 실용적인 알고리즘 을 학습하며, 구체적인 주제로는 심층 Q-학습, policy gradient 방법, 다중 에이전트 강화학습 등을 포함한다."
                },
                {
                    "name": "빅데이터마이닝",
                    "description": "컴퓨터를 사용하여 다량의 데이터를 수집하고 구축한 후 이를 효 과적으로 지능적으로 활용하기 위한 여러 이론과 방법을 고찰한 다. 지식탐사의 목적은 인간이 정보를 추출하는 과정을 이해하고 정보처리 과정을 고속화하고 최종 결과가 의미가 있도록 하는 것 이다. 어떠한 사안을 결정하는 규칙을 만들어내고 주어진 규칙으 로부터 유용한 지식을 도출하는 실제적으로 적용하는 응용력을 키운다."
                },
                {
                    "name": "휴먼기계바이오공학종합설계Ⅱ",
                    "description": "학부에서 배운 기본 전공지식을 바탕으로 관심전공분야의 교수님 의 지도하에 하나의 연구 혹은 개발 프로젝트를 수행함."
                },
                {
                    "name": "시스템해석및제어",
                    "description": "본 수업은 동역학적 시스템의 모델을 세우고 특성을 분석하여, 피드백제어기를 설계하는 기본 방법을 다룬다. 특히, 미분방정식 형태의 시스템 모델의 라플라스 변환을 통해 Transfor Function 을 찾고, 이를 활용하여 시스템의 특성을 분석하고 시스템의 성 능을 향상시키기 위한 PID 제어기를 Root-Locus 방법을 통해 설 계한다. 또한, 주파수 영역에서 시스템의 특성을 해석하고 Lead/Lag 보상기를 설계하는 법을 배우며, 디지탈 제어 및 State-Space 제어 방법에 대해서 간략히 다룬다."
                },
                {
                    "name": "에너지시스템설계",
                    "description": "이 수업에서는 열화학반응이 있는 시스템에서 열역학 법칙을 재 정립해 화학반응이 있는 일반적인 에너지시스템에 대한 분석 방 법을 습득한다. 이를 통해 인류가 사용하는 주요한 에너지시스템 들(복합발전, 열병합발전, 연료전지 등)에 대한 기본적인 분석 방법을 학습한다. 또 에너지시스템들에 대한 컴퓨터를 이용한 모 델링 해석 방법을 습득한다."
                },
                {
                    "name": "조직공학및인공장기",
                    "description": "본 교과목에서는 세포, 세포가 부착되어 자랄 수 있는 지지체, 그리고 세포의 성장 및 분화를 조절할 수 있는 각종 인자를 적절 히 이용하여 여러 조직 재생, 및 나아가 장기복원 등에 대한 기 초 지식을 배운다.이어서 세포, 스캐폴드, 그리고 바이오리액터 를 이용한 인공조직 제조와 생물학적 안전성평가에 대한 관련기 술을 습득한다."
                },
                {
                    "name": "계측시스템설계",
                    "description": "본 교과목에서는 센서와 프로세서 그리고 작동기로 이루어지는 계측 시스템을 설계, 제작, 적용하는 방법을 배운다. 또한 LabVIEW와 DAQ 보드를 이용해 각종 센서들로부터의 생체신호를 수집하고 분석하는 실습을 통해 다양한 계측 시스템 개발을 경험 할 수 있다."
                },
                {
                    "name": "휴먼기계바이오공학글로벌필드트레이닝Ⅰ",
                    "description": "글로벌 사회 진출에 필요한 글로벌 커리어 경험과 커뮤니케이션 및 현장지식 및 기술역량을 배양하는 것을 목표로 하며, 국내외 다양한 커리어 개발을 권장한다."
                },
                {
                    "name": "휴먼기계바이오공학글로벌필드트레이닝Ⅱ",
                    "description": "글로벌 사회 진출에 필요한 글로벌 커리어 경험과 커뮤니케이션 및 현장지식 및 기술역량을 배양하는 것을 목표로 하며, 국내외 다양한 커리어 개발을 권장한다."
                },
                {
                    "name": "휴먼기계바이오공학글로벌필드트레이닝Ⅲ",
                    "description": "글로벌 사회 진출에 필요한 글로벌 커리어 경험과 커뮤니케이션 및 현장지식 및 기술역량을 배양하는 것을 목표로 하며, 국내외 다양한 커리어 개발을 권장한다."
                },
                {
                    "name": "휴먼기계바이오공학산학연계인턴십Ⅰ",
                    "description": "사회 진출 전 기업(관)의 현장실습 경험을 통해, 졸업 후 사회진 출을 위한 역량개발과 경력개발의 기회를 제공한다. 인턴십 프로 그램에 참여하는 학생은 학점신청서, 연수보고서 및 기타 증빙서 류를 제출하여 심사를 통과(개별통보)하고 평가받게 된다."
                },
                {
                    "name": "휴먼기계바이오공학산학연계인턴십Ⅱ",
                    "description": "사회 진출 전 기업(관)의 현장실습 경험을 통해, 졸업 후 사회진 출을 위한 역량개발과 경력개발의 기회를 제공한다. 인턴십 프로 그램에 참여하는 학생은 학점신청서, 연수보고서 및 기타 증빙서 류를 제출하여 심사를 통과(개별통보)하고 평가받게 된다."
                },
                {
                    "name": "휴먼기계바이오공학산학연계인턴십Ⅲ",
                    "description": "사회 진출 전 기업(관)의 현장실습 경험을 통해, 졸업 후 사회진 출을 위한 역량개발과 경력개발의 기회를 제공한다. 인턴십 프로 그램에 참여하는 학생은 학점신청서, 연수보고서 및 기타 증빙서 류를 제출하여 심사를 통과(개별통보)하고 평가받게 된다."
                },
                {
                    "name": "기초전산공학",
                    "description": "휴먼기계바이오공학의 융합기계, 의생명공학 및 바이오데이터 트 랙에서 공통으로 필요로 하는 전산공학의 기초를 배우며, 매트랩 프로그래밍, 데이터베이스 기초, 객체지향프로그래밍 기초 등을 포함한다."
                },
                {
                    "name": "기계전자공학",
                    "description": "본 수업에서는 휴먼기계바이오공학 학생들에 도움이 될 전기공학 의 기본 개념들을 배우는데, 전반부는 전자회로의 이해와 설계, 후반부는 디지털 신호 및 시스템 이해에 초점을 둔다."
                },
                {
                    "name": "의용신호처리",
                    "description": "본 수업에서는 디지털 신호 및 시스템, 샘플링 이론, 푸리에 변 환, 필터 디자인 등의 기본적인 디지털 신호처리 원리들을 배우 며 실제 인체 신호에 어떻게 응용되는지에 대해 학습한다."
                },
                {
                    "name": "패턴인식과딥러닝",
                    "description": "자동 패턴인식을 위한 머신러닝 알고리즘을 학습하며, 합성곱 신 경망, 재귀 신경망, 어텐션 기반의 모델등을 포함하는 인공신경 망 모델을 집중적으로 학습한다."
                },
                {
                    "name": "휴먼기계바이오공학산학연계인턴십Ⅳ",
                    "description": "사회 진출 전 기업(관)의 현장실습 경험을 통해, 졸업 후 사회진 출을 위한 역량개발과 경력개발의 기회를 제공한다. 인턴십 프로 그램에 참여하는 학생은 학점신청서, 연수보고서 및 기타 증빙서 류를 제출하여 심사를 통과(개별통보)하고 평가받게 된다."
                },
                {
                    "name": "휴먼기계바이오공학산학연계중기인턴십Ⅰ",
                    "description": "사회 진출 전 기업(관)의 현장실습 경험을 통해, 졸업 후 사회진 출을 위한 역량개발과 경력개발의 기회를 제공한다. 인턴십 프로 그램에 참여하는 학생은 학점신청서, 연수보고서 및 기타 증빙서 류를 제출하여 심사를 통과(개별통보)하고 평가받게 된다."
                },
                {
                    "name": "휴먼기계바이오공학산학연계중기인턴십Ⅱ",
                    "description": "사회 진출 전 기업(관)의 현장실습 경험을 통해, 졸업 후 사회진 출을 위한 역량개발과 경력개발의 기회를 제공한다. 인턴십 프로 그램에 참여하는 학생은 학점신청서, 연수보고서 및 기타 증빙서 류를 제출하여 심사를 통과(개별통보)하고 평가받게 된다."
                },
                {
                    "name": "휴먼기계바이오공학산학연계중기인턴십Ⅲ",
                    "description": "사회 진출 전 기업(관)의 현장실습 경험을 통해, 졸업 후 사회진 출을 위한 역량개발과 경력개발의 기회를 제공한다. 인턴십 프로 그램에 참여하는 학생은 학점신청서, 연수보고서 및 기타 증빙서 류를 제출하여 심사를 통과(개별통보)하고 평가받게 된다."
                },
                {
                    "name": "기술창업과정실습",
                    "description": "휴먼 헬스케어분야의 기술창업에 관심있는 학생들의 기술창업과 정을 준비 단계부터 법인설립 및 자금조달, 연구소 설립까지의 전과정을 전문가와 실습해 봄으로서 실제 창업에 도움 될수 있도 록 개발된 교과과정이다."
                },
                {
                    "name": "휴먼기계바이오공학자기설계프로젝트Ⅰ",
                    "description": "학생들이 자신의 학습목표를 스스로 세우고, 학습 목표 달성에 필요한 다양한 활동들을 스스로 설계하고 진행한다. 학생들은 산 업체 인턴 프로그램, 해외 기관 인턴 프로그램, 연구실 인턴 프 로그램 등에 참여하고 이를 활용할 수 있다."
                },
                {
                    "name": "휴먼기계바이오공학자기설계프로젝트Ⅱ",
                    "description": "학생들이 자신의 학습목표를 스스로 세우고, 학습 목표 달성에 필요한 다양한 활동들을 스스로 설계하고 진행한다. 학생들은 산 업체 인턴 프로그램, 해외 기관 인턴 프로그램, 연구실 인턴 프 로그램 등에 참여하고 이를 활용할 수 있다."
                },
                {
                    "name": "의료기기설계",
                    "description": "본 교과목에서는 실제 의료현장에서 사용되고 있는 의료기기의 작동 원리를 이해하고 보다 좋은 설계안을 도출해보도록 한다. 또한, 의료기기 설계에 대한 관련 규정 및 법규를 이해하여 규제 에 적합한 기기를 설계할 수 있는 능력을 배양한다."
                },
                {
                    "name": "미래모빌리티",
                    "description": "변화하고 있는 자동차 산업에 대해서 배우고, 미래 자동차의 기 본 구성요소인 엔진, 모터, 배터리, 연료전지, 동력전달기구, 서스펜견, 조향장치, 브레이크 등의 원리를 학습한다. 자동차의 운동역학 및 성능요소를 학습해 자동차의 구조와 원리에 대한 전 반적인 이해를 높힌다."
                },
                {
                    "name": "최적설계",
                    "description": "공학 설계 문제에서 최적화 기술을 적용하고 공학 설계 문제의 공식화를 포함한 수학적 모델링과 계산 사이의 상호 작용을 배운 다. 설계 문제는 선형 계획법, 순차 선형 계획법, 경사도 기반 검색 기술을 포함한 수학적 계획법을 사용하여 해결되는 것을 학 습한다."
                },
                {
                    "name": "응용수학",
                    "description": "기계 및 바이오공학 연구에 필요한 미분방정식, 행렬 및 선형방 정식, 고유값 문제, 변분법 등 기초 수학의 풀이를 다룬다. 본 교과목에서 습득한 수학적 지식은 다양한 선형 시스템의 해석, 근사해(또는 최적해)의 도출, 기계 학습에의 응용 등에 활용될 수 있다."
                },
                {
                    "name": "로봇시스템제어",
                    "description": "본 수업에서는 로봇 매니퓰레이터를 제어하기 위한 기본 이론과 시뮬레이션을 통한 실습을 다룬다. 특히, 로봇의 위치, 속도, 그 리고 힘제어를 단계적으로 다루게 되며, 관절공간 및 작업공간에 서의 제어 방법을 학습하고 이를 ROS Gazebo 또는 MATLAB Robotics System Toolbox 와 같은 로봇 시뮬레이션 툴에 적용하 는 법을 배운다."
                },
                {
                    "name": "기계바이오재료과학개론",
                    "description": "기계 및 바이오 공학에 적용되는 기초 재료와 그 공정을 이해하 는 것을 목표로 한다. 이를 위해 재료공학 입문과 기계재료, 전 자재료, 고분자재료, 복합재료의 기초를 강의한다. 이러한 기초 적인 부분에 대한 이해를 바탕으로 기계재료 공정에 대한 강의를 진행한다."
                },
                {
                    "name": "창의적시스템설계",
                    "description": "본 과목은 목표물을 설계하고 제작하는 실습을 통해 기본적인 설 계 및 제작 기술과 창의성을 키우는 것을 목표로 한다. 설계의 기본 원칙, 가공방법 등을 배우고, 간단한 공작기계 실습도 진행 한다."
                }
            ]
        },
        "자연과학대학": {
            "자연과학대학": [
                {
                    "name": "자연과학과당신의미래",
                    "description": "자연과학과 당신의 미래 교과목은 1학년 자유 전공 학생을 대상 으로 자연과학의 세부 학문 분야인 수학,물리,화학,생명과학,통 계의 기초과학 분야를 개괄적으로 소개하고 이를 통하여 학생들 에게 자연과학의 이해를 통한 학생의 미래설계 관심사를 공유할 수 있는 자리를 마련하고자한다."
                }
            ],
            "수학과": [
                {
                    "name": "계산의기초와융합적문제해결",
                    "description": "계산은 기본적으로 오차를 발생하지 않는 수리계산(symbolic computation)과 미세한 오차를 수반하지만 대용량계산에 적합한 수치계산(numeric computation)으로 나뉜다. 본 강의는 수리계산 과 수치계산의 기본 언어를 습득하고 실제 예제들의 실습을 통해 습득한 언어를 다진다."
                },
                {
                    "name": "정보와인공지능의수리적이해",
                    "description": "현대사회의 기반이 되는 정보처리 기술의 토대와 인공신경망을 이용한 인공지능의 수리적 기본을 이해하는 것은 급변하는 우리 사회를 이해하고 다가올 지식정보사회를 준비하기 위해 필수적이 다. 본 교과에서는 정보의 특징과 정량적 측정, 정보처리 기반기 술, 인공지능과 인공신경망 등의 수리적 특징을 이해하고, Python 프로그램을 통해 이러한 개념과 기술들이 어떻게 구현되 는지 살펴본다."
                },
                {
                    "name": "미분적분학",
                    "description": "극한, 도함수와 그의 응용, 초월함수의 미분, 적분과 그의 응용, 급수의 수렴판정법, 함수의 전개, 행렬과 벡터, 편도함수, 중적 분 등을 다룬다."
                },
                {
                    "name": "미분적분학Ⅰ",
                    "description": "극한, 도함수와 그의 응용, 초월함수의 미분, 적분과 그의 응용, 급수의 수렴판정법, 함수의 전개 등을 다룬다."
                },
                {
                    "name": "미분적분학Ⅱ",
                    "description": "이차곡선, 극좌표, 행렬과 벡터, 벡터함수, 편도함수, 중적분, Green 정리, 발산정리 및 Stokes 정리 등을 다룬다."
                },
                {
                    "name": "미분기하학Ⅰ",
                    "description": "곡선론, 정규곡면, 접평면, 곡면의 orientationm vector field, compact orientable 곡면의 분류, Causs map, Gaussian 곡률, 제 이기 본량, minimal 곡면, isometry와 conformal map 및 2차원 다양체론을 다룬다."
                },
                {
                    "name": "미분기하학Ⅱ",
                    "description": "Gauss정리, 평행이동, 측지선, Gauss-Bonnet정리와 응용, exponential map과 convex 근방, 완비곡면, Hopf-Rinow정리, variation이론,? Jacobi field conjugate점, Hadamard 정리, Riemannian 기하학을 다룬다."
                },
                {
                    "name": "미분방정식",
                    "description": "1계 상미분방정식의 해법, 상수계수의 선형 상미분방정식, 고계 상미분방정식, 급수에 의한 해법(Legendre 미분방정식, Bessel 미분방정식, Gauss 미분방정식), Laplace 변환, 간단한 편미분방 정식들을 다룬다."
                },
                {
                    "name": "선형대수학Ⅰ",
                    "description": "선형대수학의 입문으로 유한차원 벡터공간, 선형변환과 행렬의 관계, 행렬식, 1차 연립방정식의 해법, 고유 벡터, 유클리드 공 간을 취급한다."
                },
                {
                    "name": "선형대수학Ⅱ",
                    "description": "선형대수학Ⅰ의 연속으로서, 행렬의 대각화, Jordan canonical form, Gram Schmidt 의 수직화, normal matrix, orthogonal and unitary matrix에 대해 배운다."
                },
                {
                    "name": "수치해석학",
                    "description": "다항식의 수치해, 행렬의 소거방법, 선형연립방정식의 해법, 비 선형연립방정식의 해법, Least squares, eigen problems, curve fitting, 수치적 미분과 적분, Interpolation, approximation by spline function, 비선형연립방정식의 수치해법 등에 대해 배운 다."
                },
                {
                    "name": "위상수학Ⅰ",
                    "description": "위상공간과 거리공간, T0～T4공간, 수렴 등을 다룬다."
                },
                {
                    "name": "위상수학Ⅱ",
                    "description": "compact 공간, 적공간, 연결공간, 완비거리공간, 함수공간, 일양 공간, 호모토피 등을 다룬다."
                },
                {
                    "name": "정수론",
                    "description": "합동, 페르마소수, 제곱잉여, 원시근, 르장드르의 기호와 성질, 논리와 형식이론 등을 다루며 그 응용으로 고전암호와 현대 암호 학을 소개한다."
                },
                {
                    "name": "현대대수학Ⅰ",
                    "description": "군을 중심으로 대수의 구조에 대하여 연구한다. 여러 가지 군과 그것들의 성질, 유한적으로 계산되는 교환군, Sylow정리, Solvable group이 취급되고, 환의 기본적인 개념과 성질이 취급 된다. ideal, quotient ring, polynomial ring."
                },
                {
                    "name": "현대대수학Ⅱ",
                    "description": "체 위에서 정의된 다항식의 여러 가지 성질 Irreducibility, Factorization에 관해서 살펴 본 후 Galois 이론을 중심으로 대 수적 체론을 다룬다."
                },
                {
                    "name": "다변수함수론",
                    "description": "n차원 유클리디안 공간, 벡터값을 갖는 함수들의 미분, 선적분, 다변수 함수의 적분 등을 다룬다."
                },
                {
                    "name": "현대수학입문",
                    "description": "집합연산, 함수, 관계, 순서수, 초한귀납법, 선택공리, Zorn의 보조정리, 행렬의 기초등을 배운다"
                },
                {
                    "name": "수치미분방정식",
                    "description": "상미분방정식의 초기치 문제를 해결하기 위한 Euler의 방법, Runge-Kutte방법들과 경계치 문제를 위한 shooting법, 유한차분 법들에 대해 학습하고, 이때 생기는 선형연립방정식의 반복해법 과 미분방정식의 eigenvalue문제에 대한 해법들을 다룬다. 나아 가 기본적인 편미분의 해를 구하는 방법과 이들의 응용에 관해 배운다."
                },
                {
                    "name": "정보와수리과학",
                    "description": "PC의 사용법과 UNIX시스템의 사용법을 익히고 수리과학에서 필요 한 컴퓨터 지식을 학습한다. 윈도우 환경에 대한 소개, UNIX작동 방법, 인터넷 기초 등을 다룬다."
                },
                {
                    "name": "해석학개론Ⅰ",
                    "description": "실수체계의 순서에 관한 성질, 위상적 개념, 수열의 극한, 연속 함수와 평등연속 함수 등에 관하여 배운다."
                },
                {
                    "name": "유한수학및프로그래밍",
                    "description": "컴퓨터를 활용하는 기본적인 능력을 키우고, 컴퓨터를 이용하여 여러 수학문제들을 해결하는 방법에 관하여 학습한다. 벡터와 행 렬, 정수론, 게임이론 등의 응용을 통하여, 순수수학의 활용에 관한 이해를 돕고, 나아가 수학 이외의 분야에서 수학적 지식을 활용할 수 있는 기본을 배양한다."
                },
                {
                    "name": "해석학개론Ⅱ",
                    "description": "일변수함수의 미분, 리만 적분, 함수들의 수열 및 급수, 다변수 함수의 미분, 중적분 등을 다룬다."
                },
                {
                    "name": "복소해석학Ⅰ",
                    "description": "복소수의 기하학적 성질, 복소함수의 변환성질, 해석함수, 복소 적분의 계산, Cauchy정리와 그 증명 등을 다룬다."
                },
                {
                    "name": "복소해석학Ⅱ",
                    "description": "Cauchy 부등식과 그 응용, maximum modulus 정리, 편각의 원리, 특이점, Laurent 급수, 조화함수, Poisson 적분공식 등을 다룬다 ."
                },
                {
                    "name": "편미분방정식",
                    "description": "적분곡선, Surfaces of vector fields, 1계 편미분방정식, 선형 편미분방정식 등을 다룬다."
                },
                {
                    "name": "암호론",
                    "description": "고전적 암호기법 및 현대적 암호기법을 소개하며 암호 설계과정 에서의 수학적 이론이 어떻게 다양하게 응용이 되는지를 공부한 다. 복잡도 문제, 비밀치 암호, 공개키 암호, 특히 RSA, 타원 곡선 암호 등 대표적인 현대 암호를 다룬다."
                },
                {
                    "name": "실변수함수론",
                    "description": "수직 선상에서 정의된 함수와 수열, Lebesgue 측도와 Lebesgue 적분, 미분과 Lebesgue 적분과의 관계, Lebesgue 공간(Lp- space)등을 다룬다."
                },
                {
                    "name": "수학교과교육론",
                    "description": "수학교육의 역사적 배경, 교과교육의 목표, 국내외 수학교육 과 정, 수학교육 철학, 수학교육과정, 수학교육학, 융합교육등의 여 러 이론과 개념을 중.고등학교 교육과정과 연계하여 다룬다. 융 복합적이고 창의적 사고를 발전시키고 학습자 중심의 수업을 구 성할수 있도록, AI 디지털교과서의 활용 역량을 함양하고, 수학 교육 현장에 바탕을 둔 교수학습, 지도, 평가 방법에 관한 다양 한 관점에서 능력을 기르도록 한다."
                },
                {
                    "name": "수학교과교재연구및지도법",
                    "description": "중등 수학교과서와 관련된 수학교재 개발을 위한 이론과 학교현장에서 창 의적이고 융합적 사고를 키우기 위하여 테크놀로지를 활용하여 수학개념 에 대한 시각적 이해를 높이고,수학적 사고력을 배양할 수 있는 수업구성 능력,학생의 수학적 이해 수준을 고려하여 가르칠 수 있는 능력을 기른다 . AI 디지털교과서를 분석하고 학교현장에서 진단, 수업, 평가 등에 활용 할 수 있도록 디지털 활용 역량을 높이고, 수학 개념을 효과적으로 전달 하는 방법과 학습장 중심으로 학생들이 능동적으로 참여할 수 있으며 실 생활과 연계된 자료를 바탕으로 학습효과를 높일 수 있도록 수업구성 능 력을 함양하게 한다."
                },
                {
                    "name": "수리영상처리",
                    "description": "영상의 획득, 복원, 필터링에 관한 수학적 방법을 배우고, 또한 이를 응용하여 보다 나은 구현방법을 배운다."
                },
                {
                    "name": "현대암호학",
                    "description": "현대에 상용되는 비밀키, 공개키 암호 알고리즘과 기반이 되는 수학적 문제에 대해 배우고 암호설계, 키관리, 서명, 인증 등 기 본 개념에 대해 배우고 공개키 암호 시스템에 대해 구체적으로 적용하여 배운다."
                },
                {
                    "name": "수학교과논리및논술",
                    "description": "수학의 기반 영역인 집합론, 해석학, 위상수학, 대수학, 기하 등 에서 사용되는 기초적인 수리논리를 학습하고, 수리 논술교육에 필요한 수학교육적 논술능력을 함양한다. AI 디지털 교과서를 활 용하여 다양한 형태의 자료를 포함한 형태와 공동 플랫폼에서 교 사 간의 생각과 해법을 공유하여 통합논술 문제를 구성할 수 있 는 능력과 문제해결을 위한 수학적 지식과 사고력을 비롯하여, 융복합 매체 활용 학습, 현장 연계 활동, 팀티칭 등 여러 학습법 을 통해 논리성을 갖추고자 한다."
                },
                {
                    "name": "수학특강Ⅰ",
                    "description": "본 과목의 목표는 수학의 최근 동향과 발전을 학부생들에게 소개 하기 위하여 해석학, 대수학 및 정수론, 미분기하 및 위상수학 등을 포함한 순수수학과 암호학, 계산과학, 수치해석학, 수리영 상처리 등을 포함한 응용수학 분야의 다양한 주제들로 구성된 강 의를 제공할 예정이다."
                },
                {
                    "name": "수학특강Ⅱ",
                    "description": "본 과목의 목표는 수학의 최근 동향과 발전을 학부생들에게 소개 하기 위하여 해석학, 대수학 및 정수론, 미분기하 및 위상수학 등을 포함한 순수수학과 암호학, 계산과학, 수치해석학, 수리영 상처리 등을 포함한 응용수학 분야의 다양한 주제들로 구성된 강 의를 제공할 예정이다."
                },
                {
                    "name": "수리과학인턴십Ⅰ",
                    "description": "이 수업은 수학과 학생의 취업 가능성이 있는 기업에서 전공과 관련 있는 업무를 수행하여 학생의 실무능력 및 취업경쟁력을 강 화를 돕는다."
                },
                {
                    "name": "다변수미분적분학",
                    "description": "다변수 함수와 벡터함수의 미분과 적분을 심화 이해하고 벡터 해 석학에 활용한다. 스토크스 정리와 응용을 다룬다."
                },
                {
                    "name": "수리모델링",
                    "description": "연과학과 공학을 비롯한 사회과학 실제 현상들을 수리 모형으로 표현한다. 동역학계, 통계모델, 미분방정식, 혹은 게임이론 모델 등으로 표현된 수리모델을 해석학적 혹은 수치해석적 방법으로 해결하고자 한다. 이를 시각화하여 실제 상황을 보다 정확히 이 해하도록 한다."
                },
                {
                    "name": "수학전공설계심화Ⅰ",
                    "description": "본 교과목은 도전학기를 수행하는 학생만 신청할 수 있는 교과목 으로 스스로 설계한 프로젝트를 수행한다."
                },
                {
                    "name": "수학전공설계심화Ⅱ",
                    "description": "본 교과목은 도전학기를 수행하는 학생만 신청할 수 있는 교과목 으로 스스로 설계한 프로젝트를 수행한다."
                },
                {
                    "name": "선형대수학",
                    "description": "선형대수학의 입문으로 수학비전공자 대상 기초 선형대수학을 강 의한다."
                },
                {
                    "name": "선형대수학",
                    "description": "선형대수학의 입문으로 수학비전공자 대상 기초 선형대수학을 강 의한다."
                },
                {
                    "name": "선형대수학",
                    "description": "선형대수학의 입문으로 수학비전공자 대상 기초 선형대수학을 강 의한다."
                },
                {
                    "name": "응용수학특강",
                    "description": "본 과목의 목표는 수학의 최근 동향과 발전을 학부생들에게 소개 하기 위한 강좌이다."
                }
            ],
            "통계학과": [
                {
                    "name": "응용통계입문",
                    "description": "본 교과목은 기초적 응용 통계 이론을 소개한다. 주요 강의 주제 는 통계학의 기초 개념, 기초적 확률 및 통계 이론, 기초적 통계 적 추론 문제, 그리고 다양한 통계 자료 분석 등으로 이루어져 있다. 본 교과목을 통하여 기술통계학, 확률이론 및 표본 분포, 추정과 통계적 가설검정, 단순회귀분석, 분산분석, 범주형 자료 분석 등의 내용을 학습한다."
                },
                {
                    "name": "정보화사회와통계",
                    "description": "우리는 방대한 자료가 홍수처럼 쏟아지는 정보화 사회 속에서 살고 있다. 보다 더 나은 삶을 영위하기 위하여 이러한 자료의 분석과 이해는 매우 현대 사회의 필수적인 요구가 되고 있다. 그러나 현실에서는 많은 이들이 통계를 매우 어렵다고만 생각하고 있고 더 나아가 오해 및 맹신을 하고 있는 경우가 많다. 본 강의를 통하여 통계를 보다 편안하게 인식하고, 정 확하게 이해함으로써 올바른 상황판단과 현명한 의사결정을 할 수 있는 자질을 마련하고자 한다. 실제 생활과 밀접한 자료 및 적용 예를 소개하 여 현 시대에 우리가 통계와 얼마나 밀접한 연관을 맺으며 살고 있고, 과 학적 자료의 이해와 분석이 얼마나 중요한 영향을 미칠 수 있는지 깨달을 수 있도록 할 것이다."
                },
                {
                    "name": "프로그래밍과통계적사고",
                    "description": "자연과학, 공학, 의학, 교육학, 사회과학, 경영학 등 다양한 분 야에서 수집된 데이터를 올바르게 해석하고 합리적인 결론을 제 시하기 위해 통계학을 배우는 것은 매우 중요하다. 본 수업에서는 통계학을 처음 접하는 학생들을 대상으로 기본적 인 통계 분석 방법론을 소개하고 매주 다양한 예제와 프로그램 실습을 통하여 데이터 분석에 많이 사용되는 R 또는 Python 등을 이용한 기본적인 코딩의 이해를 돕는다."
                },
                {
                    "name": "통계학Ⅰ",
                    "description": "정보화 사회에서는 누적된 자료를 해석하고 이를 이용하여 최적 의 결정을 내리는데 여러 가지 통계적 기법들이 활용된다. 통계 학 Ⅰ 은 두학기 과정의 통계학 입문의 첫 번째 과목으로 통계를 처음 접하는 대학교 1-2학년을 대상으로 통계학 전반에 걸친 내 용을 다루게 된다. 먼저 자료를 정리 요약하는 문제를 다루고 통 계학의 기초라 할 수 있는 확률분야에서 확률개념, 확률변수, 확 률분포, 그리고 표본추출 및 표본분포 관련 내용들을 다룬다. 자 세한 수리적 전개는 가능한 피하고 개념파악에 중점을 두며 통계 응용프로그램을 통한 실질적 자료 분석능력을 배양한다."
                },
                {
                    "name": "통계학Ⅱ",
                    "description": "통계학 Ⅰ에서 공부한 확률이론을 배경으로 통계추론의 주 내용 인 점추정, 구간추정, 일표본 에 대한 가설검정, 짝지어진 표본 및 분산에 대한 추정 및 검정, 실험계획법, 회귀분석, 범주형 자 료 분석과 비모수 통계까지 통계학에서의 전반적인 내용을 공부 한다. 이론에 치중하기 보다는 통계를 필요로 하는 여러 응용분 야에서 통계학 Ⅰ과 Ⅱ를 들음으로써 간단한 자료 분석을 할 수 있도록 통계학의 개념 파악과 활용능력을 기르고자한다."
                },
                {
                    "name": "응용확률과정론",
                    "description": "확률과정의 기초 개념, Markov 연쇄, random walk, branching 과정, Poisson 과정, 재생과정, 연속시간형 마코브과정, 생과 사의 과정 등을 다룬다. 더 나아가 Markov decision process, Hawke process, Bellman equation, Q-learning 등의 강화학습 내 용을 다룬다."
                },
                {
                    "name": "기초확률론",
                    "description": "표본 공간, 확률 및 조건부 확률의 개념, 확률변수 및 확률벡타 의 개념, 이산 및 연속 확률 분포, 이항분포, 기하분포, 포아송 분포, 정규분포, 감마분포등. 결합분포, 조건부 분포, 기댓값, 조건부 기댓값, 기댓값의 성질 등을 다룬다."
                },
                {
                    "name": "다변량분석및실습",
                    "description": "다변량 분포, 특히 다변량 정규분포의 성질, 분산 공분산 행렬, 상관 행렬, 다변량 분산 분석, 주성분 분석, 인자 분석, 다변량 회귀, 판별 분석, 분류, 집락 분석 등을 다룬다."
                },
                {
                    "name": "시계열분석개론및실습",
                    "description": "시계열 변동에 관한 유형을 장기적 경향 변동, 계절 변동, 순환 변동, 불규칙변동으로 나누어 해석하고, stationarity, AR, ARMA, ARIMA 모형 등의 기초적인 내용을 다룬다."
                },
                {
                    "name": "실험계획법",
                    "description": "실험 계획법의 기본 개념, 완전 랜덤화 계획, 랜덤화 완전블록 계획을 중심으로 여러 가지 유형의 블록계 획, 불완전 블록 계획 , 요인 실험, 교락, 일부 실시법, 직교 배열표 등을 다룬다."
                },
                {
                    "name": "통계프로그래밍Ⅰ",
                    "description": "이 과목은 프로그래밍에 관심이 있지만 프로그래밍 경험이 없는 통계학과 학생들을 위한 프로그래밍 입문 과목이다. 이 과목에서 는 여러가지 컴퓨팅 알고리즘을 학습하여 간단한 프로그래밍 문 제를 접해본다."
                },
                {
                    "name": "회귀분석",
                    "description": "단순회귀분석, 중회귀분석, 회귀선의 추정 및 검정, 회귀선의 유 의도 검정, 분산분석, 잔차분석, 회귀진단, 모형선택 등을 다룬 다."
                },
                {
                    "name": "수리통계학Ⅰ및연습",
                    "description": "확률 공간과 확률변수, 분포함수, 독립성, 확률분포, 분포의 특 성, 모멘트, 확률표본 등 의 성질 등을 다룬다."
                },
                {
                    "name": "수리통계학Ⅱ및연습",
                    "description": "통계적 추정론, 충분통계량, 완비통계량, 점추정과 구간추정, 가 설검정론, 네이만피어슨 정리, 우도비 검정 등을 다룬다."
                },
                {
                    "name": "표본조사및실습",
                    "description": "표본조사의 기본 원리와 표본 설계, 표본 추출 방법, 단순 무작 위 추출, 층화 무작위 추출, 계통 무작위 추출, 집락 추출, 비추 정, 회귀 추정 등을 다룬다"
                },
                {
                    "name": "고급데이터마이닝",
                    "description": "빅데이터를 분석하기 위해서 데이터 마이닝과 통계적 기계학습 방법들은 다양한 계산적 도구를 사용한다. 어떤 경우는 데이터를 바탕으로 결과를 예측하는 것을 중요시 하는 분석이 있는 한편, 데이터 자체의 내부의 관계나 구조에 집중하는 모델링도 존재한 다. 이 수업은 산업에서 다양하게 사용되는 데이터 마이닝 및 통 계적 기계학습 방법론들을 자세하게 공부하는 것을 목표로 한다."
                },
                {
                    "name": "생명과학데이터분석",
                    "description": "생물학, 의학, 약학 계열에서 주로 쓰이는 통계 방법론의 기초적 응용을 학습한다. 데이터의 기술, 기초적인 통계적 추론, 효율적 인 임상 실험의 설계 등을 논의한다. 또한 회귀 분석, 실험 계획 등의 자료분석 기법을 생물 및 임상 자료 해석에 적용한다."
                },
                {
                    "name": "확률및통계학",
                    "description": "오늘날 통계학은 거의 모든 분야에서 활발히 응용되고 있으며 실 생활과도 밀접한 연관이 있다. 지금까지 통계를 접해보지 못한 학부 학생들을 대상으로 통계학의 기본 개념 파악과 더불어 응용 소프트웨어를 이용한 활용능력을 기르고자한다. 기술통계, 확률, 분포이론, 추정 및 가설검정, 회귀와 상관, 실험계획과 분산분석 , 범주형 자료 분석 등의 용어에 대한 개념 설명과 더불어 실질 적인 자료 분석 실습을 통하여 통계지식을 실생활에 적용할 수 있는 능력을 기른다."
                },
                {
                    "name": "딥러닝을위한통계프로그래밍",
                    "description": "R과 파이썬과 같은 통계 프로그래밍 언어를 기계 학습 및 인공 지능을 포함한 다양한 통계 모델에 적용하고, 실제 데이터를 분 석하고 예측하는 실습을 진행한다."
                },
                {
                    "name": "베이지안통계및실습",
                    "description": "통계전반에 대한 새로운 접근방법인 베이지안 통계의 이론과 베 이지안 통계기법의 실제 적용에 필요한 몬테칼로 기법을 배운다."
                },
                {
                    "name": "경영경제자료분석및실습",
                    "description": "경영학, 경제학 분야에서 자주 나타나는 자료의 통계적 분석을 다룬다. 이에는 선형회귀분석의 재검토, 이분산 선형회귀분석, 패널자료 분석 등이 포함된다."
                },
                {
                    "name": "데이터마이닝",
                    "description": "이 수업은 회귀분석, 분류 기법에 기반한 지도 학습 (예를들면, linear and polynomial regression, logistic regression and linear discriminant analysis; cross-validation and bootstrap; model selection and regularization methods (ridge and lasso); nonlinear models, splines, and generalized additive models; tree-based methods, random forests, and boosting; support-vector machines) 그 리고 군집화 등을 포함하는 비지도 학습 방법 (k-means and hierarchical) 등을 배우는 것을 목표로 한다. 해당 수업은 이론과 실습 을 포함하는 수업이다."
                },
                {
                    "name": "보험통계",
                    "description": "보험통계의 개념, 종류, 순보험료, 영업보험료 계산방식을 학습 하고 위험모형, 생명분포, 생명보험 및 생명연금 등을 다룬다."
                },
                {
                    "name": "기초금융통계",
                    "description": "금융에서 쓰이는 수학적/통계적 방법론의 기본 개념을 이해하고, 이를 다양한 현금 흐름의 현재 가치와 누적 가치 계산에 적용하 는 방법을 알아본다. 연금, 채권, 대출금 등 금융상품의 현재 가 치 계산과 금융리스크 관리 기법을 학습한다."
                },
                {
                    "name": "통계프로그래밍Ⅱ",
                    "description": "R/파이썬 등의 통계 프로그래밍 언어의 활용법과 실제 통계 자료 분석에 대한 응용 능력을 습득한다."
                },
                {
                    "name": "통계데이터베이스",
                    "description": "대단위의 통계자료의 구축과 관리를 위한 D/B기법을 강의한다."
                },
                {
                    "name": "범주형자료분석",
                    "description": "질적 자료, 혹은 양적이나 범주형 형태로 얻어진 자료는 현대 통 계학에서 자주 등장하는 자료이다. 범주형 자료는 일반 양적자료 와는 다른 특수한 통계적 모형과 분석을 필요로 한다. 본 과정에 서는 범주형 자료분석에 필요한 로그선형 모형, 로지스틱 모형 등 통계적 모형과 이들 모형의 분석기법, 분석결과의 해석 등을 배우고, SAS 통계 패키지를 사용하여 습득한 지식의 응용을 경험 토록 한다."
                },
                {
                    "name": "통계캡스톤디자인",
                    "description": "통계적 의사소통과 문제해결 능력 배양을 위한 실습과목으로 강 사의 강의와 교재를 통해 상담자와의 효과적인 의사 소통법 및 통계적 문제 인지법 등을 교육한다(25%). 또한, 강사의 지도아래 수강생들은 상담자의 통계분석에 직접 참여하며 이는 전체교과의 75%를 차지한다. 수강생의 통계상담은 이화통계연구소의 인턴 프 로그램과 연계되어 연구소 소속 연구원과의 공동 참여를 원칙으 로 한다."
                },
                {
                    "name": "통계학인턴십Ⅰ",
                    "description": "이 수업은 통계학과 학생의 취업 가능성이 있는 기업에서 전공과 관련 있는 업무를 수행하여 학생의 실무 능력 및 취업경쟁력 강 화를 돕는다."
                },
                {
                    "name": "빅데이터를이용한통계그래픽스",
                    "description": "빅데이터 분석의 기본 개념과 자료의 형태에 대하여 학습하고 빅 데이터를 위한 데이터 베이스에 대하여 학습한다. 또한 이들 자 료의 특성이 잘 나타나는 형태의 그림을 그리기 위한 통계 그래 픽스 방법을 학습한다. 이를 통하여 빅데이터를 시각적으로 분석 하여 빅데이터로 부터 의미있는 결론에 도달할 수 있는 분석 능 력을 기른다."
                },
                {
                    "name": "계리리스크관리",
                    "description": "이 과목에서는 손해보험에서 발생하는 위험요소를 수학적으로 모 델링하고, 여러 가지 위험관리기법을 배운다."
                },
                {
                    "name": "응용인공지능",
                    "description": "본 교과목은 복잡하고 다양한 데이터를 분석하기 위해서 통계를 포함한 다양한 인공지능 기반의 자료 분석 방법들을 배운다. 이 를 실제 컴퓨터로 구현하고 결과를 분석 및 시각화하여 결과 보 고서를 작성해 보는 것을 목표로 한다."
                },
                {
                    "name": "통계전공설계심화Ⅰ",
                    "description": "본 교과목은 도전학기를 수행하는 학생만 신청할 수 있는 교과목 으로 스스로 설계한 프로젝트를 수행한다."
                },
                {
                    "name": "통계전공설계심화Ⅱ",
                    "description": "본 교과목은 도전학기를 수행하는 학생만 신청할 수 있는 교과목 으로 스스로 설계한 프로젝트를 수행한다."
                },
                {
                    "name": "통계수학",
                    "description": "통계학의 학습에 직접적으로 도움이 되는 수학에 대한 지식을 배 운다."
                },
                {
                    "name": "기초인공지능",
                    "description": "이 과목에서는 인공지능(AI) 분야의 기본 개념을 학습하고, 실습 을 통해 AI의 기본 기술과 방법들을 학습한다. 또한 분류 문제와 이미지 분석 등 AI의 실용적인 응용 사례들도 살펴본다."
                },
                {
                    "name": "통계학인턴십",
                    "description": "이 수업은 통계학과 학생의 취업 가능성이 있는 기업에서 전공과 관련 있는 업무를 수행하여 학생의 실무 능력 및 취업경쟁력 강 화를 돕는다."
                },
                {
                    "name": "통계학인턴십Ⅱ",
                    "description": "이 수업은 통계학과 학생의 취업 가능성이 있는 기업에서 전공과 관련 있는 업무를 수행하여 학생의 실무 능력 및 취업경쟁력 강 화를 돕는다."
                },
                {
                    "name": "통계계산",
                    "description": "이 수업은 컴퓨터 프로그램을 이용해서 Monte Carlo, Markov Chain Monte Carlo, 부트스트랩, EM 알고리즘 등을 배우고 실습 한다. 학생들이 이론적으로 배웠던 통계학을 직접 계산해봄으로 써 통계 이론적 지식을 공고히 하고 통계 응용적 능력을 함양함 을 목표로 한다."
                },
                {
                    "name": "비정형자료분석및실습",
                    "description": "본 수업에서는 구조화되어 있지 않은 반정형, 비정형 데이터를 통계적으로 분석하는 방법에 대해 탐구한다. 학생들은 직접 수집 한 데이터를 전처리한 뒤, 적합한 분석 모형 구축하여 데이터를 분석한 결과를 보고서로 제출하는 일련의 데이터 분석 과정을 거 친다."
                },
                {
                    "name": "현대통계학특론",
                    "description": "본 교과목은 통계학과 대학원에서 수행하는 연구에 대한 개괄적 인 소개가 이뤄지는 교과목으로 학과 교수님들이 돌아가며 연구 실에서 수행 중인 연구들을 세미나 형식으로 발표한다."
                }
            ],
            "물리학과": [
                {
                    "name": "현대물리학과인간사고의변혁",
                    "description": "인간 사고에 일대 변혁을 가져옴으로써 인문, 사회과학에도 큰 영향을 미치고 있는 현대물리학의 기본 개념과 영향을 상대론과 양자론을 중심으로 강의한다. 또한 혼돈이론, 우주의 궁극적 물 질과 법칙, 우주론 등에 대해서도 알아본다. 나아가서 인간관계, 예술, 음악 등 과학과 큰 관계가 없어보이는 주제에 대해서도 물 리학의 관점에서 살펴볼 것이다. 이 과목은 과학 비전공자도 수 강할 수 있으며 수학은 사용하지 않는다."
                },
                {
                    "name": "K-MOOC:현대물리학과인간사고의변혁",
                    "description": "인간 사고에 일대 변혁을 가져옴으로써 인문, 사회과학에도 큰 영향을 미치고 있는 현대물리학의 기본 개념과 영향을 상대론과 양자론을 중심으로 강의한다. 또한 혼돈이론, 우주의 궁극적 물 질과 법칙, 우주론 등에 대해서도 알아본다. 나아가서 인간관계, 예술, 음악 등 과학과 큰 관계가 없어 보이는 주제에 대해서도 물리학의 관점에서 살펴볼 것이다. 이 과목은 과학 비전공자도 수강할 수 있으며 수학은 사용하지 않는다."
                },
                {
                    "name": "컴퓨터속의우주",
                    "description": "이 강의는 우주와 천문학, 컴퓨터를 활용한 시각화 (visualization)에 관심 있는 모든 학생을 대상으로 한다. 전반 부에서는 별, 은하, 우주 등 현대 천문학의 기본을 배우고, 후반 부에서는 자료 분석 및 파이썬 문법 기초를 간략히 익혀 예제를 통해 파이썬을 활용한 천문 자료의 시각화를 실습한다. 강의 말 미에서는 시각 예술(visual art) 기법을 도입하여 과학 자료를 컴퓨터로 시각화한 예와 역으로 컴퓨터를 활용한 예술작품 중 우 주를 모티브로한 작품을 논한다."
                },
                {
                    "name": "기초과학기반지식재산권과창업세미나",
                    "description": "본 교과목은 일반적인 창업세미나가 아닌 기초과학(물리학, 화학 , 생명과학, 수학, 통계학, 지구과학 및 관련 전공 등)을 전공하 는 학생들을 대상으로 기술개발, 지식재산권 확보, 기술이전, 창 업, 신제품 개발, 글로벌 경쟁기업 성장이라는 목표를 가지고 학 생들에게 다양한 전문가를 통한 지식을 전달할 계획이다."
                },
                {
                    "name": "일반물리학Ⅰ",
                    "description": "주로 물성, 역학에 관한 기본개념과 원리를 내용으로 하며, 벡터 의 개념, 역학, 열물리, 전자기학, 현대물리학의 내용을 주로 다 룬다."
                },
                {
                    "name": "일반물리학실험Ⅰ",
                    "description": "주로 물성, 역학에 관한 기본적인 실험을 통하여 실험장치 및 기 구 다루는 방법, 측정의 요령, 측정치의 처리 방법을 습득하게 하고, 강의실에서 얻은 지식을 재확인한다."
                },
                {
                    "name": "일반물리학실험Ⅱ",
                    "description": "주로 물성, 역학에 관한 기본적인 실험을 통하여 실험장치 및 기 구 다루는 방법, 측정의 요령, 측정치의 처리 방법을 습득하게 하고, 강의실에서 얻은 지식을 재확인한다."
                },
                {
                    "name": "물리연구",
                    "description": "물리학 전공교과목에서 학습한 지식과 기본 개념을 바탕으로, 스 스로 기획하고 담당교수의 승인을 받은 연구 과제를 수행한다."
                },
                {
                    "name": "고체물리학",
                    "description": "결정고체의 기본구조와 물리적 특성을 고찰함으로써 금속, 반도 체 등 물질계에서 나타나는 물리적 현상을 이해하여 이것을 응용 할 수 있는 능력을 기른다. 결정구조와 결합, 격자진동, 에너지 띠 구조, 전자적성질, 반도체, 초전도 등을 다룬다."
                },
                {
                    "name": "분광학",
                    "description": "최근 크게 발달된 고도의 정밀 분광 측정기구와 레이저광의 광범 위한 적용의 병행을 모체로 한 응용과학 분야로서, 주로 물질의 미시적 구조의 연구방법을 비롯한 광현상의 새로운 분야에서 응 용성을 포괄적으로 이해하는데 목적을 두고, 분광분석장치, 원자 및 이원자 분자의 스펙트럼 이론, 다원자 분자의 적외 라만 스펙 트럼 이론, 고체분광이론, 플라즈마분광, 천체분광, 레이저 등을 다룬다."
                },
                {
                    "name": "수리물리학Ⅰ",
                    "description": "편미분방정식의 해법과 얻어진 해의 특성을 조사하여 물리학의 중요한 경계치 문제를 취급하는 능력을 기른다. 그리고 물리학에 필요한 기초수학으로서의 복소수 함수론, 고유치 문제, 행렬, 푸 리에변환, 군론 등의 내용을 학습한다."
                },
                {
                    "name": "수리물리학Ⅱ",
                    "description": "편미분방정식의 해법과 얻어진 해의 특성을 조사하여 물리학의 중요한 경계치 문제를 취급하는 능력을 기른다. 그리고 물리학에 필요한 기초수학으로서의 복소수 함수론, 고유치 문제, 행렬, 푸 리에변환, 군론 등의 내용을 학습한다."
                },
                {
                    "name": "실험물리학Ⅰ",
                    "description": "역학 실험으로 운영하여 실험을 통해 역학 이론을 직접 이해하고 물리법칙이 어떻게 실험을 통해 얻어질 수 있는가를 깨닫도록 한 다."
                },
                {
                    "name": "실험물리학Ⅱ",
                    "description": "전자기학 실험으로 운영하여 실험을 통해 전자기학 이론을 직접 이해하고 물리법칙이 어떻게 실험을 통해 얻어질 수 있는가를 깨 닫도록 한다."
                },
                {
                    "name": "반도체물리및실습",
                    "description": "반도체 물리에 관한 실험을 통하여 관련 내용을 깊이 이해하도록 하고, 실험하는 방법을 철저히 터득하여 실험을 통한 반도체 물 리학 연구의 기초를 익힌다."
                },
                {
                    "name": "광학응용및실습",
                    "description": "광학 관련 실험을 통하여 내용을 깊이 이해하도록 하고, 실험하 는 방법을 철저히 터득하여 실험을 통한 물리학 연구의 기초를 익힌다."
                },
                {
                    "name": "양자역학Ⅰ",
                    "description": "양자역학의 기본 개념, 원리 및 이론을 학습함으로써 원자, 원자 핵, 소립자, 물성 등에서 나타나는 현대 자연과학의 현상을 이론 적으로 설명할 수 있고, 응용할 수 있는 기반을 닦는데 목적을 둔다. 고유함수와 고유치의 수학적 개념, 물질의 파동성, 양자역 학의 과정과 개념과 원리, 슈뢰딩거 방정식, 1차원 운동, 3차원 운동, 각운동량과 spin, 원자구조에 대한 양자론적 설명 등을 내 용으로 한다."
                },
                {
                    "name": "양자역학Ⅱ",
                    "description": "양자역학Ⅰ의 계속으로 다체계, 섭동론, 각운동량 이론과 그 응 용, 산란이론 등을 학습한다."
                },
                {
                    "name": "역학Ⅰ",
                    "description": "고전역학의 원리와 이론, 뉴튼 방정식, 벡터 해석 등을 다루며, 거시적 세계에 대한 고전역학의 성공적 기술을 학습하고, 미시적 세계에서의 현대적 개념의 필요성을 인식한다. 만유인력 이외의 고전역학이 기술할 수 있는 물리현상(강체의 운동, 유체역학, 파 동방정식, 열전도 등)을 다루며, 특히 현대물리의 기초로서 도입 되는 라그랑즈 방정식 및 해밀턴 원리 등을 학습한다."
                },
                {
                    "name": "역학Ⅱ",
                    "description": "고전역학의 원리와 이론, 뉴튼 방정식, 벡터 해석 등을 다루며, 거시적 세계에 대한 고전역학의 성공적 기술을 학습하고, 미시적 세계에서의 현대적 개념의 필요성을 인식한다. 만유인력 이외의 고전역학이 기술할 수 있는 물리현상(강체의 운동, 유체역학, 파 동방정식, 열전도 등)을 다루며, 특히 현대물리의 기초로서 도입 되는 라그랑즈 방정식 및 해밀턴 원리 등을 학습한다."
                },
                {
                    "name": "입자물리학",
                    "description": "물질의 가장 궁극적인 구성요소인 소립자들의 기본개념을 대칭성 을 바탕으로 이해하고, 소립자상호작용인 강력, 약력, 및 전자기 력을 설명하는 표준모형을 공부한다. 이를 바탕으로 우주의 기 원을 설명하는 대통일이론도 개괄적으로 학습한다."
                },
                {
                    "name": "전산물리와인공지능",
                    "description": "다양한 수치해석방법(선형대수, 최적화, 몬테카를로)과 인공지능 /기계학습방법(회귀, 분류, 딥러닝, 베이지안 최적화)을 익히고 물리계의 최적화, 역문제, 예측 등에 적용한다."
                },
                {
                    "name": "전자기학Ⅰ",
                    "description": "전자기학의 기본원리와 이론 및 그 응용을 다루며, 학습 내용은 정전기학, 전류, 자기장, 전자기유도, AC 회로, 맥스웰 방정식, 전자파, 전자장 내에서의 대전입자의 운동, 초전도체의 전자기적 성질, 전기역학, 특수상대성 이론 등이다."
                },
                {
                    "name": "전자기학Ⅱ",
                    "description": "전자기학의 기본원리와 이론 및 그 응용을 다루며, 학습 내용은 정전기학, 전류, 자기장, 전자기유도, AC 회로, 맥스웰 방정식, 전자파, 전자장 내에서의 대전입자의 운동, 초전도체의 전자기적 성질, 전기역학, 특수상대성 이론 등이다."
                },
                {
                    "name": "천체물리학",
                    "description": "천체의 제반현상을 물리학적 지식을 이용하여 이해하도록 한다. 태양계, 별, 성간물질, 은하계, 우주 등에 대한 현상과 이론적 모형 등을 소개하고, 태양계와 우주의 기원에 대해서도 논의한다 ."
                },
                {
                    "name": "파동및광학",
                    "description": "파동과 진동의 기본개념과 성질을 학습함으로써 현궁(string- segment) 및 막의 진동론, 탄성의 이론을 이해하고, 광파의 간섭 , 회절 및 편광 현상을 습득하게 함으로써 흡수 및 산란 현상 등 양자광학의 개념을 이해할 수 있도록 한다."
                },
                {
                    "name": "일반물리학",
                    "description": "주로 물성, 역학에 관한 기본개념과 원리를 내용으로 다룬다."
                },
                {
                    "name": "일반물리학Ⅱ",
                    "description": "주로 물성, 역학에 관한 기본개념과 원리를 내용으로 하며, 벡터 의 개념, 역학, 열물리, 전자기학, 현대물리학의? 내용을 주로 다룬다."
                },
                {
                    "name": "열및통계물리학Ⅰ",
                    "description": "열역학 법칙, 분자운동론, 속도, 분포, 수송현상, 맥스웰-볼쯔만 통계, 페르미-디락 통계, 보즈-아인슈타인 통계, 미시적 양자론 적 역학 등으로부터 거시적인 현상을 이해하는 기본 논리체계를 습득한다."
                },
                {
                    "name": "열및통계물리학Ⅱ",
                    "description": "열역학 법칙, 분자운동론, 속도, 분포, 수송현상, 맥스웰-볼쯔만 통계, 페르미-디락 통계, 보즈-아인슈타인 통계, 미시적 양자론 적 역학 등으로부터 거시적인 현상을 이해하는 기본 논리체계를 습득한다."
                },
                {
                    "name": "최근물리학동향Ⅰ",
                    "description": "물리학과 교수들이 현재 연구하고 있는 내용과 국내외에서 현재 활발히 추진되고 있는 연구동향을 다룬다."
                },
                {
                    "name": "최근물리학동향Ⅱ",
                    "description": "물리학과 교수들이 현재 연구하고 있는 내용과 국내외에서 현재 활발히 추진되고 있는 연구동향을 다룬다."
                },
                {
                    "name": "반도체및나노과학",
                    "description": "현대 문명사회에서 반도체의 역할은 지대하다. 그러므로 반도체가 무엇이며, 어떤 원리로 우리 생활에 많이 쓰이고 있는지를 알아보는 것은 중요하다. 이 강의에서는 고체물리의 기본 개념으로 반도체의 성질을 이해하고자 하며, 반도체를 이용한 각 종 소자의 기본 원리를 알아본다. 한편, 기술이 발전해 감에 따라, 매우 작은 크기 의 세계에서 일어나는 현상에 대한 이해가 중요해지고 있으며, 앞으로 nano- technology (NT)는 더욱 발전할 것으로 보인다. 예를 들면, 컴퓨터의 용량이 커지 고 빨라지면서 nano-meter 크기의 회로가 불가피해 졌는데, 이 정도로 작은 회로에 서는 양자역학적 현상이 매우 중요한 역할을 하고 있음이 밝혀지고 있다. 이 강의 에서는 nano-meter 크기의 세계에서 일어나는 양자역학적 현상들을 양자역학의 기 본원리로 이해하고자 한다."
                },
                {
                    "name": "생물물리학",
                    "description": "분자, 세포, 기관 등 모든 단계의 조직체에서 일어날 수 있는 기 본적인 생명현상을 물리학적인 시각으로 고찰한다."
                },
                {
                    "name": "글로벌물리",
                    "description": "교수인솔 해외학습 프로그램 등을 통하여 수강생의 글로벌 역량 을 강화하고 첨단연구를 경험하게 한다."
                },
                {
                    "name": "물리학인턴십Ⅰ",
                    "description": "학생들에게 실무능력 및 취업경쟁력 강화를 위하여 현장경험의 기회를 제공하고자 한다."
                },
                {
                    "name": "물리학캡스톤디자인Ⅰ",
                    "description": "물리학 전공교과목에서 학습한 지식과 기본 개념을 바탕으로, 스 스로 기획하고 담당교수의 승인을 받은 팀별 과제를 수행한다."
                },
                {
                    "name": "양자역학입문",
                    "description": "현대물리학의 기본개념을 이해하고 이에 관한 전반적인 지식을 습득시킨다. 물질파, 파동 함수, 기저 등 양자역학의 기본 개념 을 습득하고 수소원자의 에너지 구조에 대하여 학습한다."
                },
                {
                    "name": "상대론입문",
                    "description": "현대물리학의 기본개념을 이해하고 이에 관한 전반적인 지식을 습득시킨다. 특수상대성 이론에서는 4차원 벡터의 개념을 이해시 키고, 원자물리, 분자물리, 고체물리, 핵 및 입자물리에 대한 객 관적인 지식을 습득한다."
                }
            ],
            "화학·나노과학과": [
                {
                    "name": "일반화학",
                    "description": "개괄적인 화학의 개념과 원리를 소개하고, 우리 주변의 물질계의 이해를 돕고자하는 기초과학 과목이다. 화학, 생명과학, 또는 이 들과 연관된 전공을 선택하고자 하는 학생은 일반화학 I, II를 권장한다."
                },
                {
                    "name": "일반화학Ⅰ",
                    "description": "화학, 생물학, 또는 이와 관련된 학문을 전공하려는 학생들을 대 상으로 화학의 원리와 개념을 소개하는 2학기 과정의 첫 번째 학 기 과목이다. 물질계의 조성과 변화, 원자 구조와 화학 결합, 화 학 반응과 양적 관계 등을 취급한다."
                },
                {
                    "name": "일반화학Ⅱ",
                    "description": "화학, 생물학, 또는 이와 관련된 학문을 전공하려는 학생들을 대 상으로 화학의 원리와 개념을 소개하는 2학기 과정의 두 번째 학 기 과목이다. 기체, 액체, 고체계의 성질, 산-염기 반응, 산화- 환원 반응, 화학반응 속도, 핵화학, 무기화학물, 유기 및 생물 분자의 구조와 성질 등을 다룬다."
                },
                {
                    "name": "일반화학실험Ⅰ",
                    "description": "화학실험의 기본 조작 방법을 습득하게 하고 실험을 통해 화학의 원리를 이해하게 하는 2학기 과정의 첫 번째 학기이다."
                },
                {
                    "name": "일반화학실험Ⅱ",
                    "description": "화학실험의 기본 조작 방법을 습득하게 하고 실험을 통해 화학의 원리를 이해하게 하는 2학기 과정의 두 번째 학기이다."
                },
                {
                    "name": "기기분석화학",
                    "description": "현재 사용되고 있는 기기를 사용하는 분석 방법의 이론 및 응용 에 대하여 개괄적으로 소개함으로써 기기분석의 기본 개념을 제 공한다. 전위차법, 전압전류법 등의 다양한 전기 분석 화학과 자 외선, 가시광선, 적외선 영역에서의 원자 및 분자의 분광법을 다 루며, 다양한 크로마토그래피 분리법을 다룬다."
                },
                {
                    "name": "무기화학Ⅰ",
                    "description": "무기화학의 기본적인 개념 및 원리 그리고 이론을 습득하는데 목 적을 둔다. 원자의 구조, 대칭 및 군론, 화학결합, 분자궤도이론 , 분자구조 및 구조결정법, 용액화학, 산화, 환원 및 전극 전위, 수소화물, 염화물, 산화물 등에 대해 학습한다."
                },
                {
                    "name": "무기화학Ⅱ",
                    "description": "무기화학Ⅰ의 계속으로 착물 화학, 유기 금속 화학, 고체화학, 광화학, 무기반응 메커니즘, 생체 무기 화학 등에 대해 학습한다 ."
                },
                {
                    "name": "물리화학Ⅰ",
                    "description": "양자화학과 분광학을 주로 취급한다. 분자 및 원자의 에너지 상 태와 화학 구조의 관계, 분자 분광학의 원리와 이를 통한 화학 구조의 규명과 분석 화학적 응용을 다룬다."
                },
                {
                    "name": "물리화학Ⅱ",
                    "description": "평형 열역학 및 반응속도론, 그리고 이들과 관련된 제반 화학적 문제에 대한 기본 원리, 실험 방법과 결과의 분석 방법, 실제적 응용을 다룬다. 열역학 법칙과 함수, 생화학계의 열역학, 전기화 학, 반응속도 법칙, 효소 반응을 포함한 용액계의 반응속도 등이 이 교과목의 주된 주제이다. 또한 다양한 거시적 화학계의 화학 평형 성질과 상태 변화에 관한 내용을 취급한다."
                },
                {
                    "name": "물리화학Ⅲ",
                    "description": "통계열역학, 비가역열역학, 전달현상, 광화학, 화학동력학에 관 한 내용과 고체 및 고분자의 구조와 성질에 대한 내용을 취급한 다."
                },
                {
                    "name": "분석화학Ⅰ",
                    "description": "일반화학의 내용을 숙지한 학생이, 분석화학 분야에 있어서의 중 요한 화학원리에 대한 확고한 지식을 습득하게 한다. 분석화학 과목의 개관을 통하여, 실험오차의 통계 처리, 산-염기 평형에 관한 이론 및 적정, 완충용액과 체계적인 평형 처리, EDTA 착화 합물 평형 등 화학평형 이론과 그에 관련된 계산을 연마한다."
                },
                {
                    "name": "유기화학Ⅰ",
                    "description": "유기화학은 탄소화합물에 대한 화학이며, 생체화합물의 대부분이 유기화학에 속한다. 유기화학은 생물화학의 바탕이 될 뿐만 아니 라 생물학 및 의약학과도 밀접한 관계를 가진다. 본 과목은 유 기 화합물의 결합 및 작용기, 입체화학, 산-염기 등 기본적인 개 념을 우선 교육하고, 유기화학 반응 중 첨가 반응, 치환 반응 등 을 교육한다."
                },
                {
                    "name": "유기화학Ⅱ",
                    "description": "유기화학Ⅰ의 계속으로, 특히 카보닐 작용기 및 그 유도체의 반 응, 방향족 화합물 및 그의 대표적인 반응에 대해 교육하고, 단 백질, 탄수화물, 지질, 핵산 등 생체 고분자에 대한 유기화학적 고찰도 포함한다."
                },
                {
                    "name": "유기분광화학",
                    "description": "유기 화합물의 분석에 기본이 되는 적외선(IR) 분광법, 핵자기공 명(NMR) 분광법, 자외선(UV) 분광법, 질량(Mass) 분광법 등의 기 초적 이론과, 이들을 이용한 실제적인 분석의 공부를 목적으로 한다.? 따라서, 이론적인 면에 치우침이 없이, 유기 화합물의 분 석을 위한, 이들 분광학적 도구를 이용한 실용적인 훈련을 강조 하였다. 본 과목은 유기화합물에 대한 기초적인 지식이 있는 3, 4 학년 학생 또는, 유기화학 I, II를 이수한 학생에게 적합하다."
                },
                {
                    "name": "생화학Ⅰ",
                    "description": "생명현상의 기본 유기물질인 단백질, 탄수화물, 핵산, 지질의 분 자구조와 세포내에서의 기능을 물리, 화학적인 관점에서 이해한 다. 단백질의 구조, 반응메커니즘, 촉매작용 등을 다루고, 지질 은 세포막의 구조, 세포막을 통하여 이동하는 수송 작용 등을 이 해하며, 탄수화물과 핵산은 기본 구조와 그들의 세포내의 기능을 이해한다."
                },
                {
                    "name": "생화학Ⅱ",
                    "description": "생화학 I에서 이해한 생명체의 유기물질의 대사 (분해를 통한 energy 생성, 세포내에서의 생합성)를 다룬다. 즉, 세포내에서 진행되는 glycolysis, TCA cycle, urea cycle, biosynthesis등 유기적인 관계를 다룬다."
                },
                {
                    "name": "나노소재화학",
                    "description": "최근 나노과학의 발전 경향과 응용 가능성 등에 관하여 소개한다 . 단일 분자화합물에서 응축고체 화합물까지의 발달 과정을 분자 조립식 접근 방법으로 이해하고 양극단의 중간 단계 과정을 이해 하여 나노재료의 물성을 이해한다. 기능성무기재료, 유기재료, 무기/유기 혼성 재료의 등 최근 나노재료들의 특성분석과 합성방 법, 응용가능성에 관하여 배운다."
                },
                {
                    "name": "유기화학실험Ⅰ",
                    "description": "기본적으로 이해하고 갖추어야 할 유기화학 실험 기법을 교육한 다. 실험 내용은 증류, 녹는점 측정, 재결정, 추출, 크로마토그 래피 등 기본 실험 테크닉을 익힌 후, 치환 반응, 첨가 반응 등 유기화학 I에서 배우는 유기반응들을 실제로 수행한다."
                },
                {
                    "name": "유기화학실험Ⅱ",
                    "description": "유기화학실험Ⅰ에서 익힌 실험기법을 토대로 각종의 반응실험을 행하고 그 결과를 분석, 정리해 봄으로써 유기화학 반응의 원리 와 현상을 이해함을 목적으로 한다. 실험 내용은 유기 화학 Ⅱ에 서 배우는 유기 반응들을 위주로 하여 카보닐 작용기의 반응들과 유기금속화합물의 반응들을 포함한다."
                },
                {
                    "name": "물리및분석화학실험",
                    "description": "화학 실험의 고안, 데이터 취득, 실험 결과의 분석과 해석, 그리 고 실험 보고서의 작성에 관련된 기본 원리를 터득하게 한다. 그 리고 물리화학적 실험 방법인, 열적 분석, 반응 속도론, 분광학 등을 이용한 실험을 수행하여 각 실험 방법의 기법 등을 습득하 게 한다. 또한, 분석화학 기법 중에 하나인 전기화학 실험을 통 해 전극 반응과 물질 이동에 대해 이해한다."
                },
                {
                    "name": "무기및고분자화학실험",
                    "description": "이 교과목에서는 무기 화학과 고분자 화학 분야에서 선별된 몇 개의 주제에 대해 여러 화학실험 기법들을 종합적으로 활용하여 소 연구 과제 형식으로 실험을 수행하고 보고를 함으로써 첨단 화학실험기법을 익히고 독립적인 연구자가 되는 훈련을 하게 한 다."
                },
                {
                    "name": "생물리화학",
                    "description": "생물계의 열역학, 생물분자의 구조와 기능, 생명계의 분자 간 상 호작용, 리간드 결합, 효소 반응을 포함한 생물분자계의 반응 등 에 관한 화학적 원리와 연구기법을 다룬다."
                },
                {
                    "name": "화학연구Ⅰ",
                    "description": "화학의 각 분야에서 특정과제를 선택하여 지도교수의 지도하에 심도 있는 실험연구를 수행한다. 또한, 학과내 각 연구실에서 진 행되고 있는 연구 미팅에 로테이션으로 참여하여 현재 학계에서 진행 중인 선도 연구 주제에 대하여 배우고 이해한다."
                },
                {
                    "name": "화학연구Ⅱ",
                    "description": "화학의 각 분야에서 특정과제를 선택하여 지도교수의 지도하에 심도 있는 실험연구를 수행한다. 또한, 학과내 각 연구실에서 진 행되고 있는 연구 미팅에 로테이션으로 참여하여 현재 학계에서 진행 중인 선도 연구 주제에 대하여 배우고 이해한다."
                },
                {
                    "name": "합성유기화학",
                    "description": "유기화학Ⅰ과 Ⅱ를 이미 공부한 학생들에게 합성적으로 유용한 유기 반응들과 메커니즘 및 이들의 응용을 교육한다. 탄소-탄소 간의 단일이중결합의 형성을 주로 고찰한다. 또한 산화, 환원, 보호, 재배열, 유기금속 화학, 입체 화학 등의 각종 반응들에 관 해 살펴보고, 다단계반응 및 생물학적 활성을 지닌 천연물의 전 합성을 공부한다."
                },
                {
                    "name": "유기반응론",
                    "description": "유기화합물의 합성과정에 유용하게 사용되고 있는 다양한 유기반 응들에 대해 소개한다. 유기반응들의 반응 메카니즘과 실제 유기 합성에의 그들의 사용을 중점적으로 교육한다."
                },
                {
                    "name": "고분자화학Ⅰ",
                    "description": "본 강좌에서는 고분자의 합성과 물리화학적 특성에 대한 기초 지 식을 공부함을 목표로 한다. 자유라디칼 중합, 축중합 등 기초 적인 고분자 합성법과 용액성질, 열적성질 등 기본적인 물리화학 적 특성 및 기초 고분자 분석법 등에 대하여 강의한다."
                },
                {
                    "name": "고분자화학Ⅱ",
                    "description": "본 강좌에서는 개환중합, 이온중합, 배위중합, 및 리빙중합 등 다양한 고분자 합성방법 및 고분자에 대한 열역학적 성질, 형태 학적 (모폴로지) 고찰, 기계적/전기적/광학적 물성 및 고분자 블 랜드 등에 대한 개념을 강의한다."
                },
                {
                    "name": "생화학특론",
                    "description": "분자생물학의 기초와 유전자, 유전체, DNA 대사, RNA 대사, 단백 질 대사 및 유전자발현 조절 등 DNA정보의 단백질 발현으로의 원 리를 분자적 수준에서 이해한다."
                },
                {
                    "name": "고분자화학특론",
                    "description": "본 강의에서는 최근 산업체에서 중점적으로 연구되고 있는 생체 고분자재료 및 전자/에너지/디스플레이 고분자재료 등의 핵심 분 야를 소개하고, 이들 고분자의 합성 및 물리화학적 특성에 관하 여 소개한다."
                },
                {
                    "name": "생유기화학",
                    "description": "아미노산, 단백질, 핵산, 탄수화물 등 생체분자의 구조와 생리적 역할 등을 이해하고, 유기화학적 관점에서 조합화학, 의약화학, 화학생물학 등의 연구를 위한 화학적 접근법을 다룬다."
                },
                {
                    "name": "무기화학특론",
                    "description": "무기화학의 세부 분야인 고체화학, 전이금속 화학, 무생무기화학 , 무기광화학 등에 대한 보다 자세한 내용을 배우고 관련 분야의 최신 내용, 연구 현황 및 전망을 다룬다."
                },
                {
                    "name": "광화학",
                    "description": "광화학은 양자역학적 원리를 바탕으로 물질과 빛의 상호작용으로 부터 분자의 구조를 해석하고 탐구하는 학문이다. 광화학에서는 원자와 분자의 회전, 진동, 그리고 전자 전이에 대한 기본원리와 실험적 방법을 다루고 이를 이용하여 빛에 의한 화학반응의 원리 의 규명과 반응성의 조절 등에 관련된 분자반응동역학의 핵심내 용을 다룬다."
                },
                {
                    "name": "국제학회현장실습",
                    "description": "학부생을 국제학회 현장실습 과목은 전공과 관련된 국제학회에 참가하여 연구실에서 인턴기간 동안 수행했던 결과를 발표하는 과목이다. 이 과목을 통하여 학생들은 각국에서 온 다른 학생들 과 어떻게교류하는지 또한 자신의 실험결과를 어떻게 발표해야 하는지를 배울 기회를 가진다."
                },
                {
                    "name": "분석화학Ⅱ",
                    "description": "일반화학과 분석화학I의 내용을 숙지한 학생이, 화학평형 이론과 응용을 바탕으로 기기를 사용하는 분석의 기본 개념을 습득하게 한다. 전기화학의 기본 이론과 산화-환원 적정 및 전기화학 측정 기법, 분광분석법 및 각종 크로마토그래피 법 등의 내용을 다룬 다."
                },
                {
                    "name": "물리유기화학",
                    "description": "유기화학의 기본 개념과 모델 및 이를 물리적으로 연구하는 방법 에 대해 교육한다. 여러 유기반응의 메카니즘에 따른 유기 반응 의 중간체, 산-염기 촉매의 반응, 반응성에 영향을 주는 여러 인 자들에 대해 공부한다."
                },
                {
                    "name": "에너지및재료화학개론",
                    "description": "본 교과목은 에너지 및 재료화학의 기본 원리에 대해 소개한다. 본 교과목에서는 에너지 생산, 저장 및 변환 공정 뿐만 아니라 이를 위해 개발된 다양한 재료의 특성 및 응용을 공부한다. 본 교과목에서는 에너지 및 재료화학의 기초적인 개념을 다루나, 이 는 무기화학, 물리화학, 유기화학, 고분자화학에서 배운 원자 및 분자구조, 결합, 열역학, 속도론 및 전기화학과 관련된 심화 내 용을 포함하고 있다."
                },
                {
                    "name": "화학·나노과학인턴십Ⅰ",
                    "description": "3, 4학년 학생들이 인턴십 프로그램을 수행하며 전공 관련 업무 및 기업체 기초 업무를 경험할 기회를 제공한다."
                },
                {
                    "name": "화학·나노과학인턴십Ⅱ",
                    "description": "3, 4학년 학생들이 기업체에서 인턴십 프로그램을 수행하며 전공 관련 업무 및 기업체 기초 업무를 경험할 기회를 제공한다."
                },
                {
                    "name": "화학나노과학전공설계심화Ⅰ",
                    "description": "본 교과목은 도전학기를 수행하는 학생만 신청할 수 있는 교과목 으로 스스로 설계한 프로젝트를 수행한다."
                },
                {
                    "name": "화학나노과학전공설계심화Ⅱ",
                    "description": "본 교과목은 도전학기를 수행하는 학생만 신청할 수 있는 교과목 으로 스스로 설계한 프로젝트를 수행한다."
                },
                {
                    "name": "데이터및계산화학",
                    "description": "수치적 방법을 통해 화학 문제를 해결하는 계산화학의 연구 방법 을 학습하고 다양한 화학 연구 데이터를 분석하는 파이썬 프로그 래밍 능력을 배양한다."
                }
            ],
            "생명과학과": [
                {
                    "name": "생명의신비",
                    "description": "생명과학을 전공으로 하지 않는 학생을 대상으로 생명과학에 대 한 기본적인 지식을 익히도록 하여 향후 자기 개발과정에서 생명 과학 지식습득을 필요로 할 때 용이하도록 한다. 생명현상에 대 한 이해를 넓힘으로 건전한 생명관을 확립하고 교양인으로 여러 가지 생명과학에 새로운 발전을 이해하는 데 도움을 주고자 한다 ."
                },
                {
                    "name": "환경과인간",
                    "description": "본 수업은 인간과 환경과의 관계를 분석하고 이해하는데 목적이 있다. 참여하는 학생들은 현재 우리 사회에 이슈가 되고 있는 다 양한 주제들을 선별하여 자발적인 위원회 활동을 하게 된다. 학 생들은 각 위원회 내에서 한 명의 구성원으로서 서로 다양한 소 통을 통해 의견을 모으고 각 위원회 별로 결과를 발표하며 사회 문제를 규정하는 단계에서부터 그에 대한 조사와 연구는 물론 해 결방안까지 모색하는 경험을 하게 된다."
                },
                {
                    "name": "브레인스펙트럼",
                    "description": "마음 작동의 근원체로 뇌를 가정하고 뇌에서 진행되는 정보전달 과정을 마음 현상에 적용함으로써, 오랜 세월 철학적으로 고민해 왔던 정신-육체라는 문제를 “뇌가 어떻게 마음을 그려 내는가 ”라는 신경과학적 접근으로 다루고자 한다."
                },
                {
                    "name": "EvolutionaryOrigin ofHumans",
                    "description": "이 과목은 인간 진화의 중요한 개념과 지식을 제공하는 것을 목표로 한다 . 인간의 진화를 이해하기 위해서는 다양한 자연과학 및 인문/사회 과학 적 방법이 동원되어야 함으로 이 강의는 중요 분야의 기초 개념과 지식을 제공한다. 과거 인간 진화의 과정들이 어떻게 분석되는지 그 과학적 방법 이 소개되고 무엇이 중요한 결론이며 및 논쟁의 주제인지 학습한다. 강의 내용은 영장류의 다양성과 진화, 화석 기록의 분석, 인지기능과 사회성의 진화, 불의 사용과 요리, 언어와 문화의 기원, 집단유전학, 적응과 질병, 농업의 기원, 진화심리학 등이다. 이러한 내용의 학습을 통해 인간의 본 성과 그 사회를 이해하는데 있어 인간 진화의 역사가 어떤 기여를 하는지 고찰할 수 있는 기회를 주고자 한다."
                },
                {
                    "name": "생활속의미생물",
                    "description": "고대로부터 그 존재를 술, 빵 등으로 인류에게 알린 미생물은 17세기에 현미경 개발을 통한 실체 확인, 19세기 병의 원인, 20세기 자연 환경 사 이클에 중요 역할을 하는 생명체로 재조명되었다. 미생물은 생명체와의 공존으로 상호 이익을 추구, 우리의 식탁 위, 산업 현장, 웰빙 마당 등, 인간과 더불어 사는 삶을 조성하며 인류의 복지에 기여하고 있다. 본 강의에서는 처음으로 그 실체를 드러낸 17세기 초기 미생물학자들의 얘기로 시작, 19세기 황금시대, 20세기 학문 발전에 기여, 21세기 식품, 환경, 웰빙 제품, 과학 기술 등에 미친 미생물의 영향을 과학과 문화 분 야와의 융합으로 풀어봄"
                },
                {
                    "name": "K-MOOC:인간은왜병에걸리는가-질병의생태와진화",
                    "description": "본 교과목은 진화적 관점에서 의학을 바라보는 ‘다윈의학’에 대한 내용을 대학교 교양 수준에서 강의한 수업이다. 지금까지 물리·화학적, 생리학적 관점에서 주로 바라보던 생명의 현상 또 는 질병에 대한 내용을 진화론에 근거하여 다양한 관점에서 볼 수 있도록 기획되었다. 세포나 유전자 또는 단백질 수준에서 이 루어지는 질병과 노화와 관한 물리·화학적, 생리적 분석에 머무 르지 않고, 더 크고 긴 관점에서 질병과 생물, 특히 인간과의 관 계를 살펴본다."
                },
                {
                    "name": "K-MOOC:동물의행동",
                    "description": "이 교과목은 동물의 행동을 과학적으로 이해하도록 수강자들에게 개념적인 토대 및 사고력을 제공한다. 처음부터 끝까지 이 교과 목을 꿰뚫는 주제는 진화이다. 즉 행동을 일으키는 직접적인 자 극과 메커니즘을 규명하고, 또 행동이 어떻게 동물의 생존과 번 식의 기회를 높이는지 설명한다. 이 교과목에서 다루는 중요한 주제는 자연선택과 진화, 유전자와 환경, 동물의 학습, 섭식행동 , 포식자-피식자 상호작용, 서식지 선택과 이주, 의사소통, 성선 택, 짝짓기 체계 및 사회성의 진화이다."
                },
                {
                    "name": "일반생물학",
                    "description": "과학, 생명 및 생명의 기원과 생물의 출현에 대한 올바른 이해를 정립시키고 생명체의 구조, 생리, 발생, 유전, 분류, 생태등을 공부한다."
                },
                {
                    "name": "일반생물학Ⅰ",
                    "description": "생물체의 구조, 생리, 발생, 생명의 기원, 유전, 분류, 생태 등 을 공부한다."
                },
                {
                    "name": "일반생물학Ⅱ",
                    "description": "생물체의 구조, 생리, 발생, 생명의 기원, 유전, 분류, 생태 등 을 공부한다."
                },
                {
                    "name": "면역학",
                    "description": "고등 생물의 자체 방어 기작인 면역 체계의 기본적인 이해와 면 역 체계를 구성하고 있는 물질들의 화학적, 세포학적, 유전학적 특성을 규명한다."
                },
                {
                    "name": "발생생물학",
                    "description": "본 교과목은 기본적인 생명체의 발생학적 프로그래밍을 분자-세 포 수준에서 이해하는 교과목으로서 발생에 관여하는 전사인자들 을 포함한 여러 발생관련 유전자들의 시-공간적 발현 신호전달 네트워크를 이해함으로써 발생을 분자적 수준에서 이해함을 목표 로 한다."
                },
                {
                    "name": "분자생물학Ⅰ",
                    "description": "생명 현상의 분자 수준에서의 이해를 목표로 하며, 유전자 DNA의 구조, 특성, 복제와 유전자의 특성, 전사, 번역, 발현 조절 등에 관해 강의한다."
                },
                {
                    "name": "분자진화학",
                    "description": "집단들에서의 DNA 다형성, 뉴클레오티드 염기 서열의 진화적 변 화, 분자 계통학, 분자 시계, 다수의 유전자로 구성된 유전자 가 계의 진화, 게놈의 구성과 진화, 돌연변이와 자연선택의 기능에 관한 내용을 학습한다. 생물이 어떻게 진화 발전하여 왔는가를 실증, 그 과정과 기구를 논하고 현재 진화가 어떻게 이루어지고 있는가를 밝히고자 한다."
                },
                {
                    "name": "동물생리학Ⅰ",
                    "description": "동물의 기능에 대한 기본적 개념 및 항상성 유지를 위한 조절 작 용을 습득한다. 막(膜)현상과 관련되는 삼투압 조절과 소화, 호 흡, 순환, 배설에 대한 생리를 공부한다."
                },
                {
                    "name": "미생물학",
                    "description": "미생물학을 생물학에서의 위치를 이해하고 미생물의 특징, 생리 및 물질대사의 기본 개념 파악과 미생물의 분자유전학적인 면에 서의 이해를 통하여 생명의 원리를 공부한다. 그리고 인간 생활 및 환경과 미생물의 관계에 대해 다룬다."
                },
                {
                    "name": "식물생리학",
                    "description": "식물의 생장, 발생, 분화, 개화 등 여러 가지 생리적 현상을 생 물 화학적 측면에서 이해하고 그 조절 기작을 강의한다. 강의 내 용은 수분 대사, 무기 영양, 광합성, 질소 대사, 호흡, 생장 및 발생 등에 관한 것이다."
                },
                {
                    "name": "유전학",
                    "description": "유전의 기본원리를 터득하기 위하여 동물, 식물, 미생물 및 인간 에 대한 유전과 변이의 기본적인 문제를 다루고 특히 근대 유전 학의 중심과제 중 하나인 분자유전학적 문제를 강조한다."
                },
                {
                    "name": "생태학",
                    "description": "생물과 그들의 환경과의 관계의 전체성 또는 유형을 체득하게 한 다. 물, 온도, 햇빛, 산소와 이산화탄소, 영양염류, 종내(種內) 관계, 군집, 천이와 변동적인 생태계 등을 체득하게 한다."
                },
                {
                    "name": "동물행동학",
                    "description": "동물행동학 강의는 진화적이고 생태적인 맥락에서 동물의 행동을 총체적으로 이해하려고 한다. 동물행동의 인과관계와 그 발생의 기원, 그리고 현재적인 작용 및 진화 역사 등에 관한 질문들을 다루며, 후자의 두 가지 문제에 더 많은 초점을 두고 해답을 구 하려고 한다."
                },
                {
                    "name": "야외실습",
                    "description": "현장 학습을 위주로 이론을 현장에 적용하는 방법을 익히게 한다 ."
                },
                {
                    "name": "일반생물학실험Ⅰ",
                    "description": "일반생물학의 내용을 뒷받침할 주요 항목을 골라 관찰하고 실험 하게 하며 실험기법을 습득하게 한다."
                },
                {
                    "name": "일반생물학실험Ⅱ",
                    "description": "일반생물학의 내용을 뒷받침할 주요 항목을 골라 관찰하고 실험 하게 하며 실험기법을 습득하게 한다."
                },
                {
                    "name": "생물화학Ⅰ",
                    "description": "다양한 생명 현상들을 물리 화학적인 측면에서 이해하고 해석할 수 있는 기초 개념의 습득을 목표로 하며 물의 특성, 생명 현상 과 관계되는 고분자들의 특성, 작용, 연구 방법, 열역학, 반응속 도와 메커니즘, 생체 촉매, 생화합물의 분해, 합성, 대사 등에 대해 강의한다."
                },
                {
                    "name": "세포생물학Ⅰ",
                    "description": "생물을 구성하는 다양한 세포의 기본적인 미세구조, 즉 막, 염색 체 및 세포소기관의 구조와 기능에 대하 전자현미경 및 분자적 수준에서 공부한다."
                },
                {
                    "name": "세포생물학Ⅱ",
                    "description": "생물을 구성하는 다양한 세포의 기본적인 미세구조, 즉 막, 염색 체 및 세포소기관의 구조와 기능에 대하 전자현미경 및 분자적 수준에서 공부한다."
                },
                {
                    "name": "식물다양성",
                    "description": "식물 분류의 역사, 명명, 동정, 분류, 계통 및 연구 방법을 다루 고, 식물 분류군의 특징을 다루고, 식물의 다양성을 이해시킨다."
                },
                {
                    "name": "동물다양성",
                    "description": "무척추동물에서 척추동물까지의 기본 구조, 즉 형태, 생태, 발생 및 진화의 경향을 규명하고, 각 동물들 간의 유연관계를 따져 분 류 체계를 세우는 원리 및 방법을 공부한다."
                },
                {
                    "name": "생명과학실험Ⅰ",
                    "description": "실험 실습을 통해서 동물, 식물, 미생물을 개체 수준에서부터 분 자 수준에 이르기까지 체계적으로 이해시키고자 한다."
                },
                {
                    "name": "생명과학실험Ⅱ",
                    "description": "실험 실습을 통해서 동물, 식물, 미생물을 개체 수준에서부터 분 자 수준에 이르기까지 체계적으로 이해시키고자 한다."
                },
                {
                    "name": "생명과학실험Ⅲ",
                    "description": "실험 실습을 통해서 동물, 식물, 미생물을 개체 수준에서부터 분 자 수준에 이르기까지 체계적으로 이해시키고자 한다."
                },
                {
                    "name": "생명과학실험Ⅳ",
                    "description": "실험 실습을 통해서 동물, 식물, 미생물을 개체 수준에서부터 분 자 수준에 이르기까지 체계적으로 이해시키고자 한다."
                },
                {
                    "name": "신경과학",
                    "description": "동물은 외부로부터 물리화학적 에너지의 형태로 정보를 수용하여 인식하고 정보에 대한 반응을 보인다. 감각, 신경 및 근육 생리 를 중심으로 정보의 인식, 수용, 이동, 조절 및 반응에 대해 공 부한다."
                },
                {
                    "name": "과학교과교재연구및지도법",
                    "description": "중등 과학 교과서 및 AI 디지털교과서를 분석하여 내용의 선정과 조직방법을 이해하고 과학교과지도에 필요한 기초학습이론과 실 제상황에 적합한 교수법을 습득한다. 또한 기존의 과학교과서 및 참고교재의 특성을 파악하여 효율적인 교육 성과를 기대할 수 있 는 교재개발 능력을 기르고 실제 학습장면을 고려한 교수계획안 을 작성하게 하고 교실 수업을 연구하게 한다."
                },
                {
                    "name": "과학교과교육론",
                    "description": "과학교과 교육과정의 기본모형을 이해하고 이를 기반으로 하여 학습장면에 맞는 교과과정을 선정 조직할 수 있는 능력을 기른다 . 과학 교과의 역사적 배경, 과학 교육 목표, 국내와 외국 과학 교육과의 비교, 과학교육 내용의 선정과 조직, 단원과 학습 자료 의 구성, 학습이론, 학습자 중심 및 과정 중심의 평가 등으로 구 성된다."
                },
                {
                    "name": "생물화학Ⅱ",
                    "description": "다양한 생명 현상들을 물리 화학적인 측면에서 이해하고 해석할 수 있는 기초 개념의 습득을 목표로 하며 물의 특성, 생명 현상 과 관계되는 고분자들의 특성, 작용, 연구 방법, 열역학, 반응속 도와 메커니즘, 생체 촉매, 생화합물의 분해, 합성, 대사 등에 대해 강의한다."
                },
                {
                    "name": "분자생물학Ⅱ",
                    "description": "생명 현상의 분자 수준에서의 이해를 목표로 하며, 유전자 DNA의 구조, 특성, 복제와 유전자의 특성, 전사, 번역, 발현 조절 등에 관해 강의한다."
                },
                {
                    "name": "고급생명과학실험캡스톤디자인Ⅰ",
                    "description": "생명과학관련 고급 기자재의 사용법을 익히고, 생명과학 관련 Project 수행을 위한 실험 기법과 기술을 익히도록 한다."
                },
                {
                    "name": "고급생명과학실험캡스톤디자인Ⅱ",
                    "description": "생명과학관련 고급 기자재의 사용법을 익히고, 생명과학 관련 Project 수행을 위한 실험 기법과 기술을 익히도록 한다."
                },
                {
                    "name": "분자의생물학",
                    "description": "인간의 구조, 기능, 조절기전, 다양한 질병의 현상 및 원인을 분 자생물학적 측면에서 이해함으로서 인간을 위주로 한 생명현상의 연구 및 치료의 기본적인 지식을 제공하고자 함."
                },
                {
                    "name": "생명과학연구개론",
                    "description": "생물의 기능이나 생산물을 응용한 공업기술의 개발과 유전자 재 조합으로 만들어진 생물의 다양한 응용에 관하여 배운다."
                },
                {
                    "name": "바이오빅데이터마이닝",
                    "description": "생명과학은 최근 인간 게놈의 해독과 오믹스 기술을 발달로 데이 터 기반의 정량적인 정보과학으로 발전하고 있다. 이 과목에서는 유전체,전사체,후성유전체 데이터 분석을 위한 시스템 생명정보 분석 기법과 생명과학도(비전공자)를 위한 기본적인 프로그래밍 기술을 다룬다. 또한 데이터 마이닝의 기초가 되는 군집화 (clustering) 및 기계학습의 대표적인 분석기법들에 대해서도 소 개한다. (DNA-RNA-Protein으로 이어지는 분자생물학 기본 원리와 조절 원리에 대한 지식을 필요로 함. 선수 과목 - 분자생물학 또 는 세포생물학)"
                },
                {
                    "name": "응용미생물학",
                    "description": "미생물 유전, 생리 및 물질대사를 토대로, 미생물과 인간 생활의 관계, 특히 신약개발 및 공중보건 등의 의약학 분야, 식품 및 독 소 미생물학 분야, 에너지, 유전자원 및 물질분야, 정화 및 온난 화저감 등의 환경분야에서의 관련 미생물과 그 미생물들의 역할 을 연구하여 산업 전반에 걸친 미생물의 기여도에 대해 공부한다 ."
                },
                {
                    "name": "과학교과논리및논술",
                    "description": "과학의 전반적인 영역에서 사용되는 기초적인 과학논리를 학습하 고 과학교육적 논술 능력을 배양토록 하며, 이 과정에서 인공지 능 기술과 디지털 교과서를 활용할 수 있다."
                },
                {
                    "name": "유전체학및생명정보학",
                    "description": "인간게놈프로젝트(Human Genome Project) 이후 게놈 정보를 기반 으로 한 유전체 연구의 다양한 측면과 축적된 방대한 양의 유전 체(게놈) 정보의 해석을 위한 생명정보학적인 분석 도구, 데이터 베이스 및 알고리듬에 관해 배운다."
                },
                {
                    "name": "재생생물학",
                    "description": "척추동물을 주 대상으로 기관 형성, 성장, 유지, 재생 과정을 설 명하고, 이 과정의 줄기세포의 기능에 대해 설명한다. 또한 기관 재생, 질병 치료의 배아줄기세포, 성체줄기세포, 유도줄기세포 활용 방법 및 가능성에 대해 강의한다."
                },
                {
                    "name": "조직세포학",
                    "description": "현대의 생명과학 연구에서 세포의 신호 전달 기전을 규명하는 것 은 세포의 발생, 분화, 증식 및 사멸 등을 올바르게 이해하기 위 하여 필수적이다. 본 강의에서는 주요 세포 신호 전달 기전에 대 한 연구들이 현대의 생명과학 연구에 어떻게 적용되는지를 폭넓 게 이해하도록 강의한다."
                },
                {
                    "name": "21C바이오산업",
                    "description": "바이오 산업 현황에 대한 소개를 목표로 함. 산업체 연구기관 등 관련 단체의 책임자 급을 강사로 초빙해 바이오 산업의 동향 및 전망, 벤처회사의 설립과 운영, 특허와 연구의 실용화 등을 주제 로 세미나를 개최함."
                },
                {
                    "name": "생명과학인턴십Ⅰ",
                    "description": "생명과학 관련 기관 및 기업 현장실습을 통하여 졸업 후 사회진 출 역량을 개발함."
                },
                {
                    "name": "동물생리학Ⅱ",
                    "description": "동물의 기능에 대한 기본적 개념 및 항상성 유지를 위한 조절 작 용을 습득한다. 막(膜)현상과 관련되는 삼투압 조절과 소화, 호 흡, 순환, 배설에 대한 생리를 공부한다."
                },
                {
                    "name": "세포신호전달개론",
                    "description": "세포신호전달은 생명과학의 새로운 기초학문이다. 외부에서 오는 세포성장인자, 호르몬, 신경전달물질등과 같은 신호는 세포막에 있는 수용체에서 인식된다. 활성화된 수용체는 세포내부의 물질 을 자극하여 이차신호전달물질을 생성하여서 세포내부로 신호를 전달한다. 본 교과목의 목표는 수용체의 활성화와 세포내부로 신 호의 전달과정을 이해하는 것이다."
                },
                {
                    "name": "생명과학인턴십Ⅱ",
                    "description": "생명과학 관련 기관 및 기업 현장실습을 통하여 졸업 후 사회진 출 역량을 개발함."
                },
                {
                    "name": "암생물학개론",
                    "description": "암생물학에 대한 배경 지식이 없는 학부생을 대상으로 신생물 질 환으로서의 암에 대한 기본 개념과 암세포의 특징, 암 발생, 성 장 및 전이의 분자/세포생물학적 기전, 그리고 암 치료 방법과 원리에 대해 강의한다."
                },
                {
                    "name": "생명전공설계심화Ⅰ",
                    "description": "본 교과목은 도전학기를 수행하는 학생만 신청할 수 있는 교과목 으로 스스로 설계한 프로젝트를 수행한다."
                },
                {
                    "name": "생명전공설계심화Ⅱ",
                    "description": "본 교과목은 도전학기를 수행하는 학생만 신청할 수 있는 교과목 으로 스스로 설계한 프로젝트를 수행한다."
                },
                {
                    "name": "후성유전학",
                    "description": "후성유전학은 동일한 유전정보를 가진 세포들이 환경변화에 따라 특이적인 유전자 발현을 유도하는 현상을 이해하고 연구하는 학 문이다. 본 강의에서는 후성유전학적 유전자 발현조절기전 및 암 과 같은 질병의 발병기전 및 치료방법을 이해하도록 강의한다."
                }
            ]
        }
    }
}