{
    "서울대학교": {
        "공과대학": {
            "공과대학": [
                {
                    "name": "공학지식의 글로벌 공유가치",
                    "description": "공학 교육을 받고 사회로 진출하는 사람들의 폭 넓은 공학 지식 및 다양한 경험은 산업 발전 및 사회 발전의 근간이다. 본 교과목에서는 학교 내에서 강의를 통해 습득한 공학기초지식 및 공학응용지식이 실제 현장에서 어떻게 응용이 되는지를 체험하고, 응용사례, 적용분야, 개선방안에 대하여 종합적으로 분석하는 능력을 키운다. 실제 해외 현장을 방문하여 글로벌 환경에서 공학 지식이 기여할 수 있는 문제점을 파악하고 이를 해결하는 방안을 모색함으로써, 장차 글로벌 리더로 성장하기 위해 지녀야 하는 봉사정신과 사회적 책무성을 내면화 하는 기회를 가진다. 실천적, 경험적 활동을 통해 지역과 글로벌 사회에 기여하고 도전적, 창의적 방법을 통해 전공지식의 사회적 공유가치 창출에 기여한다. 글로벌 산업 환경의 문제 발견, 글로벌 시장의 신규 가치 창출, 글로벌 교육 프로그램 등의 다양한 글로벌 경험을 통해 공학지식의 적용 방안, 개선 및 발전, 창업에 관한 새로운 아이디어를 도출하고 학기 중에 이러한 과정을 요약, 발표한다. 본 과목은 공학지식의 글로벌 현장 적용, 경험을 바탕으로 한 프로젝트 기획 등을 통해 사회적 기여, 공유가치 창출 실천 활동을 수행 또는 글로벌 환경에서 창업한 학생에 한하여 수강 자격을 부여한다."
                },
                {
                    "name": "다학제 창의적 제품개발",
                    "description": "본 과목에서는 수강생들에게 사회 및 기업체에 나가서 스스로 문제를 탐색하고 정의한 후, 그것을 해결하는 설계대안을 도출하고, 핵심기능시제품을 개발할 것을 요구한다. 이러한 훈련을 통해서 수강생들은 미래에 사회적 리더로서 지금까지 존재하지 않았던 제품이나 기술을 개발할 수 있는 “first mover”의 능력을 배양한다. 본 과목은 공대는 물론 타 단과대학의 다양한 전공의 학생들로 구성되는 다학제적 설계팀을 구성해서 설계프로젝트를 수행하도록 요구한다. 설계팀은 한 학기 동안 (1) 사회나 기업체에서 요구되는 사용자 중심 문제를 창출해서 고객요구사항목록을 작성한 후, (2) 체계적인 공학설계 방법론을 기반으로 개념설계를 수행하여 최적설계대안을 완성하고, (3) 최적설계대안을 바탕으로 핵심기능시제품을 제작하고, (4) 최종적으로 이것을 학기말에 발표하고 전시한다. 한편, 설계 프로젝트팀을 지원하기 위해서 마케팅, 산업디자인, 특허법, 창의적 사고, 개념설계 방법론, 문제창출 사례연구 등 다양한 강의를 제공하며, 다학제 교수진과 산학협력 교수진, 변리사, 외부 전문가로 이루어진 멘토그룹이 개인별, 조별 멘토링을 한다."
                },
                {
                    "name": "VR/AR의 개론 및 실습",
                    "description": "본 강좌는 가상현실·증강현실에 대한 주요 이론을 습득하고, 다양한 활용 사례들을 배우며, 실제 실습을 통해 VR/AR 환경을 구축할 수 있도록 한다. VR/AR에 대한 기본적인 지식 습득을 위해 딥러닝을 포함한 캐릭터 애니메이션 개론, 메타버스, 휴먼 팩터, 컴퓨터 그래픽스 이론, 가상현실 관련 소프트웨어 프로그램 실습, 3D 기반 모션캡쳐 등을 다룬다. 강의는 거꾸로 교육(Flipped learning) 방식으로 이루어지며, 3D 제작 플랫폼에 내장된 캐릭터 애니메이션 기본 모듈을 활용한 실습뿐 아니라 실제 VR/AR 기기를 활용한 프로젝트 위주로 진행된다. VR/AR 프로젝트를 바탕으로 과제를 부여하며 수강생은 분야별 모듈을 선택하여 참여하도록 한다. 프로젝트를 주도하고 이에 따른 문제를 해결해가는 과정에서 자기 주도적이고 동료 학습이 가능하도록 한다."
                },
                {
                    "name": "공학기술과사회",
                    "description": "공학기술과 사회발전간의 상호관계를 종합적으로 이해하고 기술진보가 사회변화에 미치는 영향을 분석하여 기술활동을 사회 및 환경변화와 합목적적적으로 수행할 수 있는 가치관을 배양시키는 것으로서 교과목의 주요내용은 아래와 같아. 공학기술과 사회적 제도 및 구성, 기술진보와 사회족의 변화, 공학기술과 사회윤리, 기술영향평가, 사전적 기술평가, 공학기술과 사회적 이슈, 공학기술과 고용 및 실업 등이다."
                },
                {
                    "name": "대학 스타트업 콜로키엄",
                    "description": "대학생에게 스타트업이란 극도로 불확실한 환경에서 부딪히게 되는 수많은 문제들을 극복하고 지속가능한 미래의 가치를 창출하는 기회이다. 본 교과목은 스타트업의 성공과 실패를 좌우하는 핵심요소를 분석하고 예측가능한 리스크를 미연에 방지하면서 회사를 성공적으로 이끌어갈 역량을 키우는 데 목적을 두고 있다. 이러한 목표를 성취하기 위해 다양한 분야의 스타트업 대표를 초빙, 세미나 및 토론을 통해 제품기획, 시장분석, 비즈니스모델, 투자유치 등 창업과정 전반에 대한 현장경험을 공유하고 위기관리 능력을 바탕으로 안정적인 스타트업으로 성장해갈 수 있는 기업가 정신을 함양한다."
                },
                {
                    "name": "로봇인공지능만들기",
                    "description": "최근 급속한 기술 발달로 자율주행자동차, 드론, 휴머노이드, 무인생산로봇과 같은 스스로 인지 판단하여 움직이는 자율로봇들이 일상생활에 보급 등장하기 시작했다. 이들 로봇의 등장으로 사고가 나지 않거나 운전면허가 필요 없는 자동차나 사람이 진입이 어려운 핵발전소나 지진 재난현장에 구조 및 극한 작업을 하는 등 기존에 상상할 수 없었던 분야로 빠르게 응용되고 있다. 더욱이 빅데이터, 기계학습, 인공지능 기술과 결합하며 갈수록 인간스러운 로봇으로 발전하기 시작했고 실제로 여러 분야의 인간 노동력을 대체하기 시작했다. 이 수업에서는 수강생들은 자율로봇의 원리와 최신 기술 동향을 소개받고 실제 로봇 설계 및 프로그래밍을 통해 로봇의 지능을 구현해보고 응용함으로써 배우게 된다. 공대뿐만 아니라 다양한 전공의 학생들의 수강을 환영하며 수강생들은 다학제로 팀을 이루어 수업을 통해 배운 기술을 사용하여 새롭고 유용한 로봇을 만들게 된다. 모든 자료는 영어로 만들어 지며 한국어와 영어를 번갈아 가며 강의하고 실습을 강조하므로 교환학생 및 국제 학생의 수강신청도 권장한다."
                },
                {
                    "name": "블록체인의 실무응용 1",
                    "description": "본 강좌는 학교 내에서 강의 또는 자기학습을 통해 습득한 블록체인 지식을 활용한 실습강좌이다. 사이버 보안과 블록체인 개론 및 실습을 수강하였거나 이와 동등한 이론 지식과 코딩 능력을 갖춘 3학년 이상 학생들을 대상으로 블록체인의 지식을 활용한 실습 및 프로젝트를 진행한다. 실제 데이터를 바탕으로 산업과 사회에서 겪는 블록체인 문제를 과제로 선정하게 하며 수강생은 이를 코딩을 통해 해결한다. 블록체인 문제를 해결해가는 과정에서 자기 주도적이고 동료 학습이 가능하도록 설계한다. 결과물과 협업을 근거로 담당교수가 S/U 학점을 부여한다."
                },
                {
                    "name": "사물인터넷과 공학설계",
                    "description": "이 강의는 자동차, 로봇, 스마트폰을 비롯한 여러 산업기기와 생활 가전 전 분야에 활용되는 사물인터넷(IoT; Internet of Things) 기술을 적용하여, 다양한 객체들을 설계하고 제작하는 실습을 수행함으로써, 설계 감각과 창의성을 키우는 데 목적이 있다. 학생들은 코딩으로 사물인터넷(IoT)을 구동시키고 모니터링하는 방법을 학습한다. 마이크로 컨트롤러(아두이노, 라즈베리파이 등)를 활용하여 컴퓨터의 구조를 이해하고, 온도, 습도, 빛, 소리, 동작, 이미지 등 다양한 센서와 디스플레이, 모터 등 구동 장치들이 연결되는 것을 확인하고, 그 원리를 이해할 수 있도록 한다. 또한 IoT의 다양한 응용사례를 경험함으로써 기초부터 시제품 개발에 이르는 타 공학 설계 교과목들과도 연계할 수 있을 것이다."
                }
            ],
            "원자핵공학과": [
                {
                    "name": "핵공학개론 2",
                    "description": "<핵공학개론 1>에 이어서 핵공학의 전반에 대하여 강의하며, 특히 핵융합, 플라즈마, 방사선 등의 분야의 기초와 응용에 관하여 중점적으로 강의한다."
                },
                {
                    "name": "원자핵공학세미나 1",
                    "description": "핵공학도가 갖추어야 할 소양을 증진시킬 수 있는 다양한 분야의 세미나를 학부생에게 제공하여 핵공학에 대한 이해와 사회 적응성을 높이도록 한다."
                },
                {
                    "name": "원자핵공학 학사논문연구 1",
                    "description": "이 교과목은 원자핵공학과 학생들에게 학사졸업논문 작성을 위한 독립 연구의 기회를 제공한다. 학생들은 수업에서 제공하는 다양한 전공탐색 프로그램과 전공교수와의 면담을 통해 논문 주제를 탐색 및 선정한다. 논문 주제에 맞추어 지도교수가 결정되면, 지도교수의 연구실에서 해당 연구를 수행한다. 문헌 조사 및 분석법을 배우고, 선정된 논문 주제에 대한 문헌조사와 관련 논문 발표를 수행한다. 또한 논문 작성법을 배우고 논문 계획서를 발표한다."
                },
                {
                    "name": "원자핵공학 학사논문연구 2",
                    "description": "이 교과목은 원자핵공학과 학생들에게 학사졸업논문 작성을 위한 독립 연구의 기회를 제공한다. 학생은 논문 지도교수의 연구실에서 논문 연구를 수행하고 최종 논문을 작성한다. 강의 시간을 통해서 학생들은 중간 연구내용을 발표하고 토론하며, 최종 논문 발표회를 개최한다."
                },
                {
                    "name": "원자력열유체공학",
                    "description": "열전달과 유체역학을 통합한 열유체공학 개관을 통해 원자력 시스템에서 유체 및 에너지 전달의 기본 개념과 원리를 이해하고 공학적 해법을 학습한다. 원자력 시스템에서의 열생성과 분포를 학습하고 냉각재의 종류와 특성을 공부한다. 연속체 개념과 용어를 정의하고, 질량, 운동량, 에너지 보존 법칙을 물리, 수학적으로 이해한다. 또한 이를 다양한 시스템에 적용해 공학적 해법을 구하는 과정을 학습한다. 층류와 난류를 배우고 내류, 외류에 대한 마찰계수 및 압력강하를 구하는 방법을 배운다. 차원해석을 이용해 원형대비 모형 실험을 이해한다. 에너지 전달의 기본 방식인 전도, 대류, 복사에 대한 물리적, 수학적 해석을 다룬다. 전도에서는 1차원 및 2차원 문제와 정상/비정상상태 열전도를 학습하고, 대류열전달 분야에서는 자연/강제대류 문제 등을 해석할 수 있는 열전달 관계식들을 배운다. 복사열전달에서는 복사 개념을 이해하고 흑체면 또는 회체 표면들 간의 복사 교환 등을 해석한다. 이를 바탕으로 열교환기 해석 방법 등을 배운다. 본 과목에서는 원자력공학에 필요한 열유체 기본 방정식과 구성식에 대한 확고한 이해를 바탕으로 다양한 공학적 문제해결 능력 배양에 주안점을 둔다."
                },
                {
                    "name": "플라즈마전자역학 1",
                    "description": "핵융합공학에 및 양자공학에 있어서 전기장 및 자기장의 해석은 매우 중요한 부분을 차지한다. 본 교과목에서는 전자기장 해석의 기본 토대가 되는 Coulomb's Law, Gauss's Law, Ampere's Law, Faraday's Law, Maxwell Equation, Potential theory 등을 벡터해석학을 이용하여 다룬다."
                },
                {
                    "name": "핵계측",
                    "description": "방사선의 기본 개념과 종류 및 방사선과 물질과의 상호작용을 이해하고 각종 계측기들의 작동원리, 기능, 사용방법 등을 익혀 핵계측 결과에 대한 자료처리 방법을 습득한다. 주요 내용으로는 기체 검출기의 특성, 반도체 검출기의 특성, 섬광 검출기의 특성, 감마선 측정, 중성자 측정 등이며 감마선 분광과 중성자 측정을 이용한 핵물질 측정을 소개한다."
                },
                {
                    "name": "핵융합기초",
                    "description": "핵융합 에너지 발생과 이를 실용화하기 위한 제반 시스템과 공학에 대힌 기본 원리와 기술적 문제점에 관련된 주제를 다룬다. 핵융합 반응에 따른 에너지 발생 및 손실 메카니즘, 플라즈마 가둠방법과 수송현상을 재조명한다. 이어 열핵융합 조건과 자기가둠형과 관성가둠형 장치들을 비교 검토하고, 저온 핵융합 개념을 살펴본다. 핵융합로의 설계와 기술개발을 위한 플라즈마 가열, 플라즈마-벽물체와의 상호작용,블랄ㅇ켓, 삼중수소 취급문제, 핵융합-핵분열 혼성로 등을 학습한다."
                },
                {
                    "name": "핵융합 플라즈마 실험",
                    "description": "플라즈마관련 과목에서 학습한 이론들을 실제적으로 적용하도록 진단 장치를 설계하고, 측정된 인자들의 물리적 특성을 검증하는 실험, 설계과목이다. 진공의 개요, DC glow 방전, 유전체 격벽 방전 등의 플라즈마 발생장치 설계 및 실증실험과 진단장치의 설계 및 진단실험을 수행한다. 장치설계는 전산모사방법을 이용하고 진단에는 진단회로를 구성하여 자료를 비교 분석한다."
                },
                {
                    "name": "핵공학 시뮬레이션 실습",
                    "description": "본 교과목에서는 원자핵공학에 널리 활용되는 전산해석 프로그램에 대한 지식을 학습하고, 이를 활용한 시뮬레이션을 실습한다. 핵분열원자로, 핵융합로, 방사선 발생장치 등의 핵공학시스템 설계 및 비정상상태 해석에 필수적인 열유체 해석코드, 구조‧재료 해석코드, 몬테칼로 입자수송 해석코드, 중성자 확산 해석코드 등의 이론과 사용법을 배우며, 이를 이용해 다양한 가상 핵공학시스템에 대한 분석을 수행한다. 코드 간 데이터 교환 방법을 배우고, 이를 이용한 연계 해석 실습을 통해 다물리 전산해석의 기본 지식을 습득한다. 마지막으로 핵공학 시스템 전산해석의 최신 연구 동향 및 미래 발전 방향을 파악한다."
                },
                {
                    "name": "핵비확산과 핵안보",
                    "description": "원자력의 평화적 이용은 농축 핵연료 공급, 사용후핵연료 관리 및 국가 에너지 안보에 중요한 필수조건이다. 이 강의에서는 국제 핵비확산 및 핵안보 체제, 핵물질 안전조치, 물리적방호, 사이버보안, 핵테러 방지, 핵감식 등 핵비확산과 핵안보 관련 국제적 이슈를 다룬다. 그리고 원자핵공학 기술이 어떻게 문제해결에 기여할 수 있는지 방사화학 및 핵연료주기, 차세대 원자로 시스템을 중심으로 논의한다."
                },
                {
                    "name": "핵연료주기공학",
                    "description": "핵연료주기공학은 원자로의 안정적인 핵연료 공급과 사용후핵연료의 안전한 관리 등 지속가능한 원자력 발전과 응용을 다루는 원자력공학의 핵심 분야이다. 이 강의에서는 다양한 핵연료주기 기술에 대한 핵심원리를 학습하고 정책적인 이슈를 논의한다. 우라늄의 공급, 변환, 농축과 핵연료 설계 및 제조와 같은 선행핵연료주기와 사용후핵연료의 저장 및 처리, 방사성폐기물의 분류 및 처분과 같은 후행 핵연료주기, 그리고 핵연료주기 전반에 대한 핵비확산성 및 환경성 문제를 다룬다."
                },
                {
                    "name": "수치해석기초",
                    "description": "많은 공학적 문제의 해결 과정에는 수학적으로 정확한 해를 구하거나 실험을 통해 현상을 파악하기가 불가능한 경우가 많이 있다. 이런 경우 컴퓨터를 이용하여 근사적으로 수치해를 구하거나, 시뮬레이션으로 모의실험을 수행한다. 수치해석이란 수치해를 구하는 데 사용할 적정한 방법을 설정하고 이를 프로그램화하고 실행하여 실제적인 해를 구하는 과정을 말한다. 이 과목은 공학자들이 다양한 용도로 수치해석을 수행하는 데 필요로 하는 기본적인 방법을 학습하고 실제 프로그래밍을 통해 이를 연습하여, 실제적인 공학적 문제 해결의 기반을 구축하게 함을 목적으로 한다. 이 과목은 공과대학의 수치해석 입문과목으로서 기본적이고 일반적인 수치해법만을 대상으로 하고, 보다 정교하고 진보된 원자로 전용 수치해석방법은 이 과목에 연속되는 원자로수치해석과 설계 과목에서 다룬다."
                },
                {
                    "name": "에너지물리화학",
                    "description": "에너지 발생 시스템의 제반 물리화학적 특성을 해석하기 위한 기초 교과목으로서, 주요 강의내용은 열역학 법칙, 화학물질의 특성과 물질의 상태 방정식, 화학반응의 평형조건, 통계물리 및 기체운동 이론, 전기화학 등을 다룬다. 이를 통하여 원자력 시스템에서 사용되는 여러 가지 핵재료의 물리화학적 특성과 물리화학적 해석에 필요한 지식의 토대를 구축한다."
                },
                {
                    "name": "열역학 및 원자력시스템",
                    "description": "핵분열 및 핵융합 반응으로 발생하는 열을 이용하여 전기를 생산하는 과정에는 냉각 및 동력변환을 위한 계통이 요구된다. 또한, 이들 발전소를 안전하게 유지하고 운전하기 위한 안전 및 보조 계통이 필요하다. 이에 발전소 개발, 설계 및 안전성 평가를 위해서는 에너지 시스템 내 계통에 대한 지식이 필수적이다. 본 교과목은 3, 4학년 학생을 대상으로 현재 가동 중인 원자력발전소, 개발 중인 미래형 원자로, 핵융합로의 주요 계통 및 작동 원리를 소개한다. 동력변환계통을 분석하기 위해 필수적인 열역학 기초를 다루며, 기본 이론을 바탕으로 원자로 계통 분석 방법을 심화한다."
                },
                {
                    "name": "원자력 부품 및 소재",
                    "description": "원자력 시스템을 이루는 다양한 부품들은 정해진 기준을 거쳐 성능이 검증된 재료로 구성되며, 이들의 신뢰성은 원자력 안전, 환경 친화성, 경제성 측면에서 매우 중요하다. 본 강의에서는 경수로 및 핵융합로를 포함한 첨단 원자로, 연료 사이클 시설 등의 원자력 시스템에 사용되는 구성 요소 및 재료의 선정과 유지에 대한 기본적인 지식을 학습한다. 첫째로, 금속, 세라믹 및 복합 재료 등의 다양한 재료의 특성 및 열화에 대한 기본 사항을 학습한다. 다음으로, 현세대의 경수로에 사용되는 부품 및 재료들을 자세히 분석한다. 그 후 경수로 이외의 첨단 시스템을 검토하며, 시스템 간의 유사성 및 차이점에 대해 논의한다. 마지막으로, 수강생들은 각각 특정 구성 요소를 선정하여 그 구성 요소에 사용되는 재료가 선정된 배경 및 개발 역사에 대하여 조사하고 발표한다. 본 과정을 통해 수강생은 (i) 각 구성 요소에 사용되는 재료의 선정이 어떻게 이루어졌으며, 재료의 성능이 어떻게 검증되는지 학습하며, (ii) 현세대 및 첨단 원자력 시스템에 사용되는 구성 요소 및 재료에 관련된 주요 연구개발 주제에 대하여 인식하게 된다."
                }
            ],
            "화학생물공학부": [
                {
                    "name": "화학생물공학기초실험",
                    "description": "화학생물공학의 실험연구상 필요한 물질 성질측정의 기초기술을 습득한다. 물리화학 1 및 2에서 다루는 이론을 기초로 하여 물리화학적 현상과 변화에 대한 이해를 돕는 실험방법 등을 익힌다. 열역학의 제법칙, 상변화, 평형 등에 관련된 물리화학적 양들의 측정 및 현상관찰의 기술을 익힌다."
                },
                {
                    "name": "화학생물공학기초실험",
                    "description": "화학생물공학의 실험연구상 필요한 물질 성질측정의 기초기술을 습득한다. 물리화학 1 및 2에서 다루는 이론을 기초로 하여 물리화학적 현상과 변화에 대한 이해를 돕는 실험방법 등을 익힌다. 열역학의 제법칙, 상변화, 평형 등에 관련된 물리화학적 양들의 측정 및 현상관찰의 기술을 익힌다."
                },
                {
                    "name": "화학생물공학기초실험",
                    "description": "화학생물공학의 실험연구상 필요한 물질 성질측정의 기초기술을 습득한다. 물리화학 1 및 2에서 다루는 이론을 기초로 하여 물리화학적 현상과 변화에 대한 이해를 돕는 실험방법 등을 익힌다. 열역학의 제법칙, 상변화, 평형 등에 관련된 물리화학적 양들의 측정 및 현상관찰의 기술을 익힌다."
                },
                {
                    "name": "화학생물공학기초실험",
                    "description": "화학생물공학의 실험연구상 필요한 물질 성질측정의 기초기술을 습득한다. 물리화학 1 및 2에서 다루는 이론을 기초로 하여 물리화학적 현상과 변화에 대한 이해를 돕는 실험방법 등을 익힌다. 열역학의 제법칙, 상변화, 평형 등에 관련된 물리화학적 양들의 측정 및 현상관찰의 기술을 익힌다."
                },
                {
                    "name": "화학생물공학기초실험",
                    "description": "화학생물공학의 실험연구상 필요한 물질 성질측정의 기초기술을 습득한다. 물리화학 1 및 2에서 다루는 이론을 기초로 하여 물리화학적 현상과 변화에 대한 이해를 돕는 실험방법 등을 익힌다. 열역학의 제법칙, 상변화, 평형 등에 관련된 물리화학적 양들의 측정 및 현상관찰의 기술을 익힌다."
                },
                {
                    "name": "화학생물공학기초실험",
                    "description": "화학생물공학의 실험연구상 필요한 물질 성질측정의 기초기술을 습득한다. 물리화학 1 및 2에서 다루는 이론을 기초로 하여 물리화학적 현상과 변화에 대한 이해를 돕는 실험방법 등을 익힌다. 열역학의 제법칙, 상변화, 평형 등에 관련된 물리화학적 양들의 측정 및 현상관찰의 기술을 익힌다."
                },
                {
                    "name": "화학생물합성실험",
                    "description": "본 교과목은 유기화학 강의와 병행하여 nitration, sulfonation, diazotization, coupling reaction, Friedel-Craft reaction, oxidation, reduction, halogenation, saponification 등 여러 단위 공정들에 의한 유기화합물들의 합성을 시도하며, 합성된 유기화합물들을 화학분석 및 기기분석방법을 이용하여 이들의 물성과 구조를 밝히도록 한다."
                },
                {
                    "name": "화학생물합성실험",
                    "description": "본 교과목은 유기화학 강의와 병행하여 nitration, sulfonation, diazotization, coupling reaction, Friedel-Craft reaction, oxidation, reduction, halogenation, saponification 등 여러 단위 공정들에 의한 유기화합물들의 합성을 시도하며, 합성된 유기화합물들을 화학분석 및 기기분석방법을 이용하여 이들의 물성과 구조를 밝히도록 한다."
                },
                {
                    "name": "화학생물합성실험",
                    "description": "본 교과목은 유기화학 강의와 병행하여 nitration, sulfonation, diazotization, coupling reaction, Friedel-Craft reaction, oxidation, reduction, halogenation, saponification 등 여러 단위 공정들에 의한 유기화합물들의 합성을 시도하며, 합성된 유기화합물들을 화학분석 및 기기분석방법을 이용하여 이들의 물성과 구조를 밝히도록 한다."
                },
                {
                    "name": "화학생물합성실험",
                    "description": "본 교과목은 유기화학 강의와 병행하여 nitration, sulfonation, diazotization, coupling reaction, Friedel-Craft reaction, oxidation, reduction, halogenation, saponification 등 여러 단위 공정들에 의한 유기화합물들의 합성을 시도하며, 합성된 유기화합물들을 화학분석 및 기기분석방법을 이용하여 이들의 물성과 구조를 밝히도록 한다."
                },
                {
                    "name": "화학생물합성실험",
                    "description": "본 교과목은 유기화학 강의와 병행하여 nitration, sulfonation, diazotization, coupling reaction, Friedel-Craft reaction, oxidation, reduction, halogenation, saponification 등 여러 단위 공정들에 의한 유기화합물들의 합성을 시도하며, 합성된 유기화합물들을 화학분석 및 기기분석방법을 이용하여 이들의 물성과 구조를 밝히도록 한다."
                },
                {
                    "name": "화학생물공정실험",
                    "description": "화학공학의 전공과목과 관련되는 기본적인 현상을 관찰하고 이해하며 정량적으로 해석할 수 있는 실험을 수행하고 보고서를 작성할 수 있도록 지도한다. 유체역학, 열전달, 물질전달, 반응공학, 중합반응, 공정제어 및 기기분석 계통의 실험을 통하여 실험 기법을 익히는 것은 물론, 강의를 통하여 습득한 전공분야의 지식을 포괄적으로 이해할 수 있도록 한다."
                },
                {
                    "name": "화학생물공정실험",
                    "description": "화학공학의 전공과목과 관련되는 기본적인 현상을 관찰하고 이해하며 정량적으로 해석할 수 있는 실험을 수행하고 보고서를 작성할 수 있도록 지도한다. 유체역학, 열전달, 물질전달, 반응공학, 중합반응, 공정제어 및 기기분석 계통의 실험을 통하여 실험 기법을 익히는 것은 물론, 강의를 통하여 습득한 전공분야의 지식을 포괄적으로 이해할 수 있도록 한다."
                },
                {
                    "name": "화학생물공정실험",
                    "description": "화학공학의 전공과목과 관련되는 기본적인 현상을 관찰하고 이해하며 정량적으로 해석할 수 있는 실험을 수행하고 보고서를 작성할 수 있도록 지도한다. 유체역학, 열전달, 물질전달, 반응공학, 중합반응, 공정제어 및 기기분석 계통의 실험을 통하여 실험 기법을 익히는 것은 물론, 강의를 통하여 습득한 전공분야의 지식을 포괄적으로 이해할 수 있도록 한다."
                },
                {
                    "name": "화학생물공정실험",
                    "description": "화학공학의 전공과목과 관련되는 기본적인 현상을 관찰하고 이해하며 정량적으로 해석할 수 있는 실험을 수행하고 보고서를 작성할 수 있도록 지도한다. 유체역학, 열전달, 물질전달, 반응공학, 중합반응, 공정제어 및 기기분석 계통의 실험을 통하여 실험 기법을 익히는 것은 물론, 강의를 통하여 습득한 전공분야의 지식을 포괄적으로 이해할 수 있도록 한다."
                },
                {
                    "name": "화학생물공학의 이해",
                    "description": "이 강의는 서울대학교 화학생물공학부 신입생을 대상으로, 화학생물공학의 기본 개념과 응용 분야를 소개한다. 본 과정을 통해 학생들은 화학공학과 생물공학의 교차점에 대해 학습하고, 최신 연구 동향과 기술 발전에 대해 이해할 수 있다. AI, 에너지, 신소재, 바이오, 반도체, 화학공정 등 다양한 분야에서 화학생물공학이 어떻게 적용되고 있는지 실례를 통해 탐구한다. 이 과정은 이론적 지식과 실용적 응용 사이의 균형을 맞추며, 학생들이 복잡한 공학 문제를 해결할 수 있는 기반을 마련한다. 또한, 학생들에게 지속 가능한 개발, 에너지 효율, 환경 보호 등 현대 사회가 직면한 중요한 이슈에 대한 이해를 심화시킨다."
                },
                {
                    "name": "열 및 물질전달",
                    "description": "본 교과목에서는 화학공정의 해석 및 설계에 필요한 열전달, 물질전달에 대한 기본 지식을 습득하게 한다. 전도와 열전도도, 대류 열전달, 비등과 응축, 복사 열전달, 증발, 열교환 장치를 살펴보고, 분자확산, 대류 물질전달에 대한 기본 개념을 열전달과 대비하여 확립시킨다."
                },
                {
                    "name": "열 및 물질전달",
                    "description": "본 교과목에서는 화학공정의 해석 및 설계에 필요한 열전달, 물질전달에 대한 기본 지식을 습득하게 한다. 전도와 열전도도, 대류 열전달, 비등과 응축, 복사 열전달, 증발, 열교환 장치를 살펴보고, 분자확산, 대류 물질전달에 대한 기본 개념을 열전달과 대비하여 확립시킨다."
                },
                {
                    "name": "유기화학 2",
                    "description": "유기화학의 기초지식과 기초분광법을 이용한 관능기들의 정성분석법 등을 강술한다. 첫째, UV, IR, NMR, mass spectrum을 이용한 유기화합물의 정성분석 기초이론. 둘째, 방향족화합물의 종류와 성질, 셋째, 방향족화합물과 친전자 치환반응, 넷째, 유기산의 제법과 성질. 셋째, 알데히드 및 케톤기를 갖는 화합물의 성질. 다섯째, 아민기를 갖는 화합물. 여섯째, 유기금속 화합물과 공업적 이용. 그 외 헤테로고리 화합물의 종류와 성질 등을 강의한다."
                },
                {
                    "name": "유기화학 2",
                    "description": "유기화학의 기초지식과 기초분광법을 이용한 관능기들의 정성분석법 등을 강술한다. 첫째, UV, IR, NMR, mass spectrum을 이용한 유기화합물의 정성분석 기초이론. 둘째, 방향족화합물의 종류와 성질, 셋째, 방향족화합물과 친전자 치환반응, 넷째, 유기산의 제법과 성질. 셋째, 알데히드 및 케톤기를 갖는 화합물의 성질. 다섯째, 아민기를 갖는 화합물. 여섯째, 유기금속 화합물과 공업적 이용. 그 외 헤테로고리 화합물의 종류와 성질 등을 강의한다."
                },
                {
                    "name": "응용생화학 1",
                    "description": "생명의 4대 기본 물질로서 단백질, 탄수화물, 핵산, 지질 등 생체고분자의 특성 및 구조-기능 관계를 이해하고, 이들 분자간 세포내외의 다양한 정보전달 및 상호작용에 따른 생명현상의 분자적 논리를 소개한다. 특히, 물질 대사를 통한 생체 에너지생산과 생체 고분자의 합성과정을 이해함으로써 생명의 기본원리를 환원적 시각으로 해석하고, 생리현상 및 활성물질의 응용 가능성을 타진한다."
                },
                {
                    "name": "응용생화학 1",
                    "description": "생명의 4대 기본 물질로서 단백질, 탄수화물, 핵산, 지질 등 생체고분자의 특성 및 구조-기능 관계를 이해하고, 이들 분자간 세포내외의 다양한 정보전달 및 상호작용에 따른 생명현상의 분자적 논리를 소개한다. 특히, 물질 대사를 통한 생체 에너지생산과 생체 고분자의 합성과정을 이해함으로써 생명의 기본원리를 환원적 시각으로 해석하고, 생리현상 및 활성물질의 응용 가능성을 타진한다."
                },
                {
                    "name": "화학생물공정실험",
                    "description": "화학공학의 전공과목과 관련되는 기본적인 현상을 관찰하고 이해하며 정량적으로 해석할 수 있는 실험을 수행하고 보고서를 작성할 수 있도록 지도한다. 유체역학, 열전달, 물질전달, 반응공학, 중합반응, 공정제어 및 기기분석 계통의 실험을 통하여 실험 기법을 익히는 것은 물론, 강의를 통하여 습득한 전공분야의 지식을 포괄적으로 이해할 수 있도록 한다."
                },
                {
                    "name": "화학생물공학개론",
                    "description": "본 과목은 화학생물공학부 이외의 학생을 대상으로 화학공학 및 생물공학 전반에 대한 소개를 목적으로 한다. 화학 및 생물을 바탕으로 한 공정공학을 이해하기 위해서 반응, 분리, 공정합성 등의 기본 개념을 공부한다. 또한 고분자 재료, 정보재료, 생물재료 등을 개발하는데 필요한 기본지식도 배우게 된다."
                },
                {
                    "name": "화학산업경영",
                    "description": "본 학부와 관련된 학계 및 산업계에 종사하는 외부인사를 초청하여 강연하게 함으로써 학계 및 산업계의 최근 동향을 파악하게 하고 학생들의 진로 결정에 도움을 주고자 한다."
                },
                {
                    "name": "화공전산응용",
                    "description": "화학공학 전공과목의 학습에 필요한 수학지식을 교육하는 동시에 해석적인 사고력의 함양을 강조하며 강의한다. 기본적인 화학공정의 수학적 모델화 기법, 상미분 방정식계의 처리와 응용, vector와 tensor의 해석, 공학자료의 처리와 해석법, 편미분 방정식의 해법, 선형대수, 수치해석 방법 등에 관하여 기본적인 수학지식과 그 응용을 다룬다."
                },
                {
                    "name": "화학생물공학을 위한 인공지능",
                    "description": "본 교과목은 기계학습과 딥러닝 기술의 학문적 기반을 바탕으로 화학생물공학 분야의 복잡한 문제 해결을 위한 기법을 익히기 위한 과목이다. 이 과목에서 지도 및 비지도 학습, 의사결정트리, 선형 회귀, 로지스틱 회귀, 신경망, 재료 개발, 열역학, 반응공학, 이동현상, 그리고 공정 최적화의 응용을 다룬다. 또한 최종 프로젝트를 통해 실제 문제를 해결하는 데 필요한 이러한 기술을 적용하는 것을 강조하며, 도메인 지식을 활용하여 효과적인 모델을 개발하는 방법을 학습할 수 있도록 유도할 예정이다. 수업의 선행 조건으로 화학생물공학의 기본적인 지식과 Python 프로그래밍 경험이 필요하며. 강의 내용을 바탕으로 학생들이 화학생물공학에서 빠르게 진화하는 인공지능 분야의 선도자가 될 수 있는 역량 강화에 목표를 둔다."
                },
                {
                    "name": "고분자화학",
                    "description": "합성 고분자를 중심으로 부가 및 축합에 관한 화학 및 물리적 고찰, 그리고 그 형태와 구조 등에 관하여 강의하며, 특히 용해 파라미터, 고분자 용액의 열역학에 관한 자유부피이론, gel permeation chromatography, polymer chains의 conformation, 고분자 용액의 상분리, 용해도에 따른 fractionation, 분자량과 크기의 측정방법, 주사전자현미경에 관한 논의, 고분자의 결정성에 관한 개념 등을 강조한다."
                },
                {
                    "name": "고분자화학",
                    "description": "합성 고분자를 중심으로 부가 및 축합에 관한 화학 및 물리적 고찰, 그리고 그 형태와 구조 등에 관하여 강의하며, 특히 용해 파라미터, 고분자 용액의 열역학에 관한 자유부피이론, gel permeation chromatography, polymer chains의 conformation, 고분자 용액의 상분리, 용해도에 따른 fractionation, 분자량과 크기의 측정방법, 주사전자현미경에 관한 논의, 고분자의 결정성에 관한 개념 등을 강조한다."
                },
                {
                    "name": "무기 및 재료화학",
                    "description": "Symmetry와 group theory에 의한 무기물의 화학결합을 시작으로 하여 전이금속화합물의 합성, 구조, 반응성 등의 강의로 이어진다. 또한 electronic spectra, NMR, IR, magnetism 등 무기화합물의 분석과 물성조사를 위한 실험방법을 다룬다. 균일계 촉매에 초점을 두어 유기금속화학을 강의하고, 기본적인 고체화학의 내용을 다룬다. 이 과목은 특히 무기재료, 촉매 등의 제조, 분석, 물성조사 등을 위한 기초지식을 습득시키는 것을 목적으로 한다."
                },
                {
                    "name": "물리화학 2",
                    "description": "분자의 운동, 반응 및 동적인 전기화학에 관한 제문제를 기초적인 이론으로부터 응용에 이르기까지 다방면에 걸쳐 연구한다. 여기에는 기본적인 기체운동론, 이온운반과 분자확산을 다루는 분자의 운동, 간단한 반응의 속도론과 더불어 광화학반응, 자체촉매반응, 진동반응, 연쇄반응 등이 관련되는 좀 더 복잡한 반응의 속도론, 고체 표면에서의 흡착, 촉매현상 및 과전위, 분극현상, 폴라로그래피, 전지, 부식 등을 취급하는 동적인 전기화학에 관련된 전반적인 내용이 포함된다."
                },
                {
                    "name": "물리화학 2",
                    "description": "분자의 운동, 반응 및 동적인 전기화학에 관한 제문제를 기초적인 이론으로부터 응용에 이르기까지 다방면에 걸쳐 연구한다. 여기에는 기본적인 기체운동론, 이온운반과 분자확산을 다루는 분자의 운동, 간단한 반응의 속도론과 더불어 광화학반응, 자체촉매반응, 진동반응, 연쇄반응 등이 관련되는 좀 더 복잡한 반응의 속도론, 고체 표면에서의 흡착, 촉매현상 및 과전위, 분극현상, 폴라로그래피, 전지, 부식 등을 취급하는 동적인 전기화학에 관련된 전반적인 내용이 포함된다."
                },
                {
                    "name": "반응공학 2",
                    "description": "실제 반응계에서 대두되는 여러가지 문제를 대상으로 하여 그 현상을 체계적으로 검토하고 적절한 모델을 설정하여 해석하는 방법을 강의하며 그 결과의 응용에 관하여 논의한다. 체류시간분포(RTD) 기법을 소개하고 이를 이용하여 비이상형 반응기를 해석하는 방법을 강의한 다음 비균질 반응계로서 기.고 반응계 액.액 및 기.액 반응계 그리고 3상반응계에 관한 문제를 취급한다. 또한 비균질 촉매반응 계에 대하여 다양한 현상을 소개하고 유효성 인자를 유도하여 그 응용을 논의하며 비등온 반응계의 이해와 해석 및 설계에 대하여 학습 한다."
                },
                {
                    "name": "분리공정",
                    "description": "본 교과목은 여러 가지 분리공정 중에서 특히 상과 상 사이에서 일어나는 분리공정을 다루게 된다. 따라서 이 과목을 이해하기 위해서는 열역학, 열 및 물질전달을 이수한 것을 전제로 하고 있다. 각 상간의 평형에 대한 개념을 이해시킨 다음 물질전달이 일어나는 원리와 물질전달 계수에 대하여 강의한다. 기체와 액체간, 액체와 액체간 및 기체와 고체간의 물질전달에 대한 개념을 강의하며 실제 분리공정으로서 기체흡수, 증류, 액체추출, 고체추출 및 건조에 대한 원리와 응용, 그리고 이들에 관계되는 장치의 기초설계방법과 장치의 내용에 대하여 강술한다."
                },
                {
                    "name": "분자생물공학",
                    "description": "미생물, 동물, 식물 등 제반 생물의 유전공학 또는 유전자 재조합 기술 전반에 관한 교육을 수행한다. mRNA 및 DNA의 분리정제, DNA sequencing, DNA 절단 및 ligation, short-gun cloning, cDNA cloning, plasmid 및 cosmid, microinjection 및 세포핵 치환, 세포 융합, hybridoma에 의한 단일체 생산, protein engineering, virus 및 transposable elements, gene expression 및 regulation, DNA replication, transcription, translatioin, 그리고 생산적 응용 등에 관하여 교육한다."
                },
                {
                    "name": "세포생물공학",
                    "description": "세포는 생명체를 구성하고 있는 기본 단위이다. 본 과목에서는 세포의 성분, 구조, 기능, 기작 등의 기본지식에 대하여 강의한다. 세포생물학적 지식에 기반 하여 세포배양, 줄기세포 연구, 암 연구, 조직공학 등에 활용되는 기술에 대하여 강의하고, 또한 세포의 의학적, 산업적 활용분야에 대하여 강의한다."
                },
                {
                    "name": "창의연구",
                    "description": "대학교육 특히 공학교육에 있어서 중요한 목표의 하나인 창의성개발을 목표로 연구과제의 도출, 관련 문헌의 조사 및 분석, 연구수행 그리고 연구결과의 발표 등 제과정을 통하여 창의성을 개발하고 우수한 연구결과를 창출하도록 교육한다."
                },
                {
                    "name": "창의연구",
                    "description": "대학교육 특히 공학교육에 있어서 중요한 목표의 하나인 창의성개발을 목표로 연구과제의 도출, 관련 문헌의 조사 및 분석, 연구수행 그리고 연구결과의 발표 등 제과정을 통하여 창의성을 개발하고 우수한 연구결과를 창출하도록 교육한다."
                }
            ],
            "조선해양공학과": [
                {
                    "name": "해양열역학",
                    "description": "열역학은 에너지를 일과 열의 형태로 이용하는 모든 기계설비(터빈, 펌프, 열교환기, 엔진 등) 와 상(phase) 분리설비(Separator) 설계의 기초가 된다. 에너지, 일, 열의 관계를 계산하는 법, 이상적인 열기관 및 실제로 얻을 수 있는 에너지의 양을 계산하는 법, 물질의 물성을 정량적으로 계산하고 상평형 상태에서 기체, 액체에 존재하는 물질의 양과 조성을 계산하는 법을 배운다. 또한 해양 플랫폼 및 선박에 탑재되고 있는 열역학 기반 시스템의 원리를 습득한다."
                },
                {
                    "name": "유체역학기초",
                    "description": "유체 정역학 기본방정식, 압력변화, 유압장치, 정수력, 부력, 검사체적 적분형 방정식, 유체운동의 미분해석, 비압축성 비점성 유동(오일러 방정식, 베르누이 방정식, 에너지보존법칙)을 익히고 이후 차원해석과 상사성, 내부 비압축성 점성유동(덕트 유동, 수두손실), 외부 비압축성 점성유동(경계층, 물체주위 점성유동)을 익힌다."
                },
                {
                    "name": "조선해양공학의 이해",
                    "description": "한국 조선해양 산업의 현재, 조선해양관련 전후방 산업, 해운/항로/해상 물동량, 상선의 개요 및 종류, 해양구조물의 개요 및 종류, 주요 해운사, 오일 메이저와 국제 유가, 선박의 설계와 생산에 대해 학습하고 선박 주요 치수, 선박저항과 추진, 복원성, 선박운동과 조종, 선체구조, 일반배치, 특수성, 함정, 요트, 여객선, 크루저, 스마트 선박, 스마트 조선소를 학습한 후 현장 견학을 한다."
                },
                {
                    "name": "조선해양프로젝트",
                    "description": "본 교과목은 학부 전공 교과목에서 학습한 이론들을 종합적으로 활용해 선박 및 해양구조물의 기본 설계를 직접 해 보는 프로젝트 교과목으로서 이론과 실습으로 구성되어 있다. 먼저, 선박 및 해양구조물의 기본 설계를 위한 유체, 구조, 해양 (공정) 및 설계 관련 핵심 이론들을 요약하여 강의하고, 주어진 요구 조건에 대해 학생들은 팀을 이루어 프로젝트를 수행한다. 전체적으로 최종 결과물은 설계 안을 포함한 보고서이며, 경우에 따라 설계 안에 대한 모형의 제작을 포함할 수 있다. 본 강의를 통해 학생들은 선박 및 해양구조물을 직접 설계해 보는 능력을 갖추게 되며 이와 동시에 팀 프로젝트 수행을 통한 협업 방법을 익히도록 한다."
                },
                {
                    "name": "해양파역학",
                    "description": "해양에서의 환경하중 및 관련 공학적 문제를 소개하고, 해양파와 관련된 기초적인 이론과 관련 문제들에 대한 해석기법을 습득한다. 해상에서의 규칙파와 불규칙파를 비롯한 선박 주위 정상 파형 등에 대한 기본이론을 익히며, 선박과 해양구조물의 설계를 위하여 해양파를 포함하는 해양환경 하중을 추정하는 기법에 대해 학습한다."
                },
                {
                    "name": "기초유한요소이론",
                    "description": "일반적인 구조문제를 풀 수 있는 방법인 유한요소법의 기초가 되는 탄성론, 변분법(Variational Principle), 빔/플레이트 (Beam/Plate)의 정식화, 간단한 요소에 대한 유한요소해석법 등을 공부한다. 이는 대학원에서 심도있게 학습할 유한요소법, 비선형 유한요소법, 설계민감도해석(Design Sensitivity Analysis) 등의 선수과목(Prerequisite)으로 중요하며 또한 산업체에서 광범하게 사용하는 상업 코드(MSC/NASTRAN, ABAQUS, ANSYS 등) 의 이론적 배경의 이해로 적합하다."
                },
                {
                    "name": "선박해양설계이론",
                    "description": "본 강의에서는 선박 및 해양구조물 (선체)의 기본 설계를 위한 기초이론을 여러 단계로 나누어 학습한다. 먼저, 주요 치수 결정 단계에서는 선주 요구 조건, 각종 설계 제약 조건, 주요 치수 결정을 위한 설계 모델, 경하 중량 추정 방법, 화물창 용적 추정 방법, 건현 계산 방법 등을 학습한다. 이후 주기관 및 프로펠러 결정 단계에서는 저항 및 마력 추정 방법, 주기관 선정 방법, 프로펠러의 주요 치수 결정 방법 등을 학습한다. 선형 설계 단계에서는 선형의 생성, 변환 및 수정 방법과 선형의 성능 평가 방법을 배운다. 일반 배치 설계 단계에서는 관련 규정 및 배치 설계 방법을 익힌 뒤 선박 계산 방법을 학습한다. 구조 설계 단계에서는 관련 규정, 종강도 평가 방법, 구조 부재의 치수 계산 방법 등을 배우고, 의장 설계 단계에서는 선체 의장, 기관 의장, 선실 의장, 전기 의장으로 나누어 설계 방법을 간략히 학습한다. 본 강의는 선박 및 해양구조물의 기본 설계를 위한 핵심 이론을 다루고 있으며, 최종적으로는 선박 및 해양구조물의 기본 설계를 직접 해 볼 수 있는 기초 능력을 배양하는 것을 목적으로 한다."
                },
                {
                    "name": "선박해양구조역학",
                    "description": "본 과목에서는 다음의 세 가지 주요 내용을 학습한다. 먼저 일반 상선의 전반적인 구조 특성과, 구성하는 다양한 구조 부재의 명칭과 역할에 대해 학습한다. 그 이해를 바탕으로 재료역학에서 학습한 보이론, 비틀림 , 기둥의 좌굴 등을 선체 구조 평가에 어떻게 적용하는지를 학습한다. 두 번째로 선박해양 구조물에 특화된 주요 이론들에 대해 학습한다. 판이론을 바탕으로 판의 좌굴강도와, 사고한계상태 해석에 기초가 되는 보와 판의 소성강도에 대해 학습한다. 세 번째로 판의 접합 방법 및 용접 강도를 배우며, 용접부의 피로강도 및 반복적인 환경하중으로 인한 선박의 피로손상도 계산법 등에 대해서 학습한다."
                },
                {
                    "name": "선박해양운동조종론",
                    "description": "선박과 해양구조물의 파랑 중 운동의 기본 이론과 관련 공학적 문제들을 습득한다. 또한, 선박의 기본적 조종이론과 실험기법, 그리고 국제적으로 요구되는 조종성능에 대해 학습한다. 그리고 선박해양공학에서 사용되는 제어기법에 대한 기본적 이론과 사례들을 소개한다."
                },
                {
                    "name": "신호처리",
                    "description": "조선해양공학 실험과 각종 해양․음향정보 처리에 사용되는 디지털 신호에 대한 기초적인 이론을 공부하여 이를 바탕으로 실험데이터의 컴퓨터 신호처리와 수중음향신호처리의 실제적인 응용을 다룬다. 추가적으로 본 수업은 MATLAB을 사용한 숙제를 함으로서 자연적으로 MATLAB을 실습하고 익히는 기회로 삼는다."
                },
                {
                    "name": "조선해양 학사논문연구 2",
                    "description": "본 과목은 조선해양 학사논문연구 1에 이어서, 조선해양공학 문제와 관련하여 교수진의 지도 하에 이뤄지는 두번째 개별 연구 프로젝트이다. 수행하는 연구는 수학적 분석, 실험, 컴퓨터 시뮬레이션, 하드웨어 및 소프트웨어 개발, 장치 제작 중 하나에 해당할 수 있다. 본 과목에서 배운 지식을 통해 학부논문 도출, 국내/외 저널 및 학술대회 발표를 목표한다."
                },
                {
                    "name": "조선해양 학사논문연구 1",
                    "description": "본 과목은 조선해양공학 문제와 관련하여 교수진의 지도 하에 이뤄지는 첫번째 개별 연구 프로젝트이다. 수행하는 연구는 수학적 분석, 실험, 컴퓨터 시뮬레이션, 하드웨어 및 소프트웨어 개발, 장치 제작 중 하나에 해당할 수 있다. 또한, 연구실탐방을 통한 연구경험 보고서 및 조선해양 학사논문연구 2의 근간이 되는 연구제안서 제출이 요구된다. 본 과목을 통해 논문작성 기초지식을 습득한다."
                },
                {
                    "name": "조선해양기계학습",
                    "description": "본 강의에서는 통계적 추론에 기반한 기계학습의 기초에 대하여 학습하고 조선해양공학의 응용문제에 대한 프로젝트를 수행한다. 기계학습에 관련된 확률, 선형대수, 최적화의 기초에 대하여 학습한다. 확률에 기반한 최우추정법에 대하여 학습한다. 비지도 학습 분류 방법 및 선형 회귀법에 대하여 학습한다. Hidden Markov 모델과 Bayesian Inference의 개념, 이론 및 알고리즘에 대한 개요를 학습한다. Neural Network에 기반한 학습모델로 이미지 인식을 위한 Convolutional Neural Network, 음성과 같은 time series 데이터의 학습을 위한 Recurrent Neural Network의 개요에 대하여 학습한다. 그리고 보상에 따라 학습하는 Reinforcement Learning에 대하여 익힌다. 마지막으로 조선해양공학 응용의 기계학습 프로젝트를 수행하도록 한다."
                }
            ],
            "재료공학부": [
                {
                    "name": "현대재료물리화학",
                    "description": "온도, 압력, 체적 등 외부의 거시적 양에 따른 물질의 화학적 물리적 변화의 속도를 다루는 화학반응 속도론을 공부한다. 열역학으로 기술되는 거시적 물성을 원자/분자 수준의 특성에서 설명하는 통계열역학의 개념을 다룰 것이다. 더불어, 화학 반응 속도론을 거시적이고 현상적인 수준부터 분자/원자/전자 수준의 움직임까지 포괄적으로 배울 것이다."
                },
                {
                    "name": "현대재료물리화학",
                    "description": "온도, 압력, 체적 등 외부의 거시적 양에 따른 물질의 화학적 물리적 변화의 속도를 다루는 화학반응 속도론을 공부한다. 열역학으로 기술되는 거시적 물성을 원자/분자 수준의 특성에서 설명하는 통계열역학의 개념을 다룰 것이다. 더불어, 화학 반응 속도론을 거시적이고 현상적인 수준부터 분자/원자/전자 수준의 움직임까지 포괄적으로 배울 것이다."
                },
                {
                    "name": "결정학개론",
                    "description": "대부분의 재료는 결정질로 이루어져 있으며, 재료를 구성하는 화합물의 구조는 원자, 이온, 또는 분자의 배열상태로써 설명한다. 재료 내의 구성원소의 배열상태인 결정구조와 결정이 갖는 물성의 방향성은 결정의 대칭으로 설명한다. 결정격자와 기초적인 결정구조를 이해하고 결정기하에서 결정축계, 대칭요소와 대칭조작, 32 결정점군, 17 평면군, 230 공간군을 결정물리에서 초전성, 강유전성, 압전성, 탄성 등의 물성과 결정이 갖는 대칭과의 관계를 설명한다. 결정구조 해석의 기초적인 지식을 위하여 회절물리와 회절기하를 설명하고, X-선 회절의 기초를 다룬다."
                },
                {
                    "name": "결정학개론",
                    "description": "대부분의 재료는 결정질로 이루어져 있으며, 재료를 구성하는 화합물의 구조는 원자, 이온, 또는 분자의 배열상태로써 설명한다. 재료 내의 구성원소의 배열상태인 결정구조와 결정이 갖는 물성의 방향성은 결정의 대칭으로 설명한다. 결정격자와 기초적인 결정구조를 이해하고 결정기하에서 결정축계, 대칭요소와 대칭조작, 32 결정점군, 17 평면군, 230 공간군을 결정물리에서 초전성, 강유전성, 압전성, 탄성 등의 물성과 결정이 갖는 대칭과의 관계를 설명한다. 결정구조 해석의 기초적인 지식을 위하여 회절물리와 회절기하를 설명하고, X-선 회절의 기초를 다룬다."
                },
                {
                    "name": "결정학개론",
                    "description": "대부분의 재료는 결정질로 이루어져 있으며, 재료를 구성하는 화합물의 구조는 원자, 이온, 또는 분자의 배열상태로써 설명한다. 재료 내의 구성원소의 배열상태인 결정구조와 결정이 갖는 물성의 방향성은 결정의 대칭으로 설명한다. 결정격자와 기초적인 결정구조를 이해하고 결정기하에서 결정축계, 대칭요소와 대칭조작, 32 결정점군, 17 평면군, 230 공간군을 결정물리에서 초전성, 강유전성, 압전성, 탄성 등의 물성과 결정이 갖는 대칭과의 관계를 설명한다. 결정구조 해석의 기초적인 지식을 위하여 회절물리와 회절기하를 설명하고, X-선 회절의 기초를 다룬다."
                },
                {
                    "name": "결정학개론",
                    "description": "대부분의 재료는 결정질로 이루어져 있으며, 재료를 구성하는 화합물의 구조는 원자, 이온, 또는 분자의 배열상태로써 설명한다. 재료 내의 구성원소의 배열상태인 결정구조와 결정이 갖는 물성의 방향성은 결정의 대칭으로 설명한다. 결정격자와 기초적인 결정구조를 이해하고 결정기하에서 결정축계, 대칭요소와 대칭조작, 32 결정점군, 17 평면군, 230 공간군을 결정물리에서 초전성, 강유전성, 압전성, 탄성 등의 물성과 결정이 갖는 대칭과의 관계를 설명한다. 결정구조 해석의 기초적인 지식을 위하여 회절물리와 회절기하를 설명하고, X-선 회절의 기초를 다룬다."
                },
                {
                    "name": "결정학개론",
                    "description": "대부분의 재료는 결정질로 이루어져 있으며, 재료를 구성하는 화합물의 구조는 원자, 이온, 또는 분자의 배열상태로써 설명한다. 재료 내의 구성원소의 배열상태인 결정구조와 결정이 갖는 물성의 방향성은 결정의 대칭으로 설명한다. 결정격자와 기초적인 결정구조를 이해하고 결정기하에서 결정축계, 대칭요소와 대칭조작, 32 결정점군, 17 평면군, 230 공간군을 결정물리에서 초전성, 강유전성, 압전성, 탄성 등의 물성과 결정이 갖는 대칭과의 관계를 설명한다. 결정구조 해석의 기초적인 지식을 위하여 회절물리와 회절기하를 설명하고, X-선 회절의 기초를 다룬다."
                },
                {
                    "name": "결정학개론",
                    "description": "대부분의 재료는 결정질로 이루어져 있으며, 재료를 구성하는 화합물의 구조는 원자, 이온, 또는 분자의 배열상태로써 설명한다. 재료 내의 구성원소의 배열상태인 결정구조와 결정이 갖는 물성의 방향성은 결정의 대칭으로 설명한다. 결정격자와 기초적인 결정구조를 이해하고 결정기하에서 결정축계, 대칭요소와 대칭조작, 32 결정점군, 17 평면군, 230 공간군을 결정물리에서 초전성, 강유전성, 압전성, 탄성 등의 물성과 결정이 갖는 대칭과의 관계를 설명한다. 결정구조 해석의 기초적인 지식을 위하여 회절물리와 회절기하를 설명하고, X-선 회절의 기초를 다룬다."
                },
                {
                    "name": "재료실험 1",
                    "description": "재료공학 연구에 기본적으로 필요한 실험 지식을 습득하는 한편 상변태, 열역학, X-선 결정학 등의 교과목에서 배운 재료의 성질을 실험을 통하여 다시 배울 수 있도록 한다."
                },
                {
                    "name": "재료상변태",
                    "description": "상평형 및 재료의 상변태에 관한 개요를 다루되 특히 고체에서의 상변태의 열역학 및 속도론의 기초원리를 간결하게 설명한다. 이를 위하여 속도론적 과정을 이해하는데 필요한 개념 및 핵생성과 생성상의 성장에 관한 이론을 다룬다."
                },
                {
                    "name": "재료상변태",
                    "description": "상평형 및 재료의 상변태에 관한 개요를 다루되 특히 고체에서의 상변태의 열역학 및 속도론의 기초원리를 간결하게 설명한다. 이를 위하여 속도론적 과정을 이해하는데 필요한 개념 및 핵생성과 생성상의 성장에 관한 이론을 다룬다."
                },
                {
                    "name": "재료상변태",
                    "description": "상평형 및 재료의 상변태에 관한 개요를 다루되 특히 고체에서의 상변태의 열역학 및 속도론의 기초원리를 간결하게 설명한다. 이를 위하여 속도론적 과정을 이해하는데 필요한 개념 및 핵생성과 생성상의 성장에 관한 이론을 다룬다."
                },
                {
                    "name": "재료공학원리",
                    "description": "원자구조, 결정구조, 상평형, 공정 등에 관한 재료공학의 기초지식과 이를 바탕으로 금속, 고분자, 세라믹 등 각 재료의 구조와 특성을 공부함과 동시에 최신재료와 미래의 재료를 공부하고, 각 재료별로 주어진 설계 과제를 팀 별로 수행한다."
                },
                {
                    "name": "재료공학원리",
                    "description": "원자구조, 결정구조, 상평형, 공정 등에 관한 재료공학의 기초지식과 이를 바탕으로 금속, 고분자, 세라믹 등 각 재료의 구조와 특성을 공부함과 동시에 최신재료와 미래의 재료를 공부하고, 각 재료별로 주어진 설계 과제를 팀 별로 수행한다."
                },
                {
                    "name": "재료공학원리",
                    "description": "원자구조, 결정구조, 상평형, 공정 등에 관한 재료공학의 기초지식과 이를 바탕으로 금속, 고분자, 세라믹 등 각 재료의 구조와 특성을 공부함과 동시에 최신재료와 미래의 재료를 공부하고, 각 재료별로 주어진 설계 과제를 팀 별로 수행한다."
                },
                {
                    "name": "재료실험 1",
                    "description": "재료공학 연구에 기본적으로 필요한 실험 지식을 습득하는 한편 상변태, 열역학, X-선 결정학 등의 교과목에서 배운 재료의 성질을 실험을 통하여 다시 배울 수 있도록 한다."
                },
                {
                    "name": "재료실험 2",
                    "description": "이 실험에서는 1) 전공필수 “재료의 전자기적 성질”관련 실습으로서 재료의 전기적 자기적 특성을 직접 느끼고 정량화하는 방법을 체득케하고, 2) 전공필수 “결정구조학” 관련 실습으로서 X-선 회절을 응용하는 능력을 배양하며, 3) 흙붙이 재료의 제조 공정 (특히 분말공정) 및 소성체의 특성을 분석하는 법을 익히게 함."
                },
                {
                    "name": "재료실험 2",
                    "description": "이 실험에서는 1) 전공필수 “재료의 전자기적 성질”관련 실습으로서 재료의 전기적 자기적 특성을 직접 느끼고 정량화하는 방법을 체득케하고, 2) 전공필수 “결정구조학” 관련 실습으로서 X-선 회절을 응용하는 능력을 배양하며, 3) 흙붙이 재료의 제조 공정 (특히 분말공정) 및 소성체의 특성을 분석하는 법을 익히게 함."
                },
                {
                    "name": "재료실험 1",
                    "description": "재료공학 연구에 기본적으로 필요한 실험 지식을 습득하는 한편 상변태, 열역학, X-선 결정학 등의 교과목에서 배운 재료의 성질을 실험을 통하여 다시 배울 수 있도록 한다."
                },
                {
                    "name": "재료종합실험",
                    "description": "학사 과정에서 학습한 재료공학의 지식을 적용하여, 학생들이 스스로 실험을 계획하고 이를 수행한다. 교과목을 통하여 재료공학의 지식을 종합하여 실험을 계획하는 과정을 학습하며, 계획된 실험의 수행을 통하여 실험 능력과 재료공학 문제의 해결 능력을 향상한다."
                },
                {
                    "name": "재료종합설계",
                    "description": "본 과목에서는 재료공학과 관련된 종합설계의 개념을 소개하고, 프로젝트의 수행을 통해서 학생들에게 종합설계능력을 부여하는 것을 목적으로 한다. 수업은 강의와 프로젝트 수행으로 구성되며, 학생은 프로젝트의 수행을 통해 학부에서 배운 재료공학 및 학제적 지식을 현실적 문제해결을 위해 적용할 뿐만 아니라, 제안서 작성, 경영 및 생산성 개념, 과제 일정관리, 협동심, 창의성, 발표력 및 의사소통 능력, 공학적 윤리관 등을 포괄적으로 함양하게 될 것이다."
                },
                {
                    "name": "재료종합설계",
                    "description": "본 과목에서는 재료공학과 관련된 종합설계의 개념을 소개하고, 프로젝트의 수행을 통해서 학생들에게 종합설계능력을 부여하는 것을 목적으로 한다. 수업은 강의와 프로젝트 수행으로 구성되며, 학생은 프로젝트의 수행을 통해 학부에서 배운 재료공학 및 학제적 지식을 현실적 문제해결을 위해 적용할 뿐만 아니라, 제안서 작성, 경영 및 생산성 개념, 과제 일정관리, 협동심, 창의성, 발표력 및 의사소통 능력, 공학적 윤리관 등을 포괄적으로 함양하게 될 것이다."
                },
                {
                    "name": "재료종합설계",
                    "description": "본 과목에서는 재료공학과 관련된 종합설계의 개념을 소개하고, 프로젝트의 수행을 통해서 학생들에게 종합설계능력을 부여하는 것을 목적으로 한다. 수업은 강의와 프로젝트 수행으로 구성되며, 학생은 프로젝트의 수행을 통해 학부에서 배운 재료공학 및 학제적 지식을 현실적 문제해결을 위해 적용할 뿐만 아니라, 제안서 작성, 경영 및 생산성 개념, 과제 일정관리, 협동심, 창의성, 발표력 및 의사소통 능력, 공학적 윤리관 등을 포괄적으로 함양하게 될 것이다."
                },
                {
                    "name": "재료의 전자기적 성질",
                    "description": "이 과목은 재료학부생에게 고전적인, 또는, 양자역학적인 관점에서 정성적으로 재료의 전기적, 자기적, 광학적, 그리고, 열적 성질을 재료를 구성하고 있는 전자와 원자의 관점에서 이해할 수 있도록 하는데 목적이 있다."
                },
                {
                    "name": "재료의 전자기적 성질",
                    "description": "이 과목은 재료학부생에게 고전적인, 또는, 양자역학적인 관점에서 정성적으로 재료의 전기적, 자기적, 광학적, 그리고, 열적 성질을 재료를 구성하고 있는 전자와 원자의 관점에서 이해할 수 있도록 하는데 목적이 있다."
                },
                {
                    "name": "재료의 전자기적 성질",
                    "description": "이 과목은 재료학부생에게 고전적인, 또는, 양자역학적인 관점에서 정성적으로 재료의 전기적, 자기적, 광학적, 그리고, 열적 성질을 재료를 구성하고 있는 전자와 원자의 관점에서 이해할 수 있도록 하는데 목적이 있다."
                },
                {
                    "name": "재료종합실험",
                    "description": "학사 과정에서 학습한 재료공학의 지식을 적용하여, 학생들이 스스로 실험을 계획하고 이를 수행한다. 교과목을 통하여 재료공학의 지식을 종합하여 실험을 계획하는 과정을 학습하며, 계획된 실험의 수행을 통하여 실험 능력과 재료공학 문제의 해결 능력을 향상한다."
                },
                {
                    "name": "재료종합실험",
                    "description": "학사 과정에서 학습한 재료공학의 지식을 적용하여, 학생들이 스스로 실험을 계획하고 이를 수행한다. 교과목을 통하여 재료공학의 지식을 종합하여 실험을 계획하는 과정을 학습하며, 계획된 실험의 수행을 통하여 실험 능력과 재료공학 문제의 해결 능력을 향상한다."
                },
                {
                    "name": "재료현대물리",
                    "description": "재료를 전공하는 학생들에게 양자역학, 원자구조, 분자구조, 고체구조 등을 이해하기 위한 기초적 개념을 제공한다."
                },
                {
                    "name": "재료현대물리",
                    "description": "재료를 전공하는 학생들에게 양자역학, 원자구조, 분자구조, 고체구조 등을 이해하기 위한 기초적 개념을 제공한다."
                },
                {
                    "name": "고분자재료물리",
                    "description": "이 과목은 고분자 유기재료의 구조-성형조건-물성의 상관성을 체계적으로 이해할 수 있는 기본개념과 이론을 강의한다. 고분자사슬의 configuration and conformation, 분자량 및 분자량분포, 고분자 용액 및 용융체의 상태와 상분리거동, 무정형 나노집합구조, 결정형 나노집합구조 및 결정화 동력학, 액정구조와 성질, 배향구조, 고분자의 점탄성, 역학적, 전자기적, 광학적 및 기타 물리적 성질 등에 관한 내용이 제공될 것이다."
                },
                {
                    "name": "물리야금학",
                    "description": "금속 재료들은 재료의 화학조성이나 제조공정 등에 따라 상당히 다른 기계적 특성을 보이게 된다. 이 과목에서는 합금들이 어떻게 다른 특성들을 갖게 되는 지를 이해하고 또 우리가 원하는 특성의 합금을 어떻게 설계할 수 있는가에 대한 재료공학적 기초를 제공하고자 한다. 재료의 결정구조 및 결함 등 결정학적 구조를 이해하도록 하며 재료공정에 따른 재료의 미세조직 형성 과정을 원자의 확산과 재료의 상변태 등에 기초하여 강의한다. 재료의 강화기구들을 대표적 합금을 예로 들어 설명함으로써 재료의 미세조직과 기계적 특성과의 상호 관계에 대한 이해를 높이도록 한다."
                },
                {
                    "name": "반도체집적공정",
                    "description": "반도체를 제조하는 공정을 중심으로, 집적기술에 관련된 기초지식 습득 및 최근기법 등을 이해할 수 있도록 한다."
                },
                {
                    "name": "에너지재료 및 소자",
                    "description": "전기화학, 촉매, 발광 특성을 가지는 나노 기술을 이용한, 에너지 대한 기초 지식과 응용 원리 확립 이 과목은 재료공학을 전공하는 4학년 학부생 중 에너지 관련 소재/소자/장치에 관심을 가지는 학부생을 대상으로 한 과목이다. 재료의 기본 특성인 전자 또는 이온의 거동이 특정한 조건에서 어떤 거동을 하는 지에 대하여 열역학적, 속도론적인 관점에서 살펴보고 전자 또는 이온의 거동에 의해 재료가 가지게 되는 전기화학적, 발광 특성을 이해하도록 review 한다. 이러한 기초 지식을 기반으로, 전기화학적, 발광 특성을 응용한 분야인 이차전지, 태양전지, 연료전지, 백색 발광소자의 기초적인 소재 및 소자/장치 해석에 대해 구체적으로 학습하여, 학부생들이 기존 재료의 성능향상 및 차세대 에너지 재료 및 디바이스에 대한 취업/연구 시 도움을 주도록 한다."
                },
                {
                    "name": "재료결정결함",
                    "description": "본 교과목에서는 서로 다른 결정구조를 가진 재료에서의 점 결함, 전위 및 평면 결함 등의 생성 및 소멸 과정과 제반 특징에 관하여 조사하고 이들이 재료의 물리적, 기계적 특성에 미치는 영향에 대하여 강의한다."
                },
                {
                    "name": "재료공학개론",
                    "description": "우리가 현재 누리고 있는 현대 문명은 기계, 우주항공, 조선, 에너지 등의 중화학공업과 반도체, 컴퓨터, 정보통신과 같은 전자공업의 눈부신 발전의 덕택이다. 그러나 이와 같은 진보적 발전은 기존 재료의 품질 개선과 새로운 재료의 개발, 응용과 같은 재료산업의 도움이 없이는 불가능하였다고 해도 과언이 아니다. 그리고 현대산업의 발전에 이와 같은 핵심적 역할을 수행하고 있는 재료의 중요성과 그 수요는 산업이 발달될수록 더욱 증대될 것으로 예상되고 있다. 따라서 재료과학개론에서는 현대산업의 근간이 되고 있는 재료의 특성 이해, 제조 방법에 관해 수학적인 방법보다 서술적인 방법을 통하여 학습하고자 한다. 그리고 재료의 화학적, 기계적, 열적, 광학적, 전기적 특성에 미치는 요인들을 살펴보고, 이를 통하여 기본 물리적 원리와 재료 물성의 관계를 파악하고자 한다."
                },
                {
                    "name": "전기회로",
                    "description": "반도체 산업체에 종사하는 재료공학분야의 기술자들이 전자회로의 동작원리를 잘 이해하면 전기공학분야의 기술자와 협동이 잘 이루어짐으로서, 반도체 분야의 연구, 개발, 생산에 더 많은 기여를 할 것으로 기대되어, 본 과목에서는 반도체 소자의 기본 동작 원리와 이들이 전자회로에서 하는 역할과 정보처리를 위한 간단한 전자회로의 기초를 강의한다."
                },
                {
                    "name": "최신반도체 재료 및 소자",
                    "description": "최신 메모리와 로직 반도체소자 및 재료에 대한 기본 지식 제공을 목적으로 한다. 이를 위하여 최근의 반도체 기술 현황 및 전개 방향을 점검하고 소자의 집적화에 따른 제반 문제점들을 공부한다. DRAM 과 같은 대표적 메모리 소자의 동작 원리와 집적화에 관한 일반적인 원리들을 공부함으로써 메모리 소자에 관한 근본적 이해를 도모한다. 이와 더불어 NAND 또는 NOR type의 Flash memory 의 동작 원리 및 scaling 에 관련된 문제들을 공부 한다. 또한 FeRAM, MRAM, PcRAM 또는 새로운 저항 변화 현상을 이용하는 새로운 메모리 소자의 등장에 따라 이들에 대한 새로운 지식을 제공하고 이들 소자의 궁극적 한계를 생각해본다. 궁극적으로 반도체 또는 고체 전자 소자가 직면 하게 될 스케일링의 한계를 설명하고 이를 극복하기 위한 새로운 Nanoelectronics의 개념과 전개 방향을 설명한다."
                },
                {
                    "name": "최신반도체 재료 및 소자",
                    "description": "최신 메모리와 로직 반도체소자 및 재료에 대한 기본 지식 제공을 목적으로 한다. 이를 위하여 최근의 반도체 기술 현황 및 전개 방향을 점검하고 소자의 집적화에 따른 제반 문제점들을 공부한다. DRAM 과 같은 대표적 메모리 소자의 동작 원리와 집적화에 관한 일반적인 원리들을 공부함으로써 메모리 소자에 관한 근본적 이해를 도모한다. 이와 더불어 NAND 또는 NOR type의 Flash memory 의 동작 원리 및 scaling 에 관련된 문제들을 공부 한다. 또한 FeRAM, MRAM, PcRAM 또는 새로운 저항 변화 현상을 이용하는 새로운 메모리 소자의 등장에 따라 이들에 대한 새로운 지식을 제공하고 이들 소자의 궁극적 한계를 생각해본다. 궁극적으로 반도체 또는 고체 전자 소자가 직면 하게 될 스케일링의 한계를 설명하고 이를 극복하기 위한 새로운 Nanoelectronics의 개념과 전개 방향을 설명한다."
                }
            ],
            "항공우주공학과": [
                {
                    "name": "항공기구조역학",
                    "description": "항공기의 예비 및 초기 설계 시에 활용할 수 있도록 복잡한 구조물을 단순화하여 비행체 구조물의 전체적인 하중경로 및 대략적인 응력분포를 계산하는데 필요한 방법들을 구조역학적 관점에서 배우게 된다. 실제의 정밀한 국부해석은 컴퓨터 수치해석기법을 통해 수행하게 되므로 이 교과목에서는 수강생들에게 물리적, 역학적인 감각을 키워주는데 주력하면서 간단한 수계산을 곁들인 해석적인 방법을 통해 실제 문제들을 다루게 된다."
                },
                {
                    "name": "항공역학",
                    "description": "유체역학의 기본적인 지식을 바탕으로, 비압축성 공기중의 비행체 주위에서 발생하는 양력과 항력의 발생에 대한 핵심적인 이론을 학습한다. 이를 기반으로, 2차원 에어포일 및 3차원 유한 날개 주위에서 발생하는 양력, 항력 및 모멘트의 공기역학적 특성을 이해하며, 향후 비행체 해석 및 설계에 필요한 기본적인 비행원리를 습득한다."
                },
                {
                    "name": "항공우주 통합 시스템 설계 및 제작 2",
                    "description": "항공우주공학은 항공기, 발사체, 인공위성, 미사일 등 비행체 시스템과 관련된 학문으로 항공우주공학의 전반적인 지식을 바탕으로 비행체 시스템 설계에 대한 응용력을 키우는 능력을 배양할 것이 요구된다. 본 교과목에서는 항공우주 비행체 시스템의 공력설계, 구조설계, 추진기관 설계, 제어시스템설계 등 실제적인 문제를 다루며, 특히 구체적인 테마를 가지고 세미나, 발표, 프로젝트 등으로 진행된다."
                },
                {
                    "name": "운동체역학",
                    "description": "운동체 역학은 운동 중인 물체를 벡터적으로 해석하는 역학의 한 분야로서 물체에 작용하는 힘, 물체의 질량, 그리고 물체의 운동 간에 존재하는 관계를 다룬다. 즉, 주어진 힘에 의해 일어나는 운동을 예측하거나 또는 임의의 운동을 발생시키기 위하여 필요한 힘을 구한다. 먼저, 물체의 크기를 고려하지 않고 모든 질량이 그 질량중심에 집중되어 있는 작은 질점으로 가정을 하고 그 질점에 대한 운동역학을 공부한다. 그리고 그 물체의 질량중심에 대한 회전까지를 고려하는 강체의 동력학을 공부한다."
                },
                {
                    "name": "제트추진",
                    "description": "본 과목은 항공기에서 심장부라 할 수 있는 동력장치를 다루는 과목으로서 항공기에서 쓰이는 제트추진기관의 전반적인 종류(turbo prop, turbo shaft, turbo fan, turbo jet, ram jet, scram jet 등), 특징 및 원리에 대하여 다루게 된다. 또한, 요즈음 초소형 비행체(MAV, Micro Aerial Vehicle)에 대한 관심이 높아지고 있는데, 이러한 초소형 비행체의 동력원으로 사용 가능한 마이크로 엔진(micro-engine)에 대하여 소개한다. 그리고, 항공기의 엔진도 환경 친화적인 엔진개발이 요구되고 있으므로 배기가스 및 소음저감을 위한 방법을 소개한다."
                },
                {
                    "name": "항공우주 고체역학 2",
                    "description": "3차원에서의 응력과 변형률의 성질에 대해 살펴본다. 모멘트에 의한 구조물의 휨 변형과 그에 따른 변형율과 응력을 유도하고, 전단력에 의한 두께방향의 전단응력을 살펴본다. 구조물의 좌굴현상을 이해하고, 좌굴하중과 좌굴모드를 계산하기 위한 지배방정식을 유도한다. 또한 구조물의 안정성에 대한 기본 이론을 소개하고 에너지 방법에 기초한 다양한 구조해석방법에 대해 논의한다."
                },
                {
                    "name": "항공우주 고체역학 2",
                    "description": "3차원에서의 응력과 변형률의 성질에 대해 살펴본다. 모멘트에 의한 구조물의 휨 변형과 그에 따른 변형율과 응력을 유도하고, 전단력에 의한 두께방향의 전단응력을 살펴본다. 구조물의 좌굴현상을 이해하고, 좌굴하중과 좌굴모드를 계산하기 위한 지배방정식을 유도한다. 또한 구조물의 안정성에 대한 기본 이론을 소개하고 에너지 방법에 기초한 다양한 구조해석방법에 대해 논의한다."
                },
                {
                    "name": "비행동역학및제어",
                    "description": "본 교과목은 항공기의 동적특성을 이해하고, 비행 제어시스템을 설계하기 위한 기본원리를 제공하는 교과목이다. 항공기 조종성 및 안정성에 대한 내용을 다루고, 항공기가 정적으로 안정하도록 설계하기 위한 기하학적 및 공력특성을 해석적으로 다룬다. 뉴톤의 제2법칙을 이용하여 강체인 항공기의 비행운동특성을 묘사할 수 있는 비선형 운동방정식을 유도한다. 항공기의 동특성을 이해하고, 제어시스템을 설계하기 위해서 주어진 평형상태에 대하여 선형화하여, 단주기/장주기 운동 등의 항공기 운동특성을 학습한다. 동적 안정성 증대 및 조종성 증대를 위한 제어기 설계기법을 학습한다"
                },
                {
                    "name": "전산유체역학 기초",
                    "description": "본 강의는 대학원 과정의 고급전산유체역학의 기초과정으로서 공기역학, 압축성유체역학 등에서 학습하였던 유동 미분 방정식을 이산화 하여 수치해석을 하는 과정과 함께 이와 관련된 기본적인 개념들을 다룬다. 수치기법들을 기반으로 1차원, 2차원 유동을 계산하는 수치해석코드를 만들고, 실제적인 유동문제 해석에 적용하여, 그 장단점을 분석해본다."
                }
            ],
            "건축학과": [
                {
                    "name": "건축설계스튜디오 3-2",
                    "description": "행위와 공간. 이 단게에서는 개별적인 개인의 행위의 집합인 집단 행위에 대응하는 공간의 구성을 연습한다. 각 개인은 제각기 의지를 가지고 공간 속에서 행위를 연속시키는 것이다. 집중하는 행위, 행위에 대한 명확하지 못한 공간적, 시간적인 경계, 공간의 유동화처럼 공간의 개념을 순수하게 인간행위의 분포에 주목함으로써, 다양한 사건과 행위가 동시에 있는 것을 허용하고 이것이 만들어내는 공간을 설계한다. 이에 따라 외부와 내부의 경계, 연속성, 가구, 공간의 불균질성, 건축 속의 빈 장소, 시간, 공존하는 공간, 사람의 집합이 만들어내는 장면 등, 다양한 건축적, 도시적 공간의 느슨한 구성을 습득한다."
                },
                {
                    "name": "건축설계스튜디오 3-2",
                    "description": "행위와 공간. 이 단게에서는 개별적인 개인의 행위의 집합인 집단 행위에 대응하는 공간의 구성을 연습한다. 각 개인은 제각기 의지를 가지고 공간 속에서 행위를 연속시키는 것이다. 집중하는 행위, 행위에 대한 명확하지 못한 공간적, 시간적인 경계, 공간의 유동화처럼 공간의 개념을 순수하게 인간행위의 분포에 주목함으로써, 다양한 사건과 행위가 동시에 있는 것을 허용하고 이것이 만들어내는 공간을 설계한다. 이에 따라 외부와 내부의 경계, 연속성, 가구, 공간의 불균질성, 건축 속의 빈 장소, 시간, 공존하는 공간, 사람의 집합이 만들어내는 장면 등, 다양한 건축적, 도시적 공간의 느슨한 구성을 습득한다."
                },
                {
                    "name": "건축구조시스템",
                    "description": "건축물에 따른 하중 및 구조시스템의 종류와 역할, 각 구조시스템의 특성, 재료와 구조시스템, 각부재의 거동, 간략한 설계방법을 소개하며 주요 부재의 역학적 특성 설명"
                },
                {
                    "name": "건축구조계획",
                    "description": "보, 기둥, 벽, 바닥 및 간단한 쉘 구조물의 구조적 요소를 분석하고 설계하는 방식을 제시한다. 여기에서는 특히 목조, 조적조, 철골조, 콘크리트조 등의 구조방식의 이해가 요구된다. 그리고 구조재의 기계적 성질을 시험하기 위한 실험 과정이 포함될 수 있다."
                },
                {
                    "name": "건축설계스튜디오 3-2",
                    "description": "행위와 공간. 이 단게에서는 개별적인 개인의 행위의 집합인 집단 행위에 대응하는 공간의 구성을 연습한다. 각 개인은 제각기 의지를 가지고 공간 속에서 행위를 연속시키는 것이다. 집중하는 행위, 행위에 대한 명확하지 못한 공간적, 시간적인 경계, 공간의 유동화처럼 공간의 개념을 순수하게 인간행위의 분포에 주목함으로써, 다양한 사건과 행위가 동시에 있는 것을 허용하고 이것이 만들어내는 공간을 설계한다. 이에 따라 외부와 내부의 경계, 연속성, 가구, 공간의 불균질성, 건축 속의 빈 장소, 시간, 공존하는 공간, 사람의 집합이 만들어내는 장면 등, 다양한 건축적, 도시적 공간의 느슨한 구성을 습득한다."
                },
                {
                    "name": "건축사 2",
                    "description": "르네상스 또는 바로크에서 현대 건축까지 당대의 건축이론과 기능, 구조, 미학의 변화를 철학적 종교적 정치적 그리고 환경적 관점에서 이해한다. 근대의 문화적 변동이 가져온 지적 충격과 그것의 물적 표현을 건축개념과 양식적 표현, 건축유형과 구축술의 변화를 통해 이해한다."
                },
                {
                    "name": "건축시공 및 건설관리 입문",
                    "description": "건축시공 및 건설관리에 대한 입문 교과로서 전반적인 건축 생산과정을 엔지니어링 측면과 메니지먼트 측면에서 설명한다. 시공강의의 해당 공종은 공조 및 마감 공종으로 하며 건설관리는 건설계약, 공정관리 및 적산을 포함한다."
                },
                {
                    "name": "건축재료역학 1",
                    "description": "건축구조계열 과목의 가장 기초가 되는 과목으로서 강체정력학의 기본정리 를 건축구조의 관점에서 복습하고, 단면의 성질, 응력도/변형도의 개념의 이해 및 응용, 축력을 받는 정정/부정정 부재의 해석을 중심으로 학습한다. 1. 강체 정력학의 기본정리 리뷰(역학의 성격, 단위환산, 힘에 관한 경험법칙, 힘의 분해 및 합성, 모멘트정리, 힘의 평형 조건식 등) 2. 단면의 성질(도심, 단면2차모멘트, 평행축정리, 주축 등) 3. 인장, 압축 및 전단응력도(응력도 및 변형도, 재료의역학적 성질, �의 법칙, 허용응력도 등) 4. 축력을 받는 부재의 거동(길이변화, 온도효과, 변형에너지, 부정정구조, 반복하중 및 피로 등)"
                },
                {
                    "name": "건축전기 및 조명이론",
                    "description": "건축전기설비 시스템의 개념 및 공학이론을 숙지함으로써 장차 건축기계설비 혹은 전기설비 엔지니어링과 관련한 교과목을 이해하기 위한 기초지식을 터득할 뿐 아니라, 소방, 건축시공 및 구조 등의 엔지니어링 업무를 수행하기 위한 기초지식을 습득한다. 전기의 기본성질, 직류(회로법칙, 회로분석), 교류(회로법칙, 주파수, 유효치, 상, 임피던스, 전력과 역률, 전압과 전압강하, 회로분석), 전력기기(발전기, 전동기, 변압기, 인버터 및 정류기, 모터콘트롤센터), 조명의 물리적 특성(광속, 광도, 조도 및 휘도), 광조사이론 등과 같이 건축물에 공급되는 전기 및 전기회로의 기본개념과 조명이론을 배우며, 조명설계방법(루멘법 및 점촉법)과 같은 실제 전기설비에서의 응용을 배운다."
                },
                {
                    "name": "건축실무",
                    "description": "다양한 조건과 문화속에서 전개되는 건축사로서의 경쟁력과 책임감 전문용역을 수행하기 위해 요구되는 전문적 원칙, 프로젝트와 관련된 적절한 지식을 지니도록 한다. 전문 용역에 따른 건축사의 역할과 책임을 이해하며 프로젝트와 관련된 다양한 인간관계의 조정 및 사무실 조직, 경영방법, 재정관리 등에 관해 이해한다. 또한 프로젝트 단계별 도면과 서류의 유형을 이해한다."
                },
                {
                    "name": "건축설계스튜디오 4-2",
                    "description": "환경의 대응. 이 단계는 세가지로 이루어진다. 첫 단계는 열, 공기, 빛 등의 자연환경에 대응하는 구체적인 방식을 적극적으로 도입한 생태학적 건축을 설계한다. 두번째 단계는 오픈 스페이스와 녹지 공간을 중심으로 한 건축의 외부공간에서 다루어야 할 환경의 문제를 연습한다. 세 번째 단계는 도시풍결에 대한 방식인 랜드스케이프 아키텍취를 연구한다."
                },
                {
                    "name": "건축설계스튜디오 4-2",
                    "description": "환경의 대응. 이 단계는 세가지로 이루어진다. 첫 단계는 열, 공기, 빛 등의 자연환경에 대응하는 구체적인 방식을 적극적으로 도입한 생태학적 건축을 설계한다. 두번째 단계는 오픈 스페이스와 녹지 공간을 중심으로 한 건축의 외부공간에서 다루어야 할 환경의 문제를 연습한다. 세 번째 단계는 도시풍결에 대한 방식인 랜드스케이프 아키텍취를 연구한다."
                },
                {
                    "name": "건축설비계획",
                    "description": "이 수업은 실내 생활환경과 건물의 기능을 향상시키는 건축설비의 전반 이해를 목적으로 한다. 건축설비는 위생설비, 냉난방설비, 환기설비, 공기조화설비, 방재설비, 승강장치 등으로 분류될 수 있으며 건물의 규모가 커짐에 따라 그 중요성이 점차 증대되고 있다. 현재는 건축설비가 건축계획이나 구조 및 시공계획과 함께 통합적으로 다루어지는 경향을 보이고 있다."
                },
                {
                    "name": "건축설계스튜디오 3-2",
                    "description": "행위와 공간. 이 단게에서는 개별적인 개인의 행위의 집합인 집단 행위에 대응하는 공간의 구성을 연습한다. 각 개인은 제각기 의지를 가지고 공간 속에서 행위를 연속시키는 것이다. 집중하는 행위, 행위에 대한 명확하지 못한 공간적, 시간적인 경계, 공간의 유동화처럼 공간의 개념을 순수하게 인간행위의 분포에 주목함으로써, 다양한 사건과 행위가 동시에 있는 것을 허용하고 이것이 만들어내는 공간을 설계한다. 이에 따라 외부와 내부의 경계, 연속성, 가구, 공간의 불균질성, 건축 속의 빈 장소, 시간, 공존하는 공간, 사람의 집합이 만들어내는 장면 등, 다양한 건축적, 도시적 공간의 느슨한 구성을 습득한다."
                },
                {
                    "name": "기초스튜디오 2 (건축과 구조)",
                    "description": "구조에 대한 이해는 모든 건축교육의 바탕이다. 스튜디오에서는 공간을 구축하는 구조의 형식과 공간의 질서를 탐구하는 프로젝트를 진행한다. 일체식구조, 가구식구조, 복합구조 등 다양한 구조의 형식을 탐구한다. 구조 개념을 구체적인 건축공간으로 구현하는 과정에서 도면과 모형을 통해 구조적인 공간을 표현하는 능력을 배양한다. 또한 구조역학적인 이해를 바탕으로 건축의 형태를 이끌어 내는 통찰력을 키운다. '개인과 사회의 요구’를 ‘구축을 위한 기술’을 통해 건축공간으로 실현하는 과정, 즉 요구되는 공간의 프로그램에 합치하는 구조체계를 제안하고 이를 구현하는 설계 과정을 익힌다."
                },
                {
                    "name": "기초스튜디오 2 (건축과 구조)",
                    "description": "구조에 대한 이해는 모든 건축교육의 바탕이다. 스튜디오에서는 공간을 구축하는 구조의 형식과 공간의 질서를 탐구하는 프로젝트를 진행한다. 일체식구조, 가구식구조, 복합구조 등 다양한 구조의 형식을 탐구한다. 구조 개념을 구체적인 건축공간으로 구현하는 과정에서 도면과 모형을 통해 구조적인 공간을 표현하는 능력을 배양한다. 또한 구조역학적인 이해를 바탕으로 건축의 형태를 이끌어 내는 통찰력을 키운다. '개인과 사회의 요구’를 ‘구축을 위한 기술’을 통해 건축공간으로 실현하는 과정, 즉 요구되는 공간의 프로그램에 합치하는 구조체계를 제안하고 이를 구현하는 설계 과정을 익힌다."
                },
                {
                    "name": "기초스튜디오 2 (건축과 구조)",
                    "description": "구조에 대한 이해는 모든 건축교육의 바탕이다. 스튜디오에서는 공간을 구축하는 구조의 형식과 공간의 질서를 탐구하는 프로젝트를 진행한다. 일체식구조, 가구식구조, 복합구조 등 다양한 구조의 형식을 탐구한다. 구조 개념을 구체적인 건축공간으로 구현하는 과정에서 도면과 모형을 통해 구조적인 공간을 표현하는 능력을 배양한다. 또한 구조역학적인 이해를 바탕으로 건축의 형태를 이끌어 내는 통찰력을 키운다. '개인과 사회의 요구’를 ‘구축을 위한 기술’을 통해 건축공간으로 실현하는 과정, 즉 요구되는 공간의 프로그램에 합치하는 구조체계를 제안하고 이를 구현하는 설계 과정을 익힌다."
                },
                {
                    "name": "기초스튜디오 2 (건축과 구조)",
                    "description": "구조에 대한 이해는 모든 건축교육의 바탕이다. 스튜디오에서는 공간을 구축하는 구조의 형식과 공간의 질서를 탐구하는 프로젝트를 진행한다. 일체식구조, 가구식구조, 복합구조 등 다양한 구조의 형식을 탐구한다. 구조 개념을 구체적인 건축공간으로 구현하는 과정에서 도면과 모형을 통해 구조적인 공간을 표현하는 능력을 배양한다. 또한 구조역학적인 이해를 바탕으로 건축의 형태를 이끌어 내는 통찰력을 키운다. '개인과 사회의 요구’를 ‘구축을 위한 기술’을 통해 건축공간으로 실현하는 과정, 즉 요구되는 공간의 프로그램에 합치하는 구조체계를 제안하고 이를 구현하는 설계 과정을 익힌다."
                },
                {
                    "name": "건물설비시스템",
                    "description": "건축설비시스템의 개념 및 공학이론을 숙지함으로써 장차 건축설비 엔지니어링과 관련한 교과목을 이해하기 위한 기초지식을 터득한다. 건축에 필요한 MEP 시스템(Mechanical, Electrical and Plumbing), 급수설비, 급탕설비, 배수설비, 환기설비, 공기조화설비, 난방설비, 소화설비 등의 개념 및 기본 원리를 파악하고, 건축에 필요한 전기설비 즉, 조명설비, 변전설비, 배전설비, 예비전원설비, 통신 및 신호설비, 방송설비, 전동력설비, 피뢰침설비, TV공청설비 등의 개념 및 기본원리를 파악하고 건축물에 이용하는 방법에 대하여 학습한다."
                },
                {
                    "name": "건축설계스튜디오 3-2",
                    "description": "행위와 공간. 이 단게에서는 개별적인 개인의 행위의 집합인 집단 행위에 대응하는 공간의 구성을 연습한다. 각 개인은 제각기 의지를 가지고 공간 속에서 행위를 연속시키는 것이다. 집중하는 행위, 행위에 대한 명확하지 못한 공간적, 시간적인 경계, 공간의 유동화처럼 공간의 개념을 순수하게 인간행위의 분포에 주목함으로써, 다양한 사건과 행위가 동시에 있는 것을 허용하고 이것이 만들어내는 공간을 설계한다. 이에 따라 외부와 내부의 경계, 연속성, 가구, 공간의 불균질성, 건축 속의 빈 장소, 시간, 공존하는 공간, 사람의 집합이 만들어내는 장면 등, 다양한 건축적, 도시적 공간의 느슨한 구성을 습득한다."
                },
                {
                    "name": "건축설계스튜디오 3-2",
                    "description": "행위와 공간. 이 단게에서는 개별적인 개인의 행위의 집합인 집단 행위에 대응하는 공간의 구성을 연습한다. 각 개인은 제각기 의지를 가지고 공간 속에서 행위를 연속시키는 것이다. 집중하는 행위, 행위에 대한 명확하지 못한 공간적, 시간적인 경계, 공간의 유동화처럼 공간의 개념을 순수하게 인간행위의 분포에 주목함으로써, 다양한 사건과 행위가 동시에 있는 것을 허용하고 이것이 만들어내는 공간을 설계한다. 이에 따라 외부와 내부의 경계, 연속성, 가구, 공간의 불균질성, 건축 속의 빈 장소, 시간, 공존하는 공간, 사람의 집합이 만들어내는 장면 등, 다양한 건축적, 도시적 공간의 느슨한 구성을 습득한다."
                },
                {
                    "name": "건축구조시스템",
                    "description": "건축물에 따른 하중 및 구조시스템의 종류와 역할, 각 구조시스템의 특성, 재료와 구조시스템, 각부재의 거동, 간략한 설계방법을 소개하며 주요 부재의 역학적 특성 설명"
                },
                {
                    "name": "건축구조계획",
                    "description": "보, 기둥, 벽, 바닥 및 간단한 쉘 구조물의 구조적 요소를 분석하고 설계하는 방식을 제시한다. 여기에서는 특히 목조, 조적조, 철골조, 콘크리트조 등의 구조방식의 이해가 요구된다. 그리고 구조재의 기계적 성질을 시험하기 위한 실험 과정이 포함될 수 있다."
                },
                {
                    "name": "건축설계스튜디오 3-2",
                    "description": "행위와 공간. 이 단게에서는 개별적인 개인의 행위의 집합인 집단 행위에 대응하는 공간의 구성을 연습한다. 각 개인은 제각기 의지를 가지고 공간 속에서 행위를 연속시키는 것이다. 집중하는 행위, 행위에 대한 명확하지 못한 공간적, 시간적인 경계, 공간의 유동화처럼 공간의 개념을 순수하게 인간행위의 분포에 주목함으로써, 다양한 사건과 행위가 동시에 있는 것을 허용하고 이것이 만들어내는 공간을 설계한다. 이에 따라 외부와 내부의 경계, 연속성, 가구, 공간의 불균질성, 건축 속의 빈 장소, 시간, 공존하는 공간, 사람의 집합이 만들어내는 장면 등, 다양한 건축적, 도시적 공간의 느슨한 구성을 습득한다."
                },
                {
                    "name": "건축사 2",
                    "description": "르네상스 또는 바로크에서 현대 건축까지 당대의 건축이론과 기능, 구조, 미학의 변화를 철학적 종교적 정치적 그리고 환경적 관점에서 이해한다. 근대의 문화적 변동이 가져온 지적 충격과 그것의 물적 표현을 건축개념과 양식적 표현, 건축유형과 구축술의 변화를 통해 이해한다."
                },
                {
                    "name": "건축시공 및 건설관리 입문",
                    "description": "건축시공 및 건설관리에 대한 입문 교과로서 전반적인 건축 생산과정을 엔지니어링 측면과 메니지먼트 측면에서 설명한다. 시공강의의 해당 공종은 공조 및 마감 공종으로 하며 건설관리는 건설계약, 공정관리 및 적산을 포함한다."
                },
                {
                    "name": "건축설비계획",
                    "description": "이 수업은 실내 생활환경과 건물의 기능을 향상시키는 건축설비의 전반 이해를 목적으로 한다. 건축설비는 위생설비, 냉난방설비, 환기설비, 공기조화설비, 방재설비, 승강장치 등으로 분류될 수 있으며 건물의 규모가 커짐에 따라 그 중요성이 점차 증대되고 있다. 현재는 건축설비가 건축계획이나 구조 및 시공계획과 함께 통합적으로 다루어지는 경향을 보이고 있다."
                },
                {
                    "name": "건축설계스튜디오 3-2",
                    "description": "행위와 공간. 이 단게에서는 개별적인 개인의 행위의 집합인 집단 행위에 대응하는 공간의 구성을 연습한다. 각 개인은 제각기 의지를 가지고 공간 속에서 행위를 연속시키는 것이다. 집중하는 행위, 행위에 대한 명확하지 못한 공간적, 시간적인 경계, 공간의 유동화처럼 공간의 개념을 순수하게 인간행위의 분포에 주목함으로써, 다양한 사건과 행위가 동시에 있는 것을 허용하고 이것이 만들어내는 공간을 설계한다. 이에 따라 외부와 내부의 경계, 연속성, 가구, 공간의 불균질성, 건축 속의 빈 장소, 시간, 공존하는 공간, 사람의 집합이 만들어내는 장면 등, 다양한 건축적, 도시적 공간의 느슨한 구성을 습득한다."
                },
                {
                    "name": "기초스튜디오 2 (건축과 구조)",
                    "description": "구조에 대한 이해는 모든 건축교육의 바탕이다. 스튜디오에서는 공간을 구축하는 구조의 형식과 공간의 질서를 탐구하는 프로젝트를 진행한다. 일체식구조, 가구식구조, 복합구조 등 다양한 구조의 형식을 탐구한다. 구조 개념을 구체적인 건축공간으로 구현하는 과정에서 도면과 모형을 통해 구조적인 공간을 표현하는 능력을 배양한다. 또한 구조역학적인 이해를 바탕으로 건축의 형태를 이끌어 내는 통찰력을 키운다. '개인과 사회의 요구’를 ‘구축을 위한 기술’을 통해 건축공간으로 실현하는 과정, 즉 요구되는 공간의 프로그램에 합치하는 구조체계를 제안하고 이를 구현하는 설계 과정을 익힌다."
                },
                {
                    "name": "기초스튜디오 2 (건축과 구조)",
                    "description": "구조에 대한 이해는 모든 건축교육의 바탕이다. 스튜디오에서는 공간을 구축하는 구조의 형식과 공간의 질서를 탐구하는 프로젝트를 진행한다. 일체식구조, 가구식구조, 복합구조 등 다양한 구조의 형식을 탐구한다. 구조 개념을 구체적인 건축공간으로 구현하는 과정에서 도면과 모형을 통해 구조적인 공간을 표현하는 능력을 배양한다. 또한 구조역학적인 이해를 바탕으로 건축의 형태를 이끌어 내는 통찰력을 키운다. '개인과 사회의 요구’를 ‘구축을 위한 기술’을 통해 건축공간으로 실현하는 과정, 즉 요구되는 공간의 프로그램에 합치하는 구조체계를 제안하고 이를 구현하는 설계 과정을 익힌다."
                },
                {
                    "name": "기초스튜디오 2 (건축과 구조)",
                    "description": "구조에 대한 이해는 모든 건축교육의 바탕이다. 스튜디오에서는 공간을 구축하는 구조의 형식과 공간의 질서를 탐구하는 프로젝트를 진행한다. 일체식구조, 가구식구조, 복합구조 등 다양한 구조의 형식을 탐구한다. 구조 개념을 구체적인 건축공간으로 구현하는 과정에서 도면과 모형을 통해 구조적인 공간을 표현하는 능력을 배양한다. 또한 구조역학적인 이해를 바탕으로 건축의 형태를 이끌어 내는 통찰력을 키운다. '개인과 사회의 요구’를 ‘구축을 위한 기술’을 통해 건축공간으로 실현하는 과정, 즉 요구되는 공간의 프로그램에 합치하는 구조체계를 제안하고 이를 구현하는 설계 과정을 익힌다."
                },
                {
                    "name": "기초스튜디오 2 (건축과 구조)",
                    "description": "구조에 대한 이해는 모든 건축교육의 바탕이다. 스튜디오에서는 공간을 구축하는 구조의 형식과 공간의 질서를 탐구하는 프로젝트를 진행한다. 일체식구조, 가구식구조, 복합구조 등 다양한 구조의 형식을 탐구한다. 구조 개념을 구체적인 건축공간으로 구현하는 과정에서 도면과 모형을 통해 구조적인 공간을 표현하는 능력을 배양한다. 또한 구조역학적인 이해를 바탕으로 건축의 형태를 이끌어 내는 통찰력을 키운다. '개인과 사회의 요구’를 ‘구축을 위한 기술’을 통해 건축공간으로 실현하는 과정, 즉 요구되는 공간의 프로그램에 합치하는 구조체계를 제안하고 이를 구현하는 설계 과정을 익힌다."
                },
                {
                    "name": "기초스튜디오 2 (건축과 구조)",
                    "description": "구조에 대한 이해는 모든 건축교육의 바탕이다. 스튜디오에서는 공간을 구축하는 구조의 형식과 공간의 질서를 탐구하는 프로젝트를 진행한다. 일체식구조, 가구식구조, 복합구조 등 다양한 구조의 형식을 탐구한다. 구조 개념을 구체적인 건축공간으로 구현하는 과정에서 도면과 모형을 통해 구조적인 공간을 표현하는 능력을 배양한다. 또한 구조역학적인 이해를 바탕으로 건축의 형태를 이끌어 내는 통찰력을 키운다. '개인과 사회의 요구’를 ‘구축을 위한 기술’을 통해 건축공간으로 실현하는 과정, 즉 요구되는 공간의 프로그램에 합치하는 구조체계를 제안하고 이를 구현하는 설계 과정을 익힌다."
                },
                {
                    "name": "기초스튜디오 2 (건축과 구조)",
                    "description": "구조에 대한 이해는 모든 건축교육의 바탕이다. 스튜디오에서는 공간을 구축하는 구조의 형식과 공간의 질서를 탐구하는 프로젝트를 진행한다. 일체식구조, 가구식구조, 복합구조 등 다양한 구조의 형식을 탐구한다. 구조 개념을 구체적인 건축공간으로 구현하는 과정에서 도면과 모형을 통해 구조적인 공간을 표현하는 능력을 배양한다. 또한 구조역학적인 이해를 바탕으로 건축의 형태를 이끌어 내는 통찰력을 키운다. '개인과 사회의 요구’를 ‘구축을 위한 기술’을 통해 건축공간으로 실현하는 과정, 즉 요구되는 공간의 프로그램에 합치하는 구조체계를 제안하고 이를 구현하는 설계 과정을 익힌다."
                },
                {
                    "name": "기초스튜디오 4 (패브리케이션 디자인)",
                    "description": "이 과목은 가상의 구축(Virtual Construction)과 실제의 구축(Actual Construction)이 서로 상호보완 및 작용하고 있는 현대의 건축 설계 방법의 변화 양상에 대한 이해와 탐구를 바탕으로 이것을 가능하게 하는 디지털 디자인 테크놀로지에 대한 기초적 지식과 원리를 습득하고 기존의 전통적인 건축 설계 방식에서부터 새로운 설계의 방식으로의 전환과 그 원인 및 가능성에 대한 포괄적인 이해와 탐구를 목적으로 한다. 이 스튜디오는 학생들로 하여금 구상하고 설계하는 건축공간이 가상의 디지털 공간에서 잉태되고, 현실에서 실제로 생산, 구축되어지는 건축의 패브리케이션 프로세스까지 고려하여 디자인되도록 함으로써 건축 공간의 설계 및 완성뿐만 아니라 실제 공간의 생성에 고려되어야 할 재료, 구조, 구법, 구축의 방법까지 익혀 설계에서부터 시공까지의 건축이 동시적이며 전일적으로 이루어지는 건축공간생성 및 생산 전체 과정의 새로운 개념과 방식을 체험하도록 한다."
                },
                {
                    "name": "기초스튜디오 4 (패브리케이션 디자인)",
                    "description": "이 과목은 가상의 구축(Virtual Construction)과 실제의 구축(Actual Construction)이 서로 상호보완 및 작용하고 있는 현대의 건축 설계 방법의 변화 양상에 대한 이해와 탐구를 바탕으로 이것을 가능하게 하는 디지털 디자인 테크놀로지에 대한 기초적 지식과 원리를 습득하고 기존의 전통적인 건축 설계 방식에서부터 새로운 설계의 방식으로의 전환과 그 원인 및 가능성에 대한 포괄적인 이해와 탐구를 목적으로 한다. 이 스튜디오는 학생들로 하여금 구상하고 설계하는 건축공간이 가상의 디지털 공간에서 잉태되고, 현실에서 실제로 생산, 구축되어지는 건축의 패브리케이션 프로세스까지 고려하여 디자인되도록 함으로써 건축 공간의 설계 및 완성뿐만 아니라 실제 공간의 생성에 고려되어야 할 재료, 구조, 구법, 구축의 방법까지 익혀 설계에서부터 시공까지의 건축이 동시적이며 전일적으로 이루어지는 건축공간생성 및 생산 전체 과정의 새로운 개념과 방식을 체험하도록 한다."
                },
                {
                    "name": "기초스튜디오 4 (패브리케이션 디자인)",
                    "description": "이 과목은 가상의 구축(Virtual Construction)과 실제의 구축(Actual Construction)이 서로 상호보완 및 작용하고 있는 현대의 건축 설계 방법의 변화 양상에 대한 이해와 탐구를 바탕으로 이것을 가능하게 하는 디지털 디자인 테크놀로지에 대한 기초적 지식과 원리를 습득하고 기존의 전통적인 건축 설계 방식에서부터 새로운 설계의 방식으로의 전환과 그 원인 및 가능성에 대한 포괄적인 이해와 탐구를 목적으로 한다. 이 스튜디오는 학생들로 하여금 구상하고 설계하는 건축공간이 가상의 디지털 공간에서 잉태되고, 현실에서 실제로 생산, 구축되어지는 건축의 패브리케이션 프로세스까지 고려하여 디자인되도록 함으로써 건축 공간의 설계 및 완성뿐만 아니라 실제 공간의 생성에 고려되어야 할 재료, 구조, 구법, 구축의 방법까지 익혀 설계에서부터 시공까지의 건축이 동시적이며 전일적으로 이루어지는 건축공간생성 및 생산 전체 과정의 새로운 개념과 방식을 체험하도록 한다."
                },
                {
                    "name": "기초스튜디오 4 (패브리케이션 디자인)",
                    "description": "이 과목은 가상의 구축(Virtual Construction)과 실제의 구축(Actual Construction)이 서로 상호보완 및 작용하고 있는 현대의 건축 설계 방법의 변화 양상에 대한 이해와 탐구를 바탕으로 이것을 가능하게 하는 디지털 디자인 테크놀로지에 대한 기초적 지식과 원리를 습득하고 기존의 전통적인 건축 설계 방식에서부터 새로운 설계의 방식으로의 전환과 그 원인 및 가능성에 대한 포괄적인 이해와 탐구를 목적으로 한다. 이 스튜디오는 학생들로 하여금 구상하고 설계하는 건축공간이 가상의 디지털 공간에서 잉태되고, 현실에서 실제로 생산, 구축되어지는 건축의 패브리케이션 프로세스까지 고려하여 디자인되도록 함으로써 건축 공간의 설계 및 완성뿐만 아니라 실제 공간의 생성에 고려되어야 할 재료, 구조, 구법, 구축의 방법까지 익혀 설계에서부터 시공까지의 건축이 동시적이며 전일적으로 이루어지는 건축공간생성 및 생산 전체 과정의 새로운 개념과 방식을 체험하도록 한다."
                },
                {
                    "name": "기초스튜디오 4 (패브리케이션 디자인)",
                    "description": "이 과목은 가상의 구축(Virtual Construction)과 실제의 구축(Actual Construction)이 서로 상호보완 및 작용하고 있는 현대의 건축 설계 방법의 변화 양상에 대한 이해와 탐구를 바탕으로 이것을 가능하게 하는 디지털 디자인 테크놀로지에 대한 기초적 지식과 원리를 습득하고 기존의 전통적인 건축 설계 방식에서부터 새로운 설계의 방식으로의 전환과 그 원인 및 가능성에 대한 포괄적인 이해와 탐구를 목적으로 한다. 이 스튜디오는 학생들로 하여금 구상하고 설계하는 건축공간이 가상의 디지털 공간에서 잉태되고, 현실에서 실제로 생산, 구축되어지는 건축의 패브리케이션 프로세스까지 고려하여 디자인되도록 함으로써 건축 공간의 설계 및 완성뿐만 아니라 실제 공간의 생성에 고려되어야 할 재료, 구조, 구법, 구축의 방법까지 익혀 설계에서부터 시공까지의 건축이 동시적이며 전일적으로 이루어지는 건축공간생성 및 생산 전체 과정의 새로운 개념과 방식을 체험하도록 한다."
                },
                {
                    "name": "기초스튜디오 4 (패브리케이션 디자인)",
                    "description": "이 과목은 가상의 구축(Virtual Construction)과 실제의 구축(Actual Construction)이 서로 상호보완 및 작용하고 있는 현대의 건축 설계 방법의 변화 양상에 대한 이해와 탐구를 바탕으로 이것을 가능하게 하는 디지털 디자인 테크놀로지에 대한 기초적 지식과 원리를 습득하고 기존의 전통적인 건축 설계 방식에서부터 새로운 설계의 방식으로의 전환과 그 원인 및 가능성에 대한 포괄적인 이해와 탐구를 목적으로 한다. 이 스튜디오는 학생들로 하여금 구상하고 설계하는 건축공간이 가상의 디지털 공간에서 잉태되고, 현실에서 실제로 생산, 구축되어지는 건축의 패브리케이션 프로세스까지 고려하여 디자인되도록 함으로써 건축 공간의 설계 및 완성뿐만 아니라 실제 공간의 생성에 고려되어야 할 재료, 구조, 구법, 구축의 방법까지 익혀 설계에서부터 시공까지의 건축이 동시적이며 전일적으로 이루어지는 건축공간생성 및 생산 전체 과정의 새로운 개념과 방식을 체험하도록 한다."
                },
                {
                    "name": "철골구조설계 및 공법",
                    "description": "본 과목에서는 하중저항계수법(LRFD)에 의한 강구조물의 설계법은 물론 강구조 공법과 시공과정을 학습시켜 설계능력과 강구조공사의 현장 관리능력까지 배양함을 목적으로 한다. 우선 강구조물 설계의 근저를 이루는 제강/제작/디테일링/시공 개요를 학습한 후, 하중저항계수법의 기본철학, 확률론적 배경, 구조용 강재의 제반특성을 학습한다. 설계법의 근거가 되는 여러 가지 부재 및 접합부의 한계상태 (또는 파괴모드)의 역학적 배경을 충분히 이해시켜 인장재, 압축재, 보, 보-기둥, 접합부 등의 설계기준을 실제 문제의 해결에 창의적으로 응용하고 할 수 있도록 한다. 또한, 대표적 강구조 시스템과 공법 그리고 철골공사 실무요체까지 학습하여 이론적 바탕 위에 강구조 건설기술 전반을 이해하는 안목을 지닌 강구조 엔지니어링 리더를 양성하고자 한다."
                },
                {
                    "name": "한국건축",
                    "description": "한국건축이 형성 전개되어온 역사적 과정을 공부한다. 한국의 지역건축에서 풍토성에 따라 물리적 환경과 삶의 행태가 맺어온 상호관계를 이해한다. 한국건축의 개념과 양식적 표현, 건축유형과 구축술의 변화와 발전을 공부한다. 한국 건축양식과 형태가 결정되는데 건축가와 건축주의 역할과 사회적 경제적 기술적 문화적 요소의 복합적 작용을 이해한다."
                },
                {
                    "name": "건설관리",
                    "description": "건설 프로젝트의 목표를 달성하는데 요구되는 제반 관리 요소들을 소개하고, 건설관리이론을 토대로 중요한 관리요소인 공정관리, 비용관리, 자원관리, 품질관리 등의 방법과 절차에 대하여 강의한다."
                },
                {
                    "name": "도시건축·공간계획",
                    "description": "지속적으로 성장하고 변화하는 도시공간에 대한 계획체계를 심도 있게 학습시키는 과목이다. 구체적으로, 단지패턴, 토지이용, 동선과 가로활동, 오픈스페이스, 도시환경맥락과 관련된 건물의 형태의 매스등 다양한 도시공간 계획요소들에 대한 개념의 이해와 관련사례들을 분석한다. 특히, 현행도시계획제도, 토지이용 계획 및 교통계획. 도시개발제도 등에 대한 전반적인 이해를 바탕으로 도시공간계획의 최근 우수사례들을 건축교육의 일환으로 경험할 수 있게 한다."
                },
                {
                    "name": "도시문화와 보전",
                    "description": "도시문화와 문화유산보전의 개념적 체계 및 실행적 전략을 전반적으로 익힌다. 역사적 도시장소를 포함하는 문화유산에 대한 이해, 해석, 재생 및 활용방안을 다각도에서 통합적으로 학습한다. 전통적으로 과거의 역사, 문화유산이 어떻게. 왜. 보전되어 왔는가를 이해함과 동시에,최근 문화산업의 일환으로 진행되고 있는 역사문화 정관의 재활용 사레를 논의하며, 더 나아가 이들을 지속가능한 지역개발의 경향 및 속성과 연계하여 인지할 수 있도록 이끈다."
                },
                {
                    "name": "디지털 디자인 연구",
                    "description": "Computer Simulated Image의 도움을 받아 공간 속에서 이동하는 인간의 행동을 예측하고, 이를 통하여 공간의 규모나 배치를 결정하는 디자인을 배운다. 따라서 이 강의는 형태를 생성하는 규칙을 배우며, 또한 이용자의 행동 특성을 설계에 반영하기 위해 생성한 형태를 인간의 생활 속에서 평가하고, 나아가 디지털 프로세스를 통해 표현 기술을 개발한다."
                },
                {
                    "name": "방호시설공학설계",
                    "description": "급변하는 국제관계 속에서 방호시설은 국민의 생명과 안전 그리고 자산을 지키는 최후의 시설로 군의 작전시설은 물론 민간의 민방위 대피시설로 활용되는 국가의 자산이다. 또한, 가스 충전소 등 산업시설은 물론 에너지 전환시대에 신재생 에너지인 수소 등 저장을 위해서는 폭발현상을 이해하고 우발적 폭발에 국민의 안전을 담보하기 위한 기술이 요구된다. 스위스, 스웨덴, 핀란드 등 지정학적 위치에 따른 안보위협이 존재하는 국가에서는 방호시설을 이용한 시민방호가 국가전략으로 채택되어 지속적으로 기술개발을 통해 국가의 신산업으로 발전하여 세계적인 건설시장의 선두주자로 자리매김하고 있다. 국내 건설기술은 세계 최고 수준을 자부하고 있으나, 방호시설 건설에서는 아직 후발주자에 불과하다. 이에 기본적인 방호시설인 방폭/방탄, 화생방, 전자기파 방호를 위한 기본 원리를 이해하고 건축물 및 시설물에 대한 요구조건과 이에 대한 공학설계를 배운다."
                },
                {
                    "name": "콘크리트구조설계 및 공법 2",
                    "description": "이 강의는 철근콘크리트구조와 부재설계를 위한 고급구조해석과 설계방법 및 공법을 다룬다. 콘크리트구조설계 및 공법 1에서 다루는 내용에 이어 기둥설계, 2방향 슬래브, 기초, 전단마찰, 구조벽, 스트럿타이 모델, 내진설계를 포함하여 강의를 진행한다."
                },
                {
                    "name": "한국 근현대 도시와 주택",
                    "description": "이 과목은 건축학전공 학생들을 대상으로 한국의 근현대 도시 및 주택에 대한 강의와 현장 답사로 진행된다. 이 과목은 19세기부터 1970년대까지 한국 도시 및 주택에 대한 이해의 폭을 넓히는 것을 목표로 하는 것으로, 개항기 이후 서구 근대와의 접촉, 식민지기와 해방, 한국전쟁 및 고도성장기를 거치며 급격하게 변화해온 한국의 도시와 주택을 이해하고 그것이 현재 우리 도시와 주택 문화에서 가지는 의미를 파악해 본다."
                }
            ],
            "연합전공 기술경영": [
                {
                    "name": "경제성공학",
                    "description": "이 과목의 내용은 크게 두 가지 부분으로 나누어진다. 전반부에는 공학도에게 응용될 수 있는 기본적인 재무관리의 기법을 다루며, 후반부에는 투자론의 기본적인 내용을 다루게 된다. 경제성을 고려한 공학적 설계에 대한 혜안을 갖을 수 있도록 기본적 재무관리의 기법들을 경제성 공학이라는 주제로 묶어 학습하게 된다. 또한 금융산업 전반에 대한 기초적 지식들을 익히고, 투자공학을 염두에 둔 기법들을 학습하게 된다."
                },
                {
                    "name": "지식재산경영",
                    "description": "본 교과목에서는 발명, 디자인, 상표 및 저작권 등의 지식재산정보의 조사 및 분석, 거래, 평가를 포함하는 지식재산의 운영과 보호에서부터 지식재산을 창출하는 방법론을 학습하며, 실제 지식재산전략을 수립하여 아이디어 창출로부터 지식재산권을 창출하는 전 과정을 실습한다. 이를 통해 공학업무 중 발생하는 창출물을 신속히 지식재산화 할 수 있는 역량을 배양한다. 특히 지식재산은 기술과 산업의 발전동향 및 경쟁사의 움직임을 가장 잘 파악할 수 있는 데이터 원천으로 특허, 상표 등의 지식재산 DB에 산업공학적 기법을 적용하여 다양한 시사점을 도출하는 산업기술 데이터 분석 방법론을 실습함으로써 기술개발 동향을 파악하고 신기술 기회를 발굴하는 과정을 실습한다."
                }
            ],
            "전기·정보공학부": [
                {
                    "name": "기초전자기학 및 연습",
                    "description": "이 강좌에서는 전하와 전류의 개념, 정전기와 정자기의 개념, 물질의 전기적인 특성상수의 의미, 저항, 캐패시터, 인덕터의 물리적인 개념들을 이론과 더불어 실험을 통해 공부한다. 특히 정전기력과 정자기력의 세기를 직접 측정하여 봄으로써 필드의 세기에 대한 이해를 확고히 하고 교과서에서 다루는 여러 가지 상황에서의 정전기장와 정자기장 분포를 필드 시뮬레이터를 이용하여 직접 구해 가시화하여 봄으로써 학생들로 하여금 전기장과 자기장에 대한 이해를 돕도록 할 것이다."
                },
                {
                    "name": "기초전자기학 및 연습",
                    "description": "이 강좌에서는 전하와 전류의 개념, 정전기와 정자기의 개념, 물질의 전기적인 특성상수의 의미, 저항, 캐패시터, 인덕터의 물리적인 개념들을 이론과 더불어 실험을 통해 공부한다. 특히 정전기력과 정자기력의 세기를 직접 측정하여 봄으로써 필드의 세기에 대한 이해를 확고히 하고 교과서에서 다루는 여러 가지 상황에서의 정전기장와 정자기장 분포를 필드 시뮬레이터를 이용하여 직접 구해 가시화하여 봄으로써 학생들로 하여금 전기장과 자기장에 대한 이해를 돕도록 할 것이다."
                },
                {
                    "name": "기초전자기학 및 연습",
                    "description": "이 강좌에서는 전하와 전류의 개념, 정전기와 정자기의 개념, 물질의 전기적인 특성상수의 의미, 저항, 캐패시터, 인덕터의 물리적인 개념들을 이론과 더불어 실험을 통해 공부한다. 특히 정전기력과 정자기력의 세기를 직접 측정하여 봄으로써 필드의 세기에 대한 이해를 확고히 하고 교과서에서 다루는 여러 가지 상황에서의 정전기장와 정자기장 분포를 필드 시뮬레이터를 이용하여 직접 구해 가시화하여 봄으로써 학생들로 하여금 전기장과 자기장에 대한 이해를 돕도록 할 것이다."
                },
                {
                    "name": "논리설계 및 실험",
                    "description": "이 강좌에서는 디지털 시스템 설계의 기본이 되는 논리설계의 기본개념을 학습하고 실제로 기본 회로의 설계, 제작, 실험과 프로젝트 수행을 통하여 논리회로에 대한 개념을 확고히 함을 목적으로 한다. 기본 논리 회로 소자(inverter, NAND, NOR gate 등) 및 이를 사용하여 조합(combinational) 논리 회로를 구성하고 최적화하는 방법을 다룬다. Number system의 기본 원리를 설명하고, 이를 바탕으로 adder, multiplier 등 연산회로를 구현한다. 순차적 (sequential) 논리회로 구현을 위한 기본 기억소자, flipflop 등의 동작원리를 소개하고, PLA, FPGA, 그리고 synchronous design methodology, counter 등을 다룬다. 이를 바탕으로 finite state machine 설계 방법을 설명하고, 다양한 응용 예를 소개한다."
                },
                {
                    "name": "논리설계 및 실험",
                    "description": "이 강좌에서는 디지털 시스템 설계의 기본이 되는 논리설계의 기본개념을 학습하고 실제로 기본 회로의 설계, 제작, 실험과 프로젝트 수행을 통하여 논리회로에 대한 개념을 확고히 함을 목적으로 한다. 기본 논리 회로 소자(inverter, NAND, NOR gate 등) 및 이를 사용하여 조합(combinational) 논리 회로를 구성하고 최적화하는 방법을 다룬다. Number system의 기본 원리를 설명하고, 이를 바탕으로 adder, multiplier 등 연산회로를 구현한다. 순차적 (sequential) 논리회로 구현을 위한 기본 기억소자, flipflop 등의 동작원리를 소개하고, PLA, FPGA, 그리고 synchronous design methodology, counter 등을 다룬다. 이를 바탕으로 finite state machine 설계 방법을 설명하고, 다양한 응용 예를 소개한다."
                },
                {
                    "name": "논리설계 및 실험",
                    "description": "이 강좌에서는 디지털 시스템 설계의 기본이 되는 논리설계의 기본개념을 학습하고 실제로 기본 회로의 설계, 제작, 실험과 프로젝트 수행을 통하여 논리회로에 대한 개념을 확고히 함을 목적으로 한다. 기본 논리 회로 소자(inverter, NAND, NOR gate 등) 및 이를 사용하여 조합(combinational) 논리 회로를 구성하고 최적화하는 방법을 다룬다. Number system의 기본 원리를 설명하고, 이를 바탕으로 adder, multiplier 등 연산회로를 구현한다. 순차적 (sequential) 논리회로 구현을 위한 기본 기억소자, flipflop 등의 동작원리를 소개하고, PLA, FPGA, 그리고 synchronous design methodology, counter 등을 다룬다. 이를 바탕으로 finite state machine 설계 방법을 설명하고, 다양한 응용 예를 소개한다."
                },
                {
                    "name": "전기·정보세미나 3",
                    "description": "이 강좌는 전기·전자·정보공학 뿐만 아니라, 그와 관련된 기술, 사회, 비지니스 등 다양한 분야의 최고권위자의 강연을 통해, 전기·전자·정보공학을 전공한 학생들이 졸업후 자신에게 맞는 진로를 선택할 수 있는 폭넓은 시야을 길러주고, 아울러 각 분야의 발전 방향, 공학의 사회적 역할에 대한 소양을 높여주기 위함이다."
                },
                {
                    "name": "전기·정보세미나 2",
                    "description": "이 강좌는 전기전자 공학을 전공하며 향후 전기전자 공학을 보다 심화하여 전공하는 학생을 대상으로 한다. 이 강좌는 전기전자공학의 첨단 연구 분야 및 응용 분야에 대하여 심도 있게 설명한다. 즉, 전기에너지 분야, 광공학 및 디스플레이 분야, 반도체 분야, 로보틱스 및 제어시스템 분야, 컴퓨터 및 VLSI 분야, 통신 분야, 생체전자 분야의 첨단 연구동향과 응용을 강의한다. 이 강좌를 통하여 전기전자 분야 및 응용에 대한 깊은 이해를 하도록 하고 전기전자 공학 연구자로서의 능력을 함양하도록 하려 한다."
                },
                {
                    "name": "전기공학설계프로젝트",
                    "description": "전기,전자분야와 관련된 프로젝트를 수행한다. 디자인에서부터 기술적인 보고서 제작에 이르기까지 적절한 모든 과정들을 수행할 것이다. 프로젝트는 학생이나 교수진에 의해 주어진다. 프로젝트의 성공적인 완료를 위해서는 제작품에 대한 자세한 설명과 자세한 결과 보고와 프리젠테이션이 필요하다."
                },
                {
                    "name": "전기공학설계프로젝트",
                    "description": "전기,전자분야와 관련된 프로젝트를 수행한다. 디자인에서부터 기술적인 보고서 제작에 이르기까지 적절한 모든 과정들을 수행할 것이다. 프로젝트는 학생이나 교수진에 의해 주어진다. 프로젝트의 성공적인 완료를 위해서는 제작품에 대한 자세한 설명과 자세한 결과 보고와 프리젠테이션이 필요하다."
                },
                {
                    "name": "전기공학설계프로젝트",
                    "description": "전기,전자분야와 관련된 프로젝트를 수행한다. 디자인에서부터 기술적인 보고서 제작에 이르기까지 적절한 모든 과정들을 수행할 것이다. 프로젝트는 학생이나 교수진에 의해 주어진다. 프로젝트의 성공적인 완료를 위해서는 제작품에 대한 자세한 설명과 자세한 결과 보고와 프리젠테이션이 필요하다."
                },
                {
                    "name": "전기공학설계프로젝트",
                    "description": "전기,전자분야와 관련된 프로젝트를 수행한다. 디자인에서부터 기술적인 보고서 제작에 이르기까지 적절한 모든 과정들을 수행할 것이다. 프로젝트는 학생이나 교수진에 의해 주어진다. 프로젝트의 성공적인 완료를 위해서는 제작품에 대한 자세한 설명과 자세한 결과 보고와 프리젠테이션이 필요하다."
                },
                {
                    "name": "전기공학설계프로젝트",
                    "description": "전기,전자분야와 관련된 프로젝트를 수행한다. 디자인에서부터 기술적인 보고서 제작에 이르기까지 적절한 모든 과정들을 수행할 것이다. 프로젝트는 학생이나 교수진에 의해 주어진다. 프로젝트의 성공적인 완료를 위해서는 제작품에 대한 자세한 설명과 자세한 결과 보고와 프리젠테이션이 필요하다."
                },
                {
                    "name": "전기공학설계프로젝트",
                    "description": "전기,전자분야와 관련된 프로젝트를 수행한다. 디자인에서부터 기술적인 보고서 제작에 이르기까지 적절한 모든 과정들을 수행할 것이다. 프로젝트는 학생이나 교수진에 의해 주어진다. 프로젝트의 성공적인 완료를 위해서는 제작품에 대한 자세한 설명과 자세한 결과 보고와 프리젠테이션이 필요하다."
                },
                {
                    "name": "전기공학설계프로젝트",
                    "description": "전기,전자분야와 관련된 프로젝트를 수행한다. 디자인에서부터 기술적인 보고서 제작에 이르기까지 적절한 모든 과정들을 수행할 것이다. 프로젝트는 학생이나 교수진에 의해 주어진다. 프로젝트의 성공적인 완료를 위해서는 제작품에 대한 자세한 설명과 자세한 결과 보고와 프리젠테이션이 필요하다."
                },
                {
                    "name": "프로그래밍방법론",
                    "description": "<프로그래밍방법론>은 컴퓨터 프로그래밍을 위한 기술과 컴퓨터 프로그래밍 언어를 학습하는 과목이다. 수업은 컴퓨터의 기초와 Java 언어를 공부한 학생을 대상으로 하며, Unix의 기초와 사용 방법과 Java AWT/network, C/C++의 주요 사항, 윈도우 프로그램의 기초를 학습한다."
                },
                {
                    "name": "공학연구의 실습 1",
                    "description": "학부 학생들이 대학원 연구실에서 교수의 지도하에 한 학기 동안 실제적인 공학 연구에 참여하는 기회를 갖도록 한다. 이 과목을 수강하는 학생은 일주일에 1회 이상 정기적으로 지도 교수와 연구 미팅을 갖고, 학기 중에 대학원 연구에 참여하며, 학기 말에 연구 보고서를 제출하여야 한다. 연구 태도와 연구 성과를 근거로 지도교수가 S/U 학점을 부여한다."
                },
                {
                    "name": "공학연구의 실습 1",
                    "description": "학부 학생들이 대학원 연구실에서 교수의 지도하에 한 학기 동안 실제적인 공학 연구에 참여하는 기회를 갖도록 한다. 이 과목을 수강하는 학생은 일주일에 1회 이상 정기적으로 지도 교수와 연구 미팅을 갖고, 학기 중에 대학원 연구에 참여하며, 학기 말에 연구 보고서를 제출하여야 한다. 연구 태도와 연구 성과를 근거로 지도교수가 S/U 학점을 부여한다."
                },
                {
                    "name": "광전자공학",
                    "description": "이 과목에서는 광학과 레이저의 기본 원리를 강의하고, 이의 응용을 설명하며, 특히 광통신을 위한 소자와 시스템 및 그 원리를 설명한다. 다루는 내용은, 광학의 기본 원리, 가우스 빔 광학, 전자파 광학이론, 레이저의 원리, 반도체 광소자, 전자광학, 비선형광학, 음향광학, 광통신의 원리 등이다"
                },
                {
                    "name": "네트워크 프로토콜 설계 및 실습",
                    "description": "본 강의에서는 고급 네트워크 이론에 대한 소개를 바탕으로 프로토콜 설계 기술 및 실제 네트워크 운영을 위한 스위치, 라우터 동작 원리에 대해 배운다. 또한 TCP/IP 소켓 프로그래밍 방법에 대해서도 배운다. 강의는 구체적으로 다음과 같은 세부 내용으로 구성된다. 1) 고급 통신 네트워크 프로토콜에 대한 이해 및 설계 방법 2) 네트워크 프로토콜 및 알고리듬을 응용한 소켓 프로그램밍 기술 3) 네트워크 수율 및 지연 등의 성능 모델링 기술 4) 스위치와 라우터에 대한 동작 원리 숙지 및 실습 5) 네트워크 문제 발생 시 원인 분석 및 해결 방안"
                },
                {
                    "name": "디지털 시스템 설계 및 실험",
                    "description": "디지털 시스템 설계에 필요한 기본적인 이론을 습득하고 하드웨어 기술 언어를 사용하여 구현하는 방법을 실습한다. 디지털 시스템을 Register Transfer Level과 Architecture Level에서 설계하는 방법을 배운다. 효율적인 설계를 위해 control unit 및 data path로 분리 설계하는 기법을 다루며, VHDL과 같은 하드웨어 기술 언어를 이용한 현대적인 설계방법을 실습한다. 프로세서, 버스 및 메모리의 구조 및 설계 방법을 배우고, 고속 덧셈기, 곱셈기 등의 다양한 연산기구, 현 알고리즘 및 하드웨어 구현 기법을 익힌다. 프로그래밍 숙제 및 프로젝트를 통하여 설계실습을 한다."
                },
                {
                    "name": "디지털 시스템 설계 및 실험",
                    "description": "디지털 시스템 설계에 필요한 기본적인 이론을 습득하고 하드웨어 기술 언어를 사용하여 구현하는 방법을 실습한다. 디지털 시스템을 Register Transfer Level과 Architecture Level에서 설계하는 방법을 배운다. 효율적인 설계를 위해 control unit 및 data path로 분리 설계하는 기법을 다루며, VHDL과 같은 하드웨어 기술 언어를 이용한 현대적인 설계방법을 실습한다. 프로세서, 버스 및 메모리의 구조 및 설계 방법을 배우고, 고속 덧셈기, 곱셈기 등의 다양한 연산기구, 현 알고리즘 및 하드웨어 구현 기법을 익힌다. 프로그래밍 숙제 및 프로젝트를 통하여 설계실습을 한다."
                },
                {
                    "name": "디지털집적회로",
                    "description": "이 과목은 Deep-Submicron CMOS 디바이스 특성에 검토하고 디지털 집적회로의 분석 및 설계에 대해서 다루며 로직게이트, 산술회로, 그리고 메모리의 설계 및 최적화에 대해서도 다룬다. 마지막으로 인터커넥트, 전력소모, 클럭분배, 그리고 다양한 주제를 다룬다."
                },
                {
                    "name": "딥러닝의 기초",
                    "description": "4차 산업혁명의 핵심기술인 인공지능(딥러닝)의 배경지식과 활용방법을 습득하며, Convolutional Neural Networks 와 Recurrent Neural Networks 에 관한 지식과 활용법을 실습한다. 딥러닝 기본개념, Stochastic Gradient Descent, backpropagation 기법, 초기화기법, regularization 기법, 콘볼류션신경망(CNN), CNN 구조, 반복신경망(RNN), RNN의 응용, 강화학습을 다룬다. 이론은 기존 머신러닝과목에서 다루므로, 이론보다는 실용적 적용능력을 배양하기 이해 딥러닝 관련 소프트웨어 교육을 강조하며, Python에 관한 강의와 실습, Python 수학 라이브러리 numpy에 강의도 실시한다. 또한 Advanced deep learning library인 Tensorflow에 대한 강의와 실습도 병행한다."
                },
                {
                    "name": "딥러닝의 기초",
                    "description": "4차 산업혁명의 핵심기술인 인공지능(딥러닝)의 배경지식과 활용방법을 습득하며, Convolutional Neural Networks 와 Recurrent Neural Networks 에 관한 지식과 활용법을 실습한다. 딥러닝 기본개념, Stochastic Gradient Descent, backpropagation 기법, 초기화기법, regularization 기법, 콘볼류션신경망(CNN), CNN 구조, 반복신경망(RNN), RNN의 응용, 강화학습을 다룬다. 이론은 기존 머신러닝과목에서 다루므로, 이론보다는 실용적 적용능력을 배양하기 이해 딥러닝 관련 소프트웨어 교육을 강조하며, Python에 관한 강의와 실습, Python 수학 라이브러리 numpy에 강의도 실시한다. 또한 Advanced deep learning library인 Tensorflow에 대한 강의와 실습도 병행한다."
                },
                {
                    "name": "반도체소자",
                    "description": "반도체에서의 전하 수송 현상에 대한 기본적인 사항들을 다룬다. P-N접합과 다양한 반도체 기기들의 기본 동작 원리들을 학습한다."
                },
                {
                    "name": "반도체소자",
                    "description": "반도체에서의 전하 수송 현상에 대한 기본적인 사항들을 다룬다. P-N접합과 다양한 반도체 기기들의 기본 동작 원리들을 학습한다."
                },
                {
                    "name": "반도체소자",
                    "description": "반도체에서의 전하 수송 현상에 대한 기본적인 사항들을 다룬다. P-N접합과 다양한 반도체 기기들의 기본 동작 원리들을 학습한다."
                },
                {
                    "name": "생체계측",
                    "description": "본 교과목에서는 생체 계측의 이론 및 실험 기법 등을 다룬다. 교과 내용은 바이오센서, 증폭기, 신호처리부를 포함하는 생체계측기기의 설계와 이를 이용한 다양한 생체 신호의 측정이 주를 이룬다. 측정하는 생체 신호의 예로는 근육에서 발생하는 근전도(EMG), 심장에서 발생하는 심전도(ECG), 눈에서 측정하는 안전위도(EOG)등이 있으며 또한 뇌 및 신경에서 발생하는 신경 신호를 이용한 뇌-기계접속시스템, 세포내 미세신호를 측정하기 위한 나노바이오센서등 최근 주제도 다룬다. 일부실험도 병행할 계획이다."
                },
                {
                    "name": "생체전기정보공학",
                    "description": "생물의 정보 및 에너지 전달 체계를 이해하기 위해서 세포의 물리, 화학, 전기공학적 원리를 강의한다. ① 세포의 물리적 모델링을 통해 세포내외 물질, 에너지 생성/전달 및 신호의 전달의 원리 ② 뇌와 신경계의 기본이 되는 뉴런 세포의 여러 특성과 기능을 전기화학적 모델링 ③ 능동수송을 통한 화학적 농도구배의 형성, 막전위의 생성, 화학적으로 저장된 에너지를 이용한 전기신호의 빠른 전달과정, 시냅스에서의 신호전달 및 가변적인 가중치의 생성 ④ 신경계 세포 또는 조직의 다양한 기능과 성질을 측정 분석하기 위한 기술과 마이크론 나노 사이즈의 광학적, 전기적, 화학적 장치를 다룬다."
                },
                {
                    "name": "아날로그전자회로",
                    "description": "소신호 분석 모델에 근거하여 선형시스템 특성을 갖는 아날로그 전자회로 전반에 대해 다룬다. 즉, MOSFET와 BJT 소자를 활용한 기본 증폭단 분석, 차동 증폭기, 전류 미러 등의 기본 회로 요소와 피드백 구조를 통해 불확실한 소자를 가지고 예측 가능한 성능의 회로를 설계하는 기법을 배운다. 특히 선형시스템의 주파수 특성을 결정하는 극점 및 영점 등을 이해하고, Bode plot을 통해 피드백 회로의 안정성을 분석하는 방법 등을 다룬다."
                },
                {
                    "name": "아날로그전자회로",
                    "description": "소신호 분석 모델에 근거하여 선형시스템 특성을 갖는 아날로그 전자회로 전반에 대해 다룬다. 즉, MOSFET와 BJT 소자를 활용한 기본 증폭단 분석, 차동 증폭기, 전류 미러 등의 기본 회로 요소와 피드백 구조를 통해 불확실한 소자를 가지고 예측 가능한 성능의 회로를 설계하는 기법을 배운다. 특히 선형시스템의 주파수 특성을 결정하는 극점 및 영점 등을 이해하고, Bode plot을 통해 피드백 회로의 안정성을 분석하는 방법 등을 다룬다."
                },
                {
                    "name": "알고리즘의 기초",
                    "description": "여러 가지 문제를 컴퓨터로 해결하기 위한 다양한 방법론이라 할 수 있는 알고리즘을 본 과목에서는 소개한다. 특히 알고리즘 분석 기법을 통해 효율적인 알고리즘을 개발하고 이해할 능력을 키운다. 또한 컴퓨터가 풀 수 있는 쉬운 문제와 어려운 문제를 구별하기 위한 NP-complete 이론을 배우며 어려운 문제를 해결하기 위한 근사 알고리즘을 소개한다."
                },
                {
                    "name": "유기전자소자",
                    "description": "본 강좌는 학부 4학년에 개설되어 전기전자 재료의 특성을 체계적으로 이해하기 위해 고체의 결합유형, 결정성과 비결정성, 고체 재료의 열적 및 전기적 전도도, 반도체의 성질, 유전체 재료와 절연 특성 등에 대해 강의하고 이를 바탕으로 전기전자 소자에 대한 개념을 다룬다. 또한, 평판 디스플레이나 플라스틱 전자의 기반을 이루는 유기 전기전자 재료와 소자의 동작 원리 그리고 응용에 대해서도 다룬다. 특히 유기화합물로 구성된 반도체 재료인 유기반도체는 OLED, OTFT, Organic Photovoltaic Cells, Memory Devices, Sensor 등에 사용되는 새로운 반도체이다. 본 강좌에서는 유기반도체의 전자구조, 전기적 특성, 광학적 특성을 강의하고, 유기반도체/금속 계면 특성, 유기반도체 소자에서의 전하 수송 특성, 엑시톤 형성 및 재결합, 에너지 전달 과정에 대한 지식을 강의하며, 이러한 지식을 바탕으로 유기반도체 소자의 동작 원리에 대해서도 강의한다. 이와 같이 본 강좌를 통해서 수강생들에게 전자공학 분야의 다양하고 새로운 유무기 재료 및 관련 소자에 대한 기초를 제공한다."
                },
                {
                    "name": "융합공학도를 위한 전기전자회로",
                    "description": "전기 전자 공학의 기본이 되는 전기전자 회로에 관한 이론을 제공하며 여러 분야의 응용 예를 제시한다. 수강생은 다음의 내용을 학습한다. (1) 기초적인 전기전자회로를 이해하고 해석하는 것, (2) 대표적인 부품인 저항, 커패시터, 인덕터, 다이오드, 트랜지스터와 연산증폭기 등의 기능과 응용을 이해하는 것. 본 교과목을 통해 결과적으로 수강생은 다음과 같은 능력을 배양하게 된다. (1) 전기전자 부품의 기능을 이해하고 (2) 전력과 전기에너지에 대해 이해하고 전력에너지가 어떻게 커패시터와 인덕터에 저장되고 배출되는가를 이해하고 (3) 다이오드의 기능과 정류기와 같은 다이오드 응용회로를 이해하고 (4) 트랜지스터의 기능과 증폭회로와 같은 트랜지스터 응용회로를 이해하고 (5) 연산증폭기의 기능과 연산증폭기 회로를 이해한다."
                },
                {
                    "name": "자료구조의 기초",
                    "description": "프로그램 안에서 데이터를 효율적으로 저장하고 접근하도록 자료구조의 다양한 개념을 소개한다. 특히 같은 목적을 위해 작성된 코드안에서 사용 가능한 여러 가지 자료구조들 중에서 어떤 자료 구조가 어떤 상황에서 더 유리한 지를 이해하고, 주어진 응용에 적합한 자료구조를 선택하고 새로운 자료구조를 디자인 할 수 있는 감각을 기른다. 이를 위해 수학적인 분석과 프로그래밍 실습을 통한 다양한 자료구조의 평가를 수행한다."
                },
                {
                    "name": "자료구조의 기초",
                    "description": "프로그램 안에서 데이터를 효율적으로 저장하고 접근하도록 자료구조의 다양한 개념을 소개한다. 특히 같은 목적을 위해 작성된 코드안에서 사용 가능한 여러 가지 자료구조들 중에서 어떤 자료 구조가 어떤 상황에서 더 유리한 지를 이해하고, 주어진 응용에 적합한 자료구조를 선택하고 새로운 자료구조를 디자인 할 수 있는 감각을 기른다. 이를 위해 수학적인 분석과 프로그래밍 실습을 통한 다양한 자료구조의 평가를 수행한다."
                },
                {
                    "name": "자료구조의 기초",
                    "description": "프로그램 안에서 데이터를 효율적으로 저장하고 접근하도록 자료구조의 다양한 개념을 소개한다. 특히 같은 목적을 위해 작성된 코드안에서 사용 가능한 여러 가지 자료구조들 중에서 어떤 자료 구조가 어떤 상황에서 더 유리한 지를 이해하고, 주어진 응용에 적합한 자료구조를 선택하고 새로운 자료구조를 디자인 할 수 있는 감각을 기른다. 이를 위해 수학적인 분석과 프로그래밍 실습을 통한 다양한 자료구조의 평가를 수행한다."
                },
                {
                    "name": "전기.정보공학개론",
                    "description": "이 교과목에서는 공학도로서 기본적으로 알고 있어야 하는 전기 및 정보공학의 전반적인 내용에 대해서 다룬다. 그 내용을 살펴보면, 전자회로의 기초 개념과 해석 방법, 트랜지스터, 연산증폭기와 같은 중요 소자의 동작 원리 및 디지털 논리회로를 다룬 후 마이크로컴퓨터에 대해서도 살펴본다."
                },
                {
                    "name": "전기시스템선형대수",
                    "description": "본 과목은 전기공학에서 다루는 일반적인 선형시스템의 해석에 필요한 행렬 및 선형대수에 관한 기초이론과 관련 기법들을 익히고, 그 응용 예들에 대해 알아봄을 목적으로 한다. 따라서 본 과목의 이수를 통하여 향후 실제 시스템문제의 해결을 위한 선형대수적 모델링 및 해석 그리고 과학으로 해를 구하는 방법론의 설계가 가능하다. 본 과목의 내용으로는 벡터와 행렬의 표현 및 종류, 선형방정식의 해법, 행렬-벡터공간 해석, 고유값 및 고유벡터, 유사변환, 최소자승문제 해석 등이 포함되는 데 이들의 의미를 자세히 배우고 그 응용 예를 익힌다."
                },
                {
                    "name": "전기기기 및 제어",
                    "description": "날로 심각해지는 에너지 위기 속에서 가장 고급 에너지원인 전력 에너지의 활용 전반에 대해 공부한다. 특히 전체 전력 에너지의 2/3이상을 소비하는 전동기의 원리와 기본적인 제어 방법에 대해 소개하고 교류 전력의 수송에 결정적 역할을 하는 변압기의 원리와 활용에 대해서 알아본다. 특히 90% 이상의 전기 에너지를 생산하는 동기발전기의 구조와 원리를 통해 전력 발생을 이해하고, 최근 고효율의 전동력으로 주목 받고 있는 영구자석 교류 전동기의 원리와 기본적인 구동 방법에 대해서도 학습한다. 강의는 학부 기초수준의 전기회로/전자기 지식을 가지더라도 이해할 수 있게 평이하게 진행 될 예정이며 전기기기 응용에 대한 광범위한 내용을 다룰 예정임."
                },
                {
                    "name": "전기시스템선형대수",
                    "description": "본 과목은 전기공학에서 다루는 일반적인 선형시스템의 해석에 필요한 행렬 및 선형대수에 관한 기초이론과 관련 기법들을 익히고, 그 응용 예들에 대해 알아봄을 목적으로 한다. 따라서 본 과목의 이수를 통하여 향후 실제 시스템문제의 해결을 위한 선형대수적 모델링 및 해석 그리고 과학으로 해를 구하는 방법론의 설계가 가능하다. 본 과목의 내용으로는 벡터와 행렬의 표현 및 종류, 선형방정식의 해법, 행렬-벡터공간 해석, 고유값 및 고유벡터, 유사변환, 최소자승문제 해석 등이 포함되는 데 이들의 의미를 자세히 배우고 그 응용 예를 익힌다."
                },
                {
                    "name": "전기에너지변환",
                    "description": "이 과목에서는 전기적으로 저장된 에너지를 기계에너지로 변환하거나 또는 기계에너지를 전기에너지로 변환하는 이론과 응용에 대해서 강의한다. 우선, 기초적인 전자기 이론을 강의한다. 예를 들면, 발산의 정리, 스토크스 정리, 전하보존의 법칙, 맥스웰 방정식 등을 소개한다. 전기기계 에너지 변환이론을 유도하기 위하여 준정적인 전자기 식을 유도형과 정전형에서 유도한다. 그리고, 일반화된 인덕턴스와 정정용량, 에너지 등에 대하여 강의한다. 기계시스템에 대한 지식을 늘이기 위하여 간단한 역학과 스프링, 댐퍼, 질량 등의 기계소자와, 운동방정식, 기계회로에 대하여 소개한다. 저장된 전기에너지를 기계에너지로 변환하는 에너지 변환이론과 운동 방정식을 학습한다. 그 이론을 회전형 기기에 적용하여 균일 간극형 기기로서 동기기와 유도기를 해석한다. 돌극형 기기에도 적용하여 해석한다. 마지막으로 회전형 기기가 아닌 일반적인 기기에 적용하여 안정성, 정상상태의 응답 등에 대하여 해석한다."
                },
                {
                    "name": "전력 및 에너지시스템의 기초",
                    "description": "본 과목은 전력과 에너지 시스템에 대한 기초 교과목임. 본 과목은 다양한 전력 및 에너지 시스템에 대한 이해, 분석, 설계에 대한 학부생의 능력 증진을 목표로 함. 전력의 기초, 3상 전기 시스템, 풍력 및 태양광 발전 시스템, 전력 전송, 분배, 접속 등의 기술에 대해서 개요 수준으로 다룸. 전력과 전기 에너지 변환 시스템의 이해도를 높이기 위한 과목임."
                },
                {
                    "name": "전력전자공학",
                    "description": "본 과목은 전력전자의 기초 과목으로 수동 소자와 전력용 스위치를 이용한 전압과 전류의 변환 회로에 대해 배운다. 스위치, 인덕터, 커패시터가 DC 또는 AC 전압원과 결합된 회로에서 고효율 전력 변환의 기본적인 원리를 이해한다. 이러한 전력전자 회로의 전기자동차, 휴대전화기, 컴퓨터, 가전 등에 대한 다양한 응용 예를 학습한다."
                },
                {
                    "name": "전력시장이론",
                    "description": "이 과목은 전력경제에 대한 전반적인 내용을 다룬다. 탈 규제화된 전력시장에서 전력시장의 참가자들에 대해 소개한 다음 전력시장을 이해하기 위해 필요한 미시경제학에서 사용되고 있는 개념들에 대해서 배울 것이다. 그런 다음 경쟁 환경하에서 전력시장이 어떻게 운영되는지 알아 볼 것이다. 문제를 간단하게 하기 위해 강의 처음부분에는 송전선를 고려하지 않고 오직 경제적인 관점에 대해서만 다루기로 한다. 중간 부분에서는 계통의 안정도와 송전시스템이 어떻게 전력시장에 영향을 미치는가에 대해서 다룰 것이다. 강의 마지막 부분에서는 경쟁체제어서 발전회사의 투자전략과 송전선로의 투자전략에 대해서 다룰 것이다."
                },
                {
                    "name": "전파공학",
                    "description": "본 과목에서는 먼저 전파공학 분야에서 사용되는 여러 가지 마이크로파 소자의 구조 및 동작원리를 공부한 후 이를 이용한 간단한 마이크로파 회로의 설계기법을 익힌다. 또한 여러 가지 전파 응용 시스템의 구성 및 동작원리를 공부한다."
                },
                {
                    "name": "제어공학개론",
                    "description": "역학적인 시스템 동적 반응, 피드백의 기본적인 특성, Root-Locus법, 주파수 반응법, 안정도, 제어시스템 설계법 등을 배운다."
                },
                {
                    "name": "최신제어기법",
                    "description": "상태변수 방법을 이용한 미분방정식의 설명에 대해 소개한다. 극 할당 테크닉, 상태 평가자, 안정적인 추적을 포함한 상태 공간 디자인 방법. 석사 과정에서 광범위하게 연구되는 높은 수준의 제어 시스템 디자인의 간단히 살펴보며, 선형시각제어, 시스템확인, 비선형제어, 적응적이고 안정적인 제어에 대해서 학습한다."
                },
                {
                    "name": "컴퓨터 시스템 프로그래밍",
                    "description": "컴퓨터 시스템 프로그래머가 되기 위한 기반 지식을 배운다. 기초적 프로그래밍 지식을 기반으로, 프로그램이 컴퓨팅 시스템과 어떻게 상호동작하는지 배운다. 본 과목은 컴퓨터 시스템의 다양한 내부 구조, 특히 운영체제와 CPU를 이해하는데 중점을 둔다. 이러한 과정은 컴퓨팅 시스템이 추상화하고 있는 내부 구현 디테일을 이해하는데 도움을 줄 것이다(예: 소프트웨어와 하드웨어 간의 인터페이스 또는 운영체제와 CPU 간의 인터페이스). 이를 통해 상급 컴퓨터 시스템 관련 과목(운영체제, 컴퓨터 조직론, 컴파일러 등)을 수강하기 전에 기초적 지식을 쌓을 수 있다. 마지막으로 이러한 이해를 바탕으로 효율적이고 안정적이며 안전한 소프트웨어 시스템을 디자인하고 개발하는 방법을 습득하는 것이 본 과목의 목표이다."
                },
                {
                    "name": "지능시스템개론",
                    "description": "본 교과목에서는 현재 여러 분야에서 적용되고 있는 지능시스템 및 관련연구의 핵심이 되는 확률적 모델링 및 추론, 통계학적 기계학습, 컴퓨터비젼, 로보틱스의 기초를 소개한다. Bayesian networks, hidden Markov models (HMM), Kalman filters, Markov decision processes 등의 확률적 모델링 및 추론방식이 소개되고 선형 regression 및classification 그리고 nonparametric 학습 방법의 기초를 습득한다. 그리고 확률적 모델, 추론방식, 학습방식들이 어떻게 컴퓨터비전 그리고 로보틱스 등의 응용분야에 적용되는지 알아본다."
                },
                {
                    "name": "창의공학설계",
                    "description": "이 과목은 다양하게 주어진 목표물의 설계 및 제작 실습을 통하여 설계 및 제작에 대한 기본 감각과 창조성을 키우는 데에 목적이 있다. 아직 공학의 개념이 확립되지 않은 1학년 학생을 대상으로 하여 정해진 재료를 써서 제품을 직접 만들고 그것으로 경기를 해 봄으로서 흥미를 가지고 공학의 의미를 체험할 수 있도록 한다. 제품은 여러 공학 분야의 특성을 종합적으로 표현할 수 있는 기구, 구조물 등 다양한 대상이 된다. 교과목 내용은 초기 6주간에는 설계의 기본원칙, 기구학, 가공방법 등에 관한 강의와 함께 간단한 공작기계의 작동 실습을 한다. 1주일에 강의 2시간 실습 2시간으로 구성되는 본 교과목은 학기 제7주에는 학생들이 설계, 제작할 제품의 용도와 규칙을 발표하며, 제공된 제작용 재료세트에 의하여 각자가 주어진 규칙안에서 자유롭게 설계, 제작한 제품으로 제 12주에 예비경기를 실시하고 제 13주에 본 경기를 갖는다."
                },
                {
                    "name": "최신제어기법",
                    "description": "상태변수 방법을 이용한 미분방정식의 설명에 대해 소개한다. 극 할당 테크닉, 상태 평가자, 안정적인 추적을 포함한 상태 공간 디자인 방법. 석사 과정에서 광범위하게 연구되는 높은 수준의 제어 시스템 디자인의 간단히 살펴보며, 선형시각제어, 시스템확인, 비선형제어, 적응적이고 안정적인 제어에 대해서 학습한다."
                },
                {
                    "name": "컴파일러의 기초",
                    "description": "프로그래밍언어의 컴파일러에 대한 기초를 가르친다. 컴퓨터 하드웨어의 디자인을 바탕으로 컴파일러 설계를 이론으로 접근할 것이다. 간단한 컴파일러 디자인의 실습을 바탕으로 컴파일러 설계 기법에 대해 이해할 수 있다."
                },
                {
                    "name": "통신의 기초",
                    "description": "이 과정은 학부생들에게 기초적인 이론과 일반적인 개념을 제공할 것이다. 이 과정은 신호와 잡음의 수학적인 표현, 변조 방법(AM, PM, FM)과 이 방법들의 효율성, 샘플링 이론에 대한 물리학적인 의미, 디지털 신호의 코딩과 신호로의 변조(PAM, PWM, PPM, PCM), 디지털 변조방법(ASK, PSK, FSK) 등 통신에 대한 대부분의 기초적인 주제들을 포함할 것이다. 이러한 것들은 통신에 대한 일반적인 이해를 도울 것이다."
                }
            ],
            "건설환경공학부": [
                {
                    "name": "기초유체역학 및 실험",
                    "description": "본 교과목에서는 유체의 운동 및 역학에 관한 기초적인 이론과 실제유체에의 적용이론을 연구한다. 우선 정지유체의 역학 및 압력에 대하여 공부하고, 유체운동을 기술하는 방법론을 취급한다. 또한 유체흐름에 관련된 질량보존의 법칙 및 연속방정식에 관한 개념을 도입한 후, 유체의 운동에 관한 에너지방정식, 운동량방정식 등을 유도하고, 이들의 응용문제를 취급한다. 후반부에서는 실제유체의 흐름 특성과 난류흐름의 거동을 연구하고, 실험유체역학의 기본이론인 상사법칙과 차원해석에 관하여 취급한다."
                },
                {
                    "name": "건설시스템종합설계",
                    "description": "토목 공학 분야의 이론적 학습을 모두 마친 졸업반 학생을 대상으로 토목공학내 여러 세부 분야의 지식을 복합적으로 필요로 하는 토목 구조물에 대한 설계 및 (가상) 시공 과정을 직접 체험하게 함으로써 졸업과 동시에 현장 적응이 가능한 인재를 육성한다."
                },
                {
                    "name": "건설환경통계학",
                    "description": "본 강좌는 통계와 확률의 기초와 응용 이론을 건설환경공학의 사례로 소개한다. 세부 주제로는 사전통계분석, 기초확률개념, 확률변수, 확률분포함수, 매개변수 추정, 회귀분석, 빈도분석, 리스크분석 등을 포함한다."
                },
                {
                    "name": "환경공학",
                    "description": "환경을 구성하는 기본요소와 이들 사이의 관계를 인류활동의 영향과 함께 고찰한다. 환경의 질을 저하시키는 다양한 문제로 대두되고 있는 대기오염, 수질오염, 토양오염, 소음, 진동, 폐기물, 유해물질 등에 관하여 원인, 현상, 결과 및 대응방안 등을 학습한다. 건전한 생태계와 보다 쾌적한 삶의 질을 이룩하기 위하여 필요한 각종 환경오염 예방 및 제어기술 뿐 아니라, 바람직한 환경을 조성하기 위한 정책과 제도 등을 습득한다. 국부적이나 지역적 환경 문제뿐 아니라 인류 전체의 생존을 위협하는 기후변화, 오존층파괴, 생물종 다양성 감소 등의 범지구적 환경문제의 원인과 해결방안에 관하여 공부하고 지속 가능한 인류의 발전을 위한 전략을 모색한다."
                },
                {
                    "name": "건설시스템동역학",
                    "description": "시간에 따라 변화하는 하중에 대하여 1자유도로 이상화한 인프라시설물의 동적거동을 이해하는 것을 목표로 한다. 관성력과 감쇠가 인프라시설물의 동적응답에 미치는 역할을 이해하고 진동의 특성을 파악한다. 지진과 바람 등 동적 하중의 모사와 내진설계 및 내풍설계 등의 기본 원리를 소개함으로써, 건설환경공학도로서의 자연재난에 대한 대응방안 이해역량을 높인다."
                },
                {
                    "name": "건설시공학",
                    "description": "많은 건설 현장에서 사용되는 건설 장비의 종류를 소개하고, 각 작업 유형별 장비의 사용법을 가르친다. 또한, 이 과목은 학생들로 하여금 기초 공사를 비롯한 건설시공에 기본적인 여러 공법들에 관한 전문지식을 습득케 하고, 건설현장 견학 등을 통해 학습내용에 대한 이 이해도를 구체화시켜 준다. 이 과목의 주 목적은 학생들에게 건설현장에서 이루어지는 여러 작업공정들에 대한 감각을 익히게 하는 것이다."
                },
                {
                    "name": "건설환경시스템 지속가능공학",
                    "description": "지속가능공학은 인간 삶의 복지를 추구하되 경제, 환경, 사회에 미치는 부정적인 영향은 최소로 하는 공학적 해법을 추구하는 학문으로, 특히 인간이 생산하고 소비하는 모든 과정에서 필수적인 물질 자원을 얼마나 효율적으로 소비하고 지속가능하게 관리하는지에 초점을 둔다. 이를 정책적으로 추진하고 있는 것이 순환경제로, 전 세계적으로 전자제품, 자동차 및 배터리, 포장재, 플라스틱, 건설자재, 섬유, 수자원, 식품 및 영양물질과 같은 제품을 중심으로 물질 자원의 소비와 환경 영향을 줄이기 위한 다양한 순환경제 전략을 추진하고 있다. 특히, 도시와 도시를 구성하는 건축물 및 구조물, 교통시설, 환경기초시설과 같은 건설환경시스템의 경우, 건설과 운영, 해체의 모든 과정에서 많은 자원을 소비하고 상당량의 폐기물과 온실가스를 배출한다. 따라서 건설환경공학자가 어떻게 건설환경시스템을 설계, 건설, 운영, 유지 및 관리하는지는 탄소중립 및 지속가능발전목표를 달성하는데 중요한 역할을 한다. 본 교과는 건설환경공학 전공 학부생이 지속가능공학의 기본 원리와 개념을 이해하고, 방법론과 적용 사례, 최신 동향을 개괄하는 것을 목적으로 한다. 방법론으로는 물질흐름분석, 비용편익분석, 전과정평가 및 지속가능성 분석, 환경산업연관분석에 대해 다루고, 적용 사례로서 제품의 친환경 설계, 청정생산, 생태산업개발, 지속가능한 비즈니스 모델 등에 대해 살펴본다. 전반부의 이론적 강의를 바탕으로, 교과 후반부에서는 학생들이 실제 사례를 탐색하고 방법론을 적용하는 프로젝트를 수행한다."
                },
                {
                    "name": "공간정보시스템",
                    "description": "공간정보에 대한 포괄적 지식을 제공함으로써 토목, 도시, 환경 등 지구환경공학부에서 다루고 있는 제반분야에의 응용능력과 정보시스템에 대한 이해도를 고양시키는데 있으며, 아울러 GIS 관련 소프트웨어를 직접 다루어 봄으로써 실제 활용능력을 갖추는데 있다."
                },
                {
                    "name": "공학기술의 응용과 전망",
                    "description": "공학 기술은 이론과 응용, 산업화 기술이 복합적으로 연결되어있으며, 각 나라의 역사와 문화를 기반으로 발전해왔다. 이 수업에서는 자동차, 항공, 조선, 원자력, 반도체, 디스플레이, 바이오, 디지털, 인공지능, 건설 및 토목, 정유, 재료 산업 등을 다룬다. 또한 각 분야의 공학 기술이 각 나라에서 어떻게 탄생하였고 발전하여 왔는가를 설명하고, 향후 공학기술의 발전 추세와 응용에 대해서 전망한다. 이 수업을 통해서 학생들이 공학 기술 발전 역사와 응용, 미래를 학습해서 공학도로서의 시야를 넓히고 공학적 소양을 배양하도록 한다."
                },
                {
                    "name": "교통시스템설계",
                    "description": "본 과목은 여러 교통체계의 설계와 관련된 이론 및 실습을 통해 교통시스템설계 능력을 배양하는데 목적이 있다. 교통체계의 종류로는 도로, 철도, 대중교통, 화물, 항공 그리고 해운교통체계가 있다. 본 과목에서는 도로, 철도, 대중교통 등 육상교통체계를 중심으로 관련 이론과 특성을 재정리하고, 이를 교통시스템의 설계에 적용하는 과정과 실제 사례를 중심으로 설계 프로젝트를 통하여 실제 설계를 수행하고 이의 발표 및 토론을 통해 종합적인 교통공학자로서의 자질을 함양하고자 한다."
                },
                {
                    "name": "기후변화 적응과 건설환경계획",
                    "description": "건설환경공학은 지구온난화에 의한 기후변화의 영향이 가장 큰 분야 중 하나이다. 본 강좌에서는 기후변화 대응기술의 세 축인 전망, 저감, 적응을 소개하고 IPCC 전지구모형, 상세화 기법, 전망 시계열의 불확실성, 그리고 적응 및 의사결정 이론에 대해서 배운다. 또한 수자원, 해안, 생태, 교통, 방재, 도시계획 등 건설환경 산업에 기후변화가 미칠 영향을 평가하고 이에 대한 미래 적응기술을 중점적으로 다룬다."
                },
                {
                    "name": "도시설계",
                    "description": "도시설계의 개념을 비롯해서 공간의 개념(형태와 공간, 시간과 공간)과 도시설계의 기본원칙 및 그 기법을 습득하게 한다. 이 습득한 기법을 적용하여 도시의 미관을 고찰하고 도심지, 쇼핑센터, 주택지역을 설계하며 법규와 통제, 도시설계의 역할이 무엇인가 하는 것도 음미하게 된다."
                },
                {
                    "name": "수리학 및 실험",
                    "description": "본 과목의 목적은 수리학의 기본적인 수학적, 물리적 개념을 체계적으로 습득하고 학생들로 하여금 심도있는 여러 가지의 수리학 관련 응용분야에서 지속적인 학습이 가능하도록 하는데 있다. 강의내용으로는 관수로와 개수로에 관한 이론 및 여러 가지 실제적인 사례를 소개하고 수리학의 핵심이 되는 유체의 kinematics 및 dynamics를 학습한다."
                },
                {
                    "name": "수자원 공학",
                    "description": "수자원공학의 기능은 시간적, 공간적으로 발생하는 한정적인 재화인 수자원을 양적인 측면과 질적인 측면에서 이용할 수 있도록 하는 것이다. 본 과목에서는 수자원공학 분야에서 계획 및 관리에 대한 소개, 수자원계획에 대한 확률적인 개념, 경제학에 대한 일반적인 사항 및 시스템공학에 대한 소재를 다룬다."
                },
                {
                    "name": "원격탐사",
                    "description": "원격탐사에 대한 기본이론들을 이해하고, 위성영상의 프로세싱기법과 알고리즘을 이해하므로써, 여러 활용분야에 적용가능한 능력을 배양하는데 있으며, 이를 위해 IDRISI, ERDAS, ER-Mapper 등의 영상처리용 소프트웨어 실습을 병행한다."
                },
                {
                    "name": "토질공학",
                    "description": "지반에 관련된 제반 공학적 문제들을 다루는 과목으로서 얕은 기초와 깊은 기초, 옹벽과 굴착, 지반 개량, 사면안정 등에 대한 해석 및 설계방법과 기타 공학적 검토사항들을 강의한다. 지반에 관련한 역학적 이론들을 토대로 구축된 다양한 지반구조물들의 해석 및 설계 방법들을 실 사례에 대한 설명 및 예제 풀이와 함께 병행하여 실시한다. 특히 실제 지반공학적 문제들에 대한 학생들의 현실감을 고양하고 최근 지반공학 분야의 연구동향을 파악할 수 있도록 관련 분야 외부 전문가의 세미나와 현장견학을 병행하여 실시한다."
                },
                {
                    "name": "지속가능교통체계",
                    "description": "대중교통체계를 효율적으로 운영하기 위해 대중교통수단의 역할로서 도심업무 상업지구와 시외곽지역 거주자와의 유기적 연결을 도모하고 도시가 안고 있는 교통문제를 해결하여야 할 것이다. 본 강좌에서는 대중교통체계설계, 도시교통망설계, 요금배정에 대한 기법, 장?단기 대중교통정책 등을 다루게 된다."
                },
                {
                    "name": "창의공학설계",
                    "description": "이 과목은 다양하게 주어진 목표물의 설계 및 제작 실습을 통하여 설계 및 제작에 대한 기본 감각과 창조성을 키우는 데에 목적이 있다. 아직 공학의 개념이 확립되지 않은 1학년 학생을 대상으로 하여 정해진 재료를 써서 제품을 직접 만들고 그것으로 경기를 해 봄으로서 흥미를 가지고 공학의 의미를 체험할 수 있도록 한다. 제품은 여러 공학 분야의 특성을 종합적으로 표현할 수 있는 기구, 구조물 등 다양한 대상이 된다. 교과목 내용은 초기 6주간에는 설계의 기본원칙, 기구학, 가공방법 등에 관한 강의와 함께 간단한 공작기계의 작동 실습을 한다. 1주일에 강의 2시간 실습 2시간으로 구성되는 본 교과목은 학기 제7주에는 학생들이 설계, 제작할 제품의 용도와 규칙을 발표하며, 제공된 제작용 재료세트에 의하여 각자가 주어진 규칙안에서 자유롭게 설계, 제작한 제품으로 제 12주에 예비경기를 실시하고 제 13주에 본 경기를 갖는다."
                },
                {
                    "name": "토목지질암반공학",
                    "description": "지반을 구성하는 중요한 재료이며 건설공학 측면에서 크게 활용되는 암반의 역학적 특성과 그 공학적 활용 방법을 강의하는 과목이다. 지반의 지질공학적인 고찰과 함께 암의 생성과 분류, 그리고 풍화 등에 의한 성질 변화를 그 역학적 특성과 함께 강의하고, 암반에 조성되는 또는 암반을 이용하는 중요 건설구조물인 터널, 암사면, 기초 등에 대한 시공 및 해석 이론 등을 강의한다."
                },
                {
                    "name": "토양환경생태공학",
                    "description": "본 교과목은 토양환경에 대한 이해를 바탕으로 토양 및 지하수의 오염원인과 전개과정, 정화원리 등에 대한 이해를 일차적인 목표로 한다. 오염물질과 환경매질사이의 물리, 화학, 생물학적인 반응과 이류, 확산, 분산, 지연 등 오염물질의 이동 및 거동에 영향을 미치는 중요 기작들에 대한 기초적인 이론들을 강의하고 이를 바탕으로 오염지역 정화기술 및 그 설계기술을 적용해 보는 프로젝트를 수행한다. 이와 더불어 생태공학적 환경복원의 원리와 그 사례들에 대해서도 알아본다."
                }
            ],
            "기계공학부": [
                {
                    "name": "고체역학",
                    "description": "해석 대상인 고체의 거동에 대한 기본적인 가정을 소개하고 자유 물체도 개념을 도입해서 힘의 평형 조건을 논의한다. 이를 기반으로 해서 정정계와 부정정계를 해석하기 위한 3단계인 평형 방정식, 기하학적 적합성, 응력-변형률 관계식을 소개한다. 그리고 이 방법을 이용하여 보의 처짐 및 비틀림에 대한 해석을 수행한다."
                },
                {
                    "name": "기계공학실험",
                    "description": "기계공학과 관련된 기본 실험을 취급한다. 기계공학 필수 커리큘럼에서 다루는 물성치와 이를 측정하기 위한 다양한 기법들을 이해한다. 측정 기법이나 배경 이론과 관련하여 이론 수업을 병행하여 운영한다. 이러한 이해를 바탕으로 실제 작동 환경에서 센서를 제작, 설치하고 데이터 수집 장치를 통해 데이터를 취득하는 방법을 적용해 본다. 수집된 데이터에 대한 분석을 위해 기존에 배웠던 기계공학 이론을 적용함으로써, 이론과 실제의 차이와 상호간의 보완성에 대해 이해하게 된다."
                },
                {
                    "name": "동역학",
                    "description": "동역학1은 운동 중인 물체를 벡터적으로 해석하는 역학의 한 분야로서 물체에 작용하는 힘, 물체의 질량, 그리고 물체 운동간에 존재하는 관계를 다룬다. 즉 주어진에 힘에 의해 일어나는 운동을 예측하거나 또는 임의의 운동을 발생시키기 위하여 필요한 힘을 구한다. 먼저, 물체의 크기를 고려하지 않고 모든 질량이 그 질량중심에 집중되어 있는 작은 질점으로 가정을 하고 그 질점의 운동역학을 공부한다. 그리고, 그 물체의 질량중심에 대한 회전까지를 고려하는 강체의 동력학을 공부한다."
                },
                {
                    "name": "유체역학",
                    "description": "유체역학의 기초 교과목으로서 유체의 성질, 유체 내의 압력분포, 제어체적에 대한 적분관계식, 유체질점에 대한 미분관계식, 차원해석과 상사성 및 덕트내의 점성유동 등을 학습한다. 이를 통하여 유체역학의 기초원리를 이해하고 실제문제에 응용하기 위한 능력을 배양한다."
                },
                {
                    "name": "유체역학",
                    "description": "유체역학의 기초 교과목으로서 유체의 성질, 유체 내의 압력분포, 제어체적에 대한 적분관계식, 유체질점에 대한 미분관계식, 차원해석과 상사성 및 덕트내의 점성유동 등을 학습한다. 이를 통하여 유체역학의 기초원리를 이해하고 실제문제에 응용하기 위한 능력을 배양한다."
                },
                {
                    "name": "광학 이론 및 설계",
                    "description": "이 과목은 기하광학, 파동광학, 푸리에 광학 등 광학의 핵심 이론 및 원리를 심도 있게 다루고, 물리적·수치적 해석 방법을 폭넓게 익힌다. 카메라 등의 결상 광학계를 비롯한 다양한 응용·시스템의 설계 및 분석 기법을 학습하며, 이를 기계공학 분야의 계측·검사·자동화·비전 등에 적용할 수 있는 역량을 강화한다. 광학 시스템 설계의 실용적 측면에 중점을 두고, 이론 강의와 설계 실습을 통해 현대 공학에서 광학이 차지하는 핵심적 역할을 체계적으로 습득한다."
                },
                {
                    "name": "극초음속 비행체 설계",
                    "description": "수업을 통해 극초음속 비행체 설계를 위한 기초 이론을 학습하고, 실제 설계 예를 활용하여 비행궤적을 최적화한 후, 비행체의 기본 개념 형상을 직접 설계해 본다. 극초음속 비행체는 이상적으로 마하수 0에서부터 5 이상의 극초음속 비행 조건에서 작동하여야 한다. 그러나, 기존의 설계 방법론들은 정해진 하나의 순항 조건에 비행체의 설계를 최적화한다. 극초음속 순항 비행 중 비행체의 형상이 비행 성능에 지대한 영향을 미치기 때문이다. 이런 설계기법은 비행체의 기동성능과 비행궤적 선택의 자유도를 현격히 제한한다. 가변 흡입구-전방 동체-노즐 설계가 비행 미션의 자유도와 기동능력을 획기적으로 향상시킬 수 있으나, 비행체의 중량 및 복잡도와 제작 비용이 크게 증가한다는 단점이 있다. 실제로는, 극초음속 비행의 목적과 비행궤적 영역, 적재중량, 사거리, 비용 등 비행체의 설계 방향에 영향을 미치는 여러 가지 인자들이 있으나, 모든 비행 중 상황과 설계 인자들을 동시에 최적화할 방법은 없다. 다만, 기본적인 비행궤적의 영역이 어느 정도 결정된다면 기본적인 극초음속 비행체의 설계를 수행할 수 있다. 기본적인 비행궤적 최적화 기법과, 흡입구, 극초음속 비행체 설계 과정을 실습하고, 실질적인 설계 이슈와 다양한 설계 결과 예시들을 학습한다."
                },
                {
                    "name": "기계공학을 위한 머신러닝",
                    "description": "본 과정에서는 머신러닝의 기초를 수업한다. 수업 초반에는 머신러닝의 기초가 되는 확률, 선형대수, 최적화, 신호처리를 간단히 리뷰한다. 중반부에서는 대표적인 머신러닝 문제인 Classification, regression, clustering을 소개하고 예시를 통하여 개념을 학습한다. 후반부에서는 스마트 제조를 위한 센싱, 공간정보구축, 로보틱스 적용의 실습을 조별로 진행한다. 독립전원으로 구동가능한 미니PC 상에 리눅스를 운용하고, ROS SLAM 등 로보틱스와 공간지능 관련 소프트웨어를 배운다. 마지막으로는 실제 센서를 함께 구동하고 직접 데이터를 취득한 후, 수업에서 학습한 머신러닝 알고리즘을 적용해보기 위한 실습을 수행한다."
                },
                {
                    "name": "기계산업경영 2",
                    "description": "기계산업경영 1에서 보다는 세부분야의 전문가를 초빙하여 심도 있는 공부를 한다."
                },
                {
                    "name": "기계제품설계",
                    "description": "본 강의에서는 제품을 구성하는 핵심요소인 기구부 플랫폼을 창의적으로 설계하고 개발하는 능력을 연마한다. 이러한 창의적 제품 설계는 반드시 체계적인 공학설계 방법론에 따라서 수행되어야 한다. 이를 위해서 본 강의에서는 창의적인 개념을 도출하는 개념설계 방법론을 배우며, 이를 구체화하는 기본설계까지 각 단계별로 체계적인 공학설계 방법론을 배우고, 이어서 제품이 요구되는 기능을 구현하는지 검증을 할 수 있는 요소설계 지식을 배우고 응용해본다."
                },
                {
                    "name": "기계시스템설계 2",
                    "description": "기계공학의 전반적인 지식을 바탕으로 시스템의 설계에 대한 응용력을 키우고 관련된 실제적인 문제에 대한 문제 해결능력을 키우기 위하여, 다양한 학습 방법을 동원하여 진행된다. 수강생은 각자가 담당교수와 협의하여 선택한 주제에 대하여 1학기 동안 연구하며, 세미나, 발표, 토론, 실습 등을 통하여 문제해결을 모색한다."
                },
                {
                    "name": "기계시스템설계 2",
                    "description": "기계공학의 전반적인 지식을 바탕으로 시스템의 설계에 대한 응용력을 키우고 관련된 실제적인 문제에 대한 문제 해결능력을 키우기 위하여, 다양한 학습 방법을 동원하여 진행된다. 수강생은 각자가 담당교수와 협의하여 선택한 주제에 대하여 1학기 동안 연구하며, 세미나, 발표, 토론, 실습 등을 통하여 문제해결을 모색한다."
                },
                {
                    "name": "기계시스템설계 2",
                    "description": "기계공학의 전반적인 지식을 바탕으로 시스템의 설계에 대한 응용력을 키우고 관련된 실제적인 문제에 대한 문제 해결능력을 키우기 위하여, 다양한 학습 방법을 동원하여 진행된다. 수강생은 각자가 담당교수와 협의하여 선택한 주제에 대하여 1학기 동안 연구하며, 세미나, 발표, 토론, 실습 등을 통하여 문제해결을 모색한다."
                },
                {
                    "name": "기계시스템설계 2",
                    "description": "기계공학의 전반적인 지식을 바탕으로 시스템의 설계에 대한 응용력을 키우고 관련된 실제적인 문제에 대한 문제 해결능력을 키우기 위하여, 다양한 학습 방법을 동원하여 진행된다. 수강생은 각자가 담당교수와 협의하여 선택한 주제에 대하여 1학기 동안 연구하며, 세미나, 발표, 토론, 실습 등을 통하여 문제해결을 모색한다."
                },
                {
                    "name": "기계시스템설계 2",
                    "description": "기계공학의 전반적인 지식을 바탕으로 시스템의 설계에 대한 응용력을 키우고 관련된 실제적인 문제에 대한 문제 해결능력을 키우기 위하여, 다양한 학습 방법을 동원하여 진행된다. 수강생은 각자가 담당교수와 협의하여 선택한 주제에 대하여 1학기 동안 연구하며, 세미나, 발표, 토론, 실습 등을 통하여 문제해결을 모색한다."
                },
                {
                    "name": "기계시스템설계 1",
                    "description": "기계공학의 전반적인 지식을 바탕으로 시스템의 설계에 대한 응용력을 키우고 관련된 실제적인 문제에 대한 문제 해결능력을 키우기 위하여, 다양한 학습 방법을 동원하여 진행된다. 수강생은 각자가 담당교수와 협의하여 선택한 주제에 대하여 1학기 동안 연구하며, 세미나, 발표, 토론, 실습 등을 통하여 문제해결을 모색한다."
                },
                {
                    "name": "기계시스템설계 2",
                    "description": "기계공학의 전반적인 지식을 바탕으로 시스템의 설계에 대한 응용력을 키우고 관련된 실제적인 문제에 대한 문제 해결능력을 키우기 위하여, 다양한 학습 방법을 동원하여 진행된다. 수강생은 각자가 담당교수와 협의하여 선택한 주제에 대하여 1학기 동안 연구하며, 세미나, 발표, 토론, 실습 등을 통하여 문제해결을 모색한다."
                },
                {
                    "name": "기계시스템설계 1",
                    "description": "기계공학의 전반적인 지식을 바탕으로 시스템의 설계에 대한 응용력을 키우고 관련된 실제적인 문제에 대한 문제 해결능력을 키우기 위하여, 다양한 학습 방법을 동원하여 진행된다. 수강생은 각자가 담당교수와 협의하여 선택한 주제에 대하여 1학기 동안 연구하며, 세미나, 발표, 토론, 실습 등을 통하여 문제해결을 모색한다."
                },
                {
                    "name": "기계제품설계",
                    "description": "본 강의에서는 제품을 구성하는 핵심요소인 기구부 플랫폼을 창의적으로 설계하고 개발하는 능력을 연마한다. 이러한 창의적 제품 설계는 반드시 체계적인 공학설계 방법론에 따라서 수행되어야 한다. 이를 위해서 본 강의에서는 창의적인 개념을 도출하는 개념설계 방법론을 배우며, 이를 구체화하는 기본설계까지 각 단계별로 체계적인 공학설계 방법론을 배우고, 이어서 제품이 요구되는 기능을 구현하는지 검증을 할 수 있는 요소설계 지식을 배우고 응용해본다."
                },
                {
                    "name": "기계시스템설계 2",
                    "description": "기계공학의 전반적인 지식을 바탕으로 시스템의 설계에 대한 응용력을 키우고 관련된 실제적인 문제에 대한 문제 해결능력을 키우기 위하여, 다양한 학습 방법을 동원하여 진행된다. 수강생은 각자가 담당교수와 협의하여 선택한 주제에 대하여 1학기 동안 연구하며, 세미나, 발표, 토론, 실습 등을 통하여 문제해결을 모색한다."
                },
                {
                    "name": "기계시스템설계 2",
                    "description": "기계공학의 전반적인 지식을 바탕으로 시스템의 설계에 대한 응용력을 키우고 관련된 실제적인 문제에 대한 문제 해결능력을 키우기 위하여, 다양한 학습 방법을 동원하여 진행된다. 수강생은 각자가 담당교수와 협의하여 선택한 주제에 대하여 1학기 동안 연구하며, 세미나, 발표, 토론, 실습 등을 통하여 문제해결을 모색한다."
                },
                {
                    "name": "기계시스템설계 2",
                    "description": "기계공학의 전반적인 지식을 바탕으로 시스템의 설계에 대한 응용력을 키우고 관련된 실제적인 문제에 대한 문제 해결능력을 키우기 위하여, 다양한 학습 방법을 동원하여 진행된다. 수강생은 각자가 담당교수와 협의하여 선택한 주제에 대하여 1학기 동안 연구하며, 세미나, 발표, 토론, 실습 등을 통하여 문제해결을 모색한다."
                },
                {
                    "name": "기계시스템설계 2",
                    "description": "기계공학의 전반적인 지식을 바탕으로 시스템의 설계에 대한 응용력을 키우고 관련된 실제적인 문제에 대한 문제 해결능력을 키우기 위하여, 다양한 학습 방법을 동원하여 진행된다. 수강생은 각자가 담당교수와 협의하여 선택한 주제에 대하여 1학기 동안 연구하며, 세미나, 발표, 토론, 실습 등을 통하여 문제해결을 모색한다."
                },
                {
                    "name": "기계시스템설계 2",
                    "description": "기계공학의 전반적인 지식을 바탕으로 시스템의 설계에 대한 응용력을 키우고 관련된 실제적인 문제에 대한 문제 해결능력을 키우기 위하여, 다양한 학습 방법을 동원하여 진행된다. 수강생은 각자가 담당교수와 협의하여 선택한 주제에 대하여 1학기 동안 연구하며, 세미나, 발표, 토론, 실습 등을 통하여 문제해결을 모색한다."
                },
                {
                    "name": "기계시스템설계 2",
                    "description": "기계공학의 전반적인 지식을 바탕으로 시스템의 설계에 대한 응용력을 키우고 관련된 실제적인 문제에 대한 문제 해결능력을 키우기 위하여, 다양한 학습 방법을 동원하여 진행된다. 수강생은 각자가 담당교수와 협의하여 선택한 주제에 대하여 1학기 동안 연구하며, 세미나, 발표, 토론, 실습 등을 통하여 문제해결을 모색한다."
                },
                {
                    "name": "공학연구의 실습 1",
                    "description": "학부 학생들이 대학원 연구실에서 교수의 지도하에 한 학기 동안 실제적인 공학 연구에 참여하는 기회를 갖도록 한다. 이 과목을 수강하는 학생은 일주일에 1회 이상 정기적으로 지도 교수와 연구 미팅을 갖고, 학기 중에 대학원 연구에 참여하며, 학기 말에 연구 보고서를 제출하여야 한다. 연구 태도와 연구 성과를 근거로 지도교수가 S/U 학점을 부여한다."
                },
                {
                    "name": "공학연구의 실습 2",
                    "description": "공학연구의 실습 1을 수강한 학생들이 수강할 수 있는 과목이다. 학부 학생들이 대학원 연구실에서 한 학기 동안 실제적인 공학 연구에 참여하는 기회를 2회까지 가질 수 있도록 개설한다. 이 과목을 수강하는 학생은 일주일에 1회 이상 정기적으로 지도 교수와 연구 미팅을 갖고, 학기 중에 대학원 연구에 참여하며, 학기 말에 연구보고서를 제출하여야 한다. 연구 태도와 연구 성과를 근거로 지도교수가 S/U 학점을 부여한다."
                },
                {
                    "name": "광학 이론 및 설계",
                    "description": "이 과목은 기하광학, 파동광학, 푸리에 광학 등 광학의 핵심 이론 및 원리를 심도 있게 다루고, 물리적·수치적 해석 방법을 폭넓게 익힌다. 카메라 등의 결상 광학계를 비롯한 다양한 응용·시스템의 설계 및 분석 기법을 학습하며, 이를 기계공학 분야의 계측·검사·자동화·비전 등에 적용할 수 있는 역량을 강화한다. 광학 시스템 설계의 실용적 측면에 중점을 두고, 이론 강의와 설계 실습을 통해 현대 공학에서 광학이 차지하는 핵심적 역할을 체계적으로 습득한다."
                },
                {
                    "name": "기계시스템설계 2",
                    "description": "기계공학의 전반적인 지식을 바탕으로 시스템의 설계에 대한 응용력을 키우고 관련된 실제적인 문제에 대한 문제 해결능력을 키우기 위하여, 다양한 학습 방법을 동원하여 진행된다. 수강생은 각자가 담당교수와 협의하여 선택한 주제에 대하여 1학기 동안 연구하며, 세미나, 발표, 토론, 실습 등을 통하여 문제해결을 모색한다."
                },
                {
                    "name": "기계시스템설계 1",
                    "description": "기계공학의 전반적인 지식을 바탕으로 시스템의 설계에 대한 응용력을 키우고 관련된 실제적인 문제에 대한 문제 해결능력을 키우기 위하여, 다양한 학습 방법을 동원하여 진행된다. 수강생은 각자가 담당교수와 협의하여 선택한 주제에 대하여 1학기 동안 연구하며, 세미나, 발표, 토론, 실습 등을 통하여 문제해결을 모색한다."
                },
                {
                    "name": "기계시스템설계 1",
                    "description": "기계공학의 전반적인 지식을 바탕으로 시스템의 설계에 대한 응용력을 키우고 관련된 실제적인 문제에 대한 문제 해결능력을 키우기 위하여, 다양한 학습 방법을 동원하여 진행된다. 수강생은 각자가 담당교수와 협의하여 선택한 주제에 대하여 1학기 동안 연구하며, 세미나, 발표, 토론, 실습 등을 통하여 문제해결을 모색한다."
                },
                {
                    "name": "기계시스템설계 1",
                    "description": "기계공학의 전반적인 지식을 바탕으로 시스템의 설계에 대한 응용력을 키우고 관련된 실제적인 문제에 대한 문제 해결능력을 키우기 위하여, 다양한 학습 방법을 동원하여 진행된다. 수강생은 각자가 담당교수와 협의하여 선택한 주제에 대하여 1학기 동안 연구하며, 세미나, 발표, 토론, 실습 등을 통하여 문제해결을 모색한다."
                },
                {
                    "name": "기계시스템설계 2",
                    "description": "기계공학의 전반적인 지식을 바탕으로 시스템의 설계에 대한 응용력을 키우고 관련된 실제적인 문제에 대한 문제 해결능력을 키우기 위하여, 다양한 학습 방법을 동원하여 진행된다. 수강생은 각자가 담당교수와 협의하여 선택한 주제에 대하여 1학기 동안 연구하며, 세미나, 발표, 토론, 실습 등을 통하여 문제해결을 모색한다."
                },
                {
                    "name": "기계시스템설계 1",
                    "description": "기계공학의 전반적인 지식을 바탕으로 시스템의 설계에 대한 응용력을 키우고 관련된 실제적인 문제에 대한 문제 해결능력을 키우기 위하여, 다양한 학습 방법을 동원하여 진행된다. 수강생은 각자가 담당교수와 협의하여 선택한 주제에 대하여 1학기 동안 연구하며, 세미나, 발표, 토론, 실습 등을 통하여 문제해결을 모색한다."
                },
                {
                    "name": "로봇 비전",
                    "description": "로봇은 기술 발전과 수요 증가에 따라 공장 등의 제한된 환경에서 사람들이 생활하는 일상 환경으로 확장되고 있으며, 안전하고 효과적으로 로봇을 적용하기 위해서는 로봇이 사용되는 환경에 대한 이해가 필수적이다. 로봇 비전 과목은 카메라를 이용하여 로봇 주변의 3차원 공간 구조나 보행자, 차량 등 다양한 객체 등 로봇이 사용되는 주변 환경의 전반적인 인식에 관련된 다양한 문제와 해결방법을 학습하는 것을 목표로 한다. 다양한 컴퓨터 비전의 연구 분야 중 로봇에 관련된 카메라 모델, 자세 추정, 3D reconstruction, 딥러닝을 이용한 물체 인식 및 추적 등의 주제에 대해 기초적인 내용을 강의한다."
                },
                {
                    "name": "로봇공학입문",
                    "description": "본 과목에서는 로봇의 역학적 해석, 설계, 운동계획 및 제어에 필요한 기초를 공부한다. 강체운동의 수학적 표현, 현대 나선 이론, 상태 공간 및 자유도, 다물체 시스템의 기구학적 및 동역학적 해석, 독립관절 제어 등을 공부해 실제 산업용 및 서비스 로봇에 적용하는 응용사례들을 집중적으로 다룬다."
                },
                {
                    "name": "마이크로나노 가공생산",
                    "description": "제품의 소형화(miniaturization)는 현재 배경이 다른 여러 분야(IT, BT 등)에서 요구되는 기능적으로 다양한 기술이나, 그 생산기법은 각 분야를 뛰어넘는 공통성을 가지고 있다. 본 강의에서는 기본적인 마이크로, 나노스케일의 가공생산 공정기술을 학습한다. 세부적으로는 리소그래피, 에칭, 박막 증착, 평탄화 공정 등의 다양한 미세공정기술과 이들의 기본 동작 원리를 학습한다. 이를 응용하고 결합하여 복잡하고 미세한 구조 제작을 위한 공정을 설계한다. 또한, 상업적으로 성공 또는 성공 가능성이 있는 다양한 제품의 실례를 중심으로 강의를 진행한다."
                },
                {
                    "name": "메카노바이오공학",
                    "description": "메카노바이오공학은 생체 시스템에 작용하는 힘과 에너지를 해석하고 응용하는 학문이다. 본 강의에서는 세포를 중심으로 하여 생체 분자에서 조직에 이르기까지 여러 스케일에 걸쳐 생체 시스템들의 기계 역학적 상호작용을 다룬다. 세포 내부에 능동적 기계요소로서 기능하는 여러 분자들의 작동을 이해하고 세포가 어떻게 외부의 기계적 환경을 인지하는 동시에 변화시킬 수 있는지 학습한다. 또한 관련된 분자 및 세포 역학의 기본 이론들을 익힌다. 나아가 생체 시스템들의 복잡한 거동을 정밀하게 측정할 수 있는 여러 의공학 및 나노바이오 디바이스들의 원리를 이해한다."
                },
                {
                    "name": "메카트로닉스",
                    "description": "본 과목은 기계공학분야에서 메카트로닉스 시스템 구성을 위한 전기전자회로 설계, 마이크로프로세서 응용기술에 대한 이론과 실습으로 구성된다. 우선 전기/전자회로 구성을 위해서 DC 회로설계, 저항, 커패시터, RC회로, 필터회로, 다이오우드 회로, 트랜지스터, OP 앰프등의 설계 및 운용기술을 강의한다. 그리고 8086/8088/80196마이크로프로세서 시스템의 구조, 설계, 입출력 인터페이스등을 강의한다. 실습에서는 회로설계를 구현할수 있는 보드, 회로 구성요소들이 나누어지며, 매 실험에서 부과된 회로를 직접 설계 구현하도록 한다. 구체적으로는 회로설계, 마이크로프로세서 응용설계, 디지털 입출력 시스템 구현, 스테핑모터, 센서입출력등이 실험되고, 최종 학기말 프로젝트로서 각 팀별로 메카트로닉스 시스템을 설계, 제작하는 것이 부과되고, 경연대회를 통해서 성능평가를 실시한다."
                },
                {
                    "name": "메카트로닉스",
                    "description": "본 과목은 기계공학분야에서 메카트로닉스 시스템 구성을 위한 전기전자회로 설계, 마이크로프로세서 응용기술에 대한 이론과 실습으로 구성된다. 우선 전기/전자회로 구성을 위해서 DC 회로설계, 저항, 커패시터, RC회로, 필터회로, 다이오우드 회로, 트랜지스터, OP 앰프등의 설계 및 운용기술을 강의한다. 그리고 8086/8088/80196마이크로프로세서 시스템의 구조, 설계, 입출력 인터페이스등을 강의한다. 실습에서는 회로설계를 구현할수 있는 보드, 회로 구성요소들이 나누어지며, 매 실험에서 부과된 회로를 직접 설계 구현하도록 한다. 구체적으로는 회로설계, 마이크로프로세서 응용설계, 디지털 입출력 시스템 구현, 스테핑모터, 센서입출력등이 실험되고, 최종 학기말 프로젝트로서 각 팀별로 메카트로닉스 시스템을 설계, 제작하는 것이 부과되고, 경연대회를 통해서 성능평가를 실시한다."
                },
                {
                    "name": "미래자동차공학",
                    "description": "이 과목은 자동차 환경규제와 제도의 대응을 위해 개발되는 다양한 동력원시스템의 원리, 구조 및 특징, 기존자동차와 전기차 전용플랫폼의 차이와 특징 등을 공부한다. 자동차에서 요구되는 동력특성을 이해하고 동력전달장치의 구성과 에너지흐름을 공부한다. 미래자동차의 중요 분야인 첨단운전자지원시스템(ADAS)과 자율주행차의 특징을 소개한다. 자동차가 환경에 미치는 영향을 공부하고 LCA 관점에서 동력원별 온실가스배출 특성을 알아본다."
                },
                {
                    "name": "박막 유체역학",
                    "description": "반도체공정을 포함한 많은 산업 공정에서 필요한 얇은 액막의 형성 및 제어는 기계, 전기전자, 재료, 화학공학 등 다양한 분야의 지식이 모두 필요한 기술이지만, 특히 웨이퍼위에 감광액(포토 레지스트)을 도포하여 얇은 액막을 형성하는 것을 포함하는 일련의 과정은 유체역학적 분석 및 제어가 매우 중요하다. 본 강의에서는 이러한 웨이퍼 공정을 (i) 높은 점도를 가지는 액체의 관내 유동(동전기학 현상 포함), (ii) 노즐에서 나오는 제트유동, (iii) 수평면위에 수직으로 부딪히는 제트유동, (iv) 회전하는 평면위의 얇은 액막 거동으로 구분하고 각각의 유체역학적 이론 및 실용적인 이슈에 대한 학습을 한다. 또한 반도체 생산과정에서 중요한 이슈가 되는 미세입자의 거동에 대한 기초적인 내용도 학습한다."
                },
                {
                    "name": "수소에너지 실험",
                    "description": "본 교과목에서는 수전해, 연료전지 시스템을 촉매 소재 합성에서부터, 기체 확산층 및 막 전극 접합체 제작, single unit cell 결합, 시스템의 성능 측정에 이르기까지 학생들이 Hands-on 실험을 통해서 직접 시스템을 다뤄보고 작동 과정에서 발생하는 실험적인 변수들을 이해하는 것이 교육의 목표이다. 수소에너지 가치사슬에서 핵심적인 수소 생산 및 활용에 대한 기본 이론, 기술, 실험에 대해서 공부함으로써 미래 수소 경제를 이끌어 갈 수소에너지 학사 전문 인력을 양성한다. 이론과 실험 결과를 직접 비교해 봄으로써 현실 세계에서 발생할 수 있는 다양한 실험적 변수들을 직관적으로 이해할 수 있다. 전반적인 강의 내용은 다음과 같이 크게 세 주제로 구성되어 있다. 수소연료전지 및 수전해 등 수소 생산 및 활용 기술과 관련된 시스템을 설계하고 제작하며, 측정 실험을 통해 성능을 평가한다. 또한, 실습을 통해 이러한 시스템의 설계 및 운용 원리를 학습한다."
                },
                {
                    "name": "스마트 제조 실험",
                    "description": "스마트 제조는 Industry 4.0을 구현하는 중요한 개념이며, 이 수업의 목표는 학생들이 스마트 제조와 관련된 다양한 장비와 제조 프로세스를 직접 경험하는 것이다. 이론과 실험을 통하여 학생들은 스마트 제조에 사용되는 센서, IoT, 인공지능, 데이터 처리, 산업용 로봇, 협동로봇, 레이저 마커, 3D 프린터, 기계 가공 장비, 비전 시스템 등의 사용법을 배운다. 또한, 스마트 제조의 요소기술들로 구성된 간단한 데모 팩토리의 프로세스를 평가한다."
                },
                {
                    "name": "역학과 설계",
                    "description": "3차원에서의 응력과 변형률의 성질에 대해 살펴본다. 또한 구조물의 안정성에 대한 기본 이론을 소개하고 에너지 방법에 기초한 다양한 구조해석방법에 대해 논의한다."
                },
                {
                    "name": "역학과 파동",
                    "description": "탄성체에 충격이나 동적 하중이 가해지면 응력이나 변형이 역학적 파동의 형태로 전파된다. 이런 경우, 보와 같이 간단한 구조에서조차도 정적현상에서 볼 수 없는 흥미로운 현상이 발견된다. 예를 들어, 구조에 가해지는 가진 주파수에 따라 보의 거동이 크게 달라질 수 있으며 때로는 파동이 전파되지 않기도 한다. 이 강좌에서는 탄성체에서 일어나는 파동 굴절, 반사, 회절과 같은 현상이 발생하는 미케니즘을 살펴보고 동적으로 변하는 인장, 굽힘, 비틀림 하중이 보에 가해질 때, 보 내부에서 발생하는 흥미로운 파동현상을 다룬다. 또한 역학적 파동을 공학적으로 응용하고 및 제어하는 방법도 살펴본다."
                },
                {
                    "name": "열전달",
                    "description": "본 과목에서는 열이 전달되는 메카니즘과 열전달의 해석 및 응용 문제들을 학습하며 이러한 원리들이 열전달을 이용하는 기계 및 장치에 어떻게 적용되는가를 공부한다. 열전도, 열전달 계수의 개념과 강제대류와 자연대류의 해석 방법을 공부하며 복사 열전달에 관한 메카니즘을 공부한다."
                },
                {
                    "name": "열전달",
                    "description": "본 과목에서는 열이 전달되는 메카니즘과 열전달의 해석 및 응용 문제들을 학습하며 이러한 원리들이 열전달을 이용하는 기계 및 장치에 어떻게 적용되는가를 공부한다. 열전도, 열전달 계수의 개념과 강제대류와 자연대류의 해석 방법을 공부하며 복사 열전달에 관한 메카니즘을 공부한다."
                },
                {
                    "name": "전과정평가 기계공학응용",
                    "description": "전과정평가는 제품시스템 전생애주기에서의 투입물과 배출물을 정량화하여 에너지 사용량 및 환경 영향도를 평가하는 기법이다. 기후변화 대응 정책이나 환경, 사회, 기업 지배구조 측면에서도 전과정평가는 지속 가능성을 평가하는 중요한 역할을 한다. 이 강의에서는 전과정평가의 개념과 관련 국제 표준을 소개하고 다양한 전과정평가 기법 및 국제적인 데이터베이스 활용 방법을 다룬다. 학생들은 이러한 이해를 바탕으로 그룹 프로젝트를 수행한다. 각 그룹에서는 기계공학에서 다루는 제품 및 시스템을 대상으로 아이템을 선정하여 전과정평가를 수행하고, 그룹 발표 및 동료 평가를 수행함으로써 미래의 엔지니어로서 필요한 지속 가능성에 대한 소양을 갖추도록 한다."
                },
                {
                    "name": "창의공학설계",
                    "description": "이 과목은 다양하게 주어진 목표물의 설계 및 제작 실습을 통하여 설계 및 제작에 대한 기본 감각과 창조성을 키우는 데에 목적이 있다. 아직 공학의 개념이 확립되지 않은 1학년 학생을 대상으로 하여 정해진 재료를 써서 제품을 직접 만들고 그것으로 경기를 해 봄으로서 흥미를 가지고 공학의 의미를 체험할 수 있도록 한다. 제품은 여러 공학 분야의 특성을 종합적으로 표현할 수 있는 기구, 구조물 등 다양한 대상이 된다. 교과목 내용은 초기 6주간에는 설계의 기본원칙, 기구학, 가공방법 등에 관한 강의와 함께 간단한 공작기계의 작동 실습을 한다. 1주일에 강의 2시간 실습 2시간으로 구성되는 본 교과목은 학기 제7주에는 학생들이 설계, 제작할 제품의 용도와 규칙을 발표하며, 제공된 제작용 재료세트에 의하여 각자가 주어진 규칙안에서 자유롭게 설계, 제작한 제품으로 제 12주에 예비경기를 실시하고 제 13주에 본 경기를 갖는다."
                },
                {
                    "name": "학제간 캡스톤 설계",
                    "description": "기계, 전자, AI, 재료 등 다양한 공학 분야는 상호 융합을 통해 혁신적인 기술과 제품을 개발해 왔다. 이 강의는 학제 간 협업을 바탕으로 기업이 직면한 기술적 문제를 산업 AI를 비롯한 첨단 기술을 활용하여 해결하는 과정을 다룬다. 문제 정의에서 설계, 프로토타입 제작, 성과 발표에 이르기까지 캡스톤 프로젝트의 전 과정을 수행하며, 나아가 특허 출원 및 기술사업화까지도 아우른다. 이를 통해 다양한 공학적 접근 방식을 익히고, 미래 산업에서 요구되는 융합적 사고와 실전 경험을 쌓을 기회를 제공한다."
                }
            ],
            "컴퓨터공학부": [
                {
                    "name": "논리설계",
                    "description": "디지털 논리 회로는 컴퓨터 뿐 아니라 각종 디지털 전자 기기의 하드웨어를 구성하는 기본 요소이며 이 강좌를 통해서 기본 지식을 학습한다. 학생들은 논리회로를 구성하는 기본 소자, 조합회로와 순차회로의 설계 이론을 배운다. 이와 병행하여 학습한 이론을 실험을 통해 확인하여 하드웨어 설계의 기초를 공고히 한다."
                },
                {
                    "name": "시스템프로그래밍",
                    "description": "이 과목에서는 운영 체제와 시스템 프로그래밍을 학습한다. 운영 체제의 중요 개념인 프로세스 관리, 메모리 관리, 파일 시스템과 입출력, 네트워크 프로그래밍, 병렬 프로그래밍 및 동기화 관련 내용들을 배운다. 수강생은 각각의 주제에 대해 이론적인 개념을 적용하는 프로젝트를 수행하여 시스템 프로그래밍을 실제적으로 수행할 수 있는 경험을 쌓는다."
                },
                {
                    "name": "알고리즘",
                    "description": "다양한 알고리즘 개발 방법과 알고리즘 분석 기법을 배운다. 귀납적, 재귀적 사고방식을 배우고 이를 통해 문제를 접근하고 해결해나가는 방법을 배운다."
                },
                {
                    "name": "알고리즘",
                    "description": "다양한 알고리즘 개발 방법과 알고리즘 분석 기법을 배운다. 귀납적, 재귀적 사고방식을 배우고 이를 통해 문제를 접근하고 해결해나가는 방법을 배운다."
                },
                {
                    "name": "이산수학",
                    "description": "이 과목에서는 컴퓨터공학과 밀접하게 관련된 수학적 내용들에 대하여 배운다. 논리, 집합, 함수, 관계, 가산성, 조합론, 증명기법, 수학적 귀납법, 재귀함수, 재귀관계, 그래프론, 정수론 등에 대하여 다룬다. 또한, 이러한 수학적 개념들이 컴퓨터공학에서 어떻게 쓰이는지에 대해서 살펴본다."
                },
                {
                    "name": "자료구조",
                    "description": "이 과목에서는 컴퓨터에 의한 문제 해결을 위해 필요한 개념이나 대상물의 표현을 위한 자료 구조와 문제해결을 위한 체계적 사고 방법을 학습한다. 배열, 연결 리스트, 큐, 스택, 우선순위 큐 등의 기본적인 자료구조를 배우고, 검색 트리, 해시 테이블, 균형 잡힌 검색 트리 등 자료의 색인을 위한 자료구조와 그들의 효율성을 배운다. 정렬, 그래프 알고리즘 등 문제 해결에 유용한 도구와 생각하는 방법에 관한 내용도 제공한다. 프로그래밍 과제가 부여되며 이를 위한 최소한의 가이드가 제공된다."
                },
                {
                    "name": "컴퓨터구조",
                    "description": "이 과목에서는 컴퓨터를 구성하는 주요 구성 요소들의 기능과 그들 상호간의 작용을 이해하고 이를 바탕으로 컴퓨터 시스템을 구현하는데 사용되는 여러 설계 기법들을 학습한다. 명령어집합, 중앙처리장치, 파이프라이닝, 메모리 계층구조, 입출력장치 등을 다루며 컴퓨터 발전의 역사적 고찰 및 컴퓨터 시스템의 성능 분석에 필요한 지식을 배운다."
                },
                {
                    "name": "컴퓨터프로그래밍",
                    "description": "이 과목에서는 Java와 C++ 언어를 이용한 객체지향 프로그래밍을 학습한다. 학생들은 Java와 C++의 기초 및 API에 대하여 배우고, Java와 C++를 이용하여 실제 문제를 제대로 풀 수 있도록 바르게 동작하고 질 좋은 객체지향 소프트웨어를 작성하는 방법에 대하여 배운다."
                },
                {
                    "name": "현대암호학 개론",
                    "description": "이 강의에서는 블록 암호, 대칭키/공개키 암호화, 해시 함수, 메시지 인증 코드, 디지털 서명, 키 교환 등 현대 암호학의 대표적인 기술들을 공부한다. 이를 위해 데이터의 기밀성과 무결성, 인증 등 주요 안전성 개념을 정의하고 증명하는 것을 목표로 한다. 또한, 다자간 연산, 동형 암호, 영지식 증명과 차분 프라이버시 등 안전한 계산 프로토콜 구축을 위한 최신 암호기술을 안전성과 성능, 기능성 등 다양한 측면에서 설명하고 최근 연구 동향 및 대표적인 응용 분야들을 소개한다."
                },
                {
                    "name": "현대암호학 개론",
                    "description": "이 강의에서는 블록 암호, 대칭키/공개키 암호화, 해시 함수, 메시지 인증 코드, 디지털 서명, 키 교환 등 현대 암호학의 대표적인 기술들을 공부한다. 이를 위해 데이터의 기밀성과 무결성, 인증 등 주요 안전성 개념을 정의하고 증명하는 것을 목표로 한다. 또한, 다자간 연산, 동형 암호, 영지식 증명과 차분 프라이버시 등 안전한 계산 프로토콜 구축을 위한 최신 암호기술을 안전성과 성능, 기능성 등 다양한 측면에서 설명하고 최근 연구 동향 및 대표적인 응용 분야들을 소개한다."
                },
                {
                    "name": "공학연구의 실습 1",
                    "description": "학부 학생들이 대학원 연구실에서 교수의 지도하에 한 학기 동안 실제적인 공학 연구에 참여하는 기회를 갖도록 한다. 이 과목을 수강하는 학생은 일주일에 1회 이상 정기적으로 지도 교수와 연구 미팅을 갖고, 학기 중에 대학원 연구에 참여하며, 학기 말에 연구 보고서를 제출하여야 한다. 연구 태도와 연구 성과를 근거로 지도교수가 S/U 학점을 부여한다."
                },
                {
                    "name": "공학연구의 실습 1",
                    "description": "학부 학생들이 대학원 연구실에서 교수의 지도하에 한 학기 동안 실제적인 공학 연구에 참여하는 기회를 갖도록 한다. 이 과목을 수강하는 학생은 일주일에 1회 이상 정기적으로 지도 교수와 연구 미팅을 갖고, 학기 중에 대학원 연구에 참여하며, 학기 말에 연구 보고서를 제출하여야 한다. 연구 태도와 연구 성과를 근거로 지도교수가 S/U 학점을 부여한다."
                },
                {
                    "name": "데이터마이닝 개론",
                    "description": "데이터마이닝은 대용량 데이터에서 유용한 패턴을 찾기 위한 이론과 기법을 의미한다. 데이터마이닝은 웹, 사기 탐지, 추천 시스템, 사이버 보안 등 중요한 응용에 활용되고 있다. 본 과목에서는 데이터마이닝을 위한 중요 알고리즘과 이론을 설명한다. 주요 학습 주제로 mapreduce, 유사 아이템 검색, 빈발 패턴 검색, 링크 분석, 데이터 스트림 마이닝, 클러스터링, 그래프 마이닝 등을 다룬다."
                },
                {
                    "name": "소프트웨어 개발의 원리와 실습",
                    "description": "중대형 소프트웨어를 설계하고 구현하는데 필요한 실용적인 소프트웨어 개발 원리를 배우고 이 원리를 조별 프로젝트를 통해 실제로 중대형 소프트웨어를 개발하는데 적용한다. 이 경험을 바탕으로 올바르고 성능 좋은 소프트웨어를 개발할 수 있는 사고력, 자신감, 능력을 갖추도록 한다."
                },
                {
                    "name": "소프트웨어 엄밀 검증",
                    "description": "이 강의는 크게 두 부분으로 나뉜다: 기계화된 수학과 소프트웨어 검증. 첫 번째 부분에서는 컴퓨터의 도움을 받아 수학을 오류 없이 수행하는 방법을 소개한다. 특히, Coq 증명 보조 도구의 이론과 응용에 대해 배운다. 이 도구는 수학적 정의, 정리 및 증명을 엄밀하게 작성할 수 있게 해주며, 이후에 자동 증명 검사를 수행하여 그 증명의 올바름을 보장한다. 이 강의의 두 번째 부분에서는 소프트웨어 명세를 표현하는 방법, 그리고 작성된 프로그램이 주어진 명세대로 오류 없이 동작함을 엄밀하게 검증하는 방법을 소개한다. 구체적으로, Coq 내에서 Hoare 논리라고 불리는 프로그램 논리를 구현하고, 이를 사용하여 다양한 프로그램을 엄밀하게 검증한다."
                },
                {
                    "name": "오토마타이론",
                    "description": "이 교과목에서는 유한 오토마타, pushdown 오토마타, 튜링 기계 등 여러 오토마타와 정규 문법, 문맥 자유 문법, 무제약 문법 등 여러 문법체계에 대해서 배우고 그들의 관계를 익힌다. 또한 튜링의 명제와 계산 불가성에 대해서 배운다."
                },
                {
                    "name": "운영체제",
                    "description": "이과목은 운영체제가 무엇이며, 그것이 수행하는 역할은 무엇이며, 또 운영체제가 어떻게 설계되고 만들어지는지를 소개한다. 주요한 주제들로는 프로세스 관리, 저장장치 관리, 입출력 시스템, 분산처리 및 보안 등이다. 이와 함P Linux 와 같은 실제 운영체제에 대한 소개도 한다."
                },
                {
                    "name": "인공지능",
                    "description": "인공지능은 사람의 지능과 인지 기능을 흉내낼 수 있는 정보처리 모델을 연구하는 컴퓨터과학의 한 분야이다. 인공지능의 근본적인 문제로서 경험적 탐색, 추론, 학습, 지식표현 방법에 관한 이론과 근본적인 계산학적 문제들을 다룬다. 논리 기반의 정리증명, 게임이론, 지능형 에이전트 등에 관해 다루며 신경망, 진화연산, 베이지안망의 기본 원리를 학습하고 이의 응용 사례로서 전문가시스템, 컴퓨터비전, 자연언어처리, 데이터마이닝, 정보검색, 바이오정보학 등의 분야에 대해 살펴본다."
                },
                {
                    "name": "인터넷 보안",
                    "description": "컴퓨터 및 인터넷이 사회 인프라로 사용됨에 따라 IT 시스템에서 보안 요구사항, 보안 기본 동작, 보안 시스템의 약점 등을 이해하는 것이 컴퓨터공학자에게는 점점 더 요구되고 있다. 인터넷 보안 시스템을 근본적으로 이해하기 위해서는 암호기술 및 그 수학적 원리를 알아야 가능하다. 본 강의에서는 먼저 암호 기술들을 이해하기 위해 필요한 정수론, 이산 로그, 소인수분해, 해시 함수 등을 설명한다. 그 뒤에는 대칭키 암호기법, 공개키 암호기법, 디지털 서명, 키 관리 등 기본 보안 기술을 다루고, 마지막으로 그 뒤에 공개키기반구조(PKI), 비트코인, TLS, 웹 보안, Tor 등 응용 보안 기술을 다룬다. 본 과목은 컴퓨터 공학을 전공 혹은 부전공으로 하는 학부생들을 대상으로 하며, 학생들이 일반 고등학교 수학과 이산수학을 수강하였으면 무리 없이 본 강의를 수강할 수 있도록 강의 내용을 개발할 것이다."
                },
                {
                    "name": "임베디드시스템과 응용",
                    "description": "본 과목의 전반부에서는 ARM 기반의 내장형 시스템 하드웨어의 이해와 주요 부분에 대한 설계 지식을 습득 한다. 기존 컴퓨터구조 및 관련 과목에서 마이크로프로세서 위주로 컴퓨터 구조를 소개하는 것에 대응하여, 본 과목에서는 메모리 시스템, 입출력 및 버스 등의 구조를 강조하여 소개하여, 내장형 시스템 전체의 하드웨어의 이해와 설계 능력을 배양하는데 그 목표를 둔다. 본 강의의 후반부에서는 내장형 시스템을 구성하는 주요 소프트웨어 구성 요소들을 소개하고 내장형 시스템이 요구하는 설계의 요건들을 만족하기 위한 설계 기법들을 학습한다. 실시간 OS, 디바이스 드라이버 등의 기능들을 소개하고 내장형 시스템의 주요 응용 (예: 멀티미디어 응용)에 대해서도 익힌다. 개발된 시스템의 성능 평가 및 성능 최적화 기법을 다루며 내장형 소프트웨어를 위한 검증 기법을 학습한다."
                },
                {
                    "name": "자연언어처리 개론",
                    "description": "본 과목은 자연어 이해를 위한 확률 및 딥러닝 학습 방법론을 다룬다. 자연어 이해는 인공 지능에서 크게 주목받고 있는 영역으로 활용 범위가 웹 검색, 번역, 대화 모델 등으로 다양하다. 자연어 이해에서 성공적인 모델은 확률기반, 딥러닝 기반, 대형 언어모델 기반 모델 등이 있다. 본 과목에서는 이러한 다양한 모델을 이해하고, 디자인하고 구현하고 평가하는데 요구되는 최신 기술들을 다룬다. 1. 과목소개 2. Bag-of-word 언어모델 3. N-gram 언어모델 4. Bayesian 모델 5. Logistic 회귀 6. 임베딩 7. CNN 8. RNN 9. Transformer 10. 문맥적 임베딩 11. 지식 구축 및 활요 12. 언어에서의 AI 편향성"
                },
                {
                    "name": "전기전자회로",
                    "description": "본 강좌에서는 전기,전자회로의 기본 지식을 학습한다. 저항 회로를 중심으로 회로를 분석하는 일반적인 방법을 배우고 캐패시터와 인덕터 회로를 시간 영역과 주파수 영역에서 분석하는 방법을 배운다. 또한 전자회로의 핵심 소자인 MOS와 Bipolar 트랜지스터의 특성을 학습하고 논리 회로와 증폭회로의 원리를 배운다. 이 과목을 통해서 디지털 하드웨어의 전기적인 특성, 속도와 에너지 소모에 대한 기초지식을 습득한다."
                },
                {
                    "name": "창의적통합설계1",
                    "description": "본 강의는 소프트웨어/하드웨어 설계 실습을 위주로 하며 다음과 같이 이루어진다. 참여 기업은 4명 내외의 그룹이 1-2 학기 동안(학기에 평균 학생당 60시간 투여)에 할 수 있는 프로젝트 리스트를 제안하고, 학생들은 적당한 그룹을 조직하여 해당 기업의 프로젝트를 수행하며, 학기 중 개발 지도는 회사와 지도교수의 협조로 이루어진다. 학기말에는 각 그룹이 진행한 프로젝트에 대한 전체적인 평가와 발표가 이루어진다."
                },
                {
                    "name": "컴퓨터융합응용",
                    "description": "컴퓨터기술이 전통적인 전자계산 (computing)의 범주를 벗어나서 다른분야와 융합하는 현상은 이제 아주 분명한 정보사회의 흐름으로 나타나고 있다. 본 과목에서는 컴퓨터기술이 다양한 분야 (생명공학 BT, 금융분야 Finance, 미래 자동차 분야 Car Telematics, 휴대 단말기 분야 Handset Devices, etc) 등과 융합되는 과정을 공부하고, 융합에 필요한 기술과 아이디어를 실습하는 내용으로 구성된다."
                },
                {
                    "name": "컴퓨팅 살펴보기",
                    "description": "본 과목의 목표는 학부 신입생들에게 컴퓨팅분야(Computer Science and Engineering)의 전공과정을 시작하는 시점에서 이 분야의 다양한 면을 조망할 수 있는 시각을 형성해준다. 청소년 시절에 매스컴을 통해서 접하는 컴퓨팅분야는 응용에 치우치는 모습이기 쉽다. 이 과목에서는 전공을 시작하는 학생들이 컴퓨팅 분야의 핵심 원천 성과들과 앞으로 필요한 성과들을 살펴보게 된다. 컴퓨터공학부의 9개 연구교육 스트림(그래픽스 및 사람 중심 컴퓨팅, 네트워크 시스템, 데이터 시스템, 시스템 소프트웨어, 알고리즘 및 정보 보안, 양자 컴퓨팅, 인공지능, 컴퓨터 구조 및 임베디드 시스템, 프로그래밍 원리 및 도구)에서 각 교수들이 참여하여 학부 신입생들에게 각 분야에서 어떤 근본적인 성과가 있었는지, 그 성과가 나온 과정, 분야의 다양함, 분야마다 풀고 싶은 문제들, 풀어야만 하는 문제들, 아직 풀리지않은 문제들, 그런 문제를 꿈꾸는 계기등을 전달해 준다. 이를 통해서 신입생들은 앞으로의 학위과정을 바라보는 균형있는 시각을 갖추게되고, 각자가 꿈꾸는 커리어를 설계하는 데 도움을 받게 된다."
                },
                {
                    "name": "프로그래밍연습",
                    "description": "프로그램의 경험이 없는 초보자를 위해서 C 프로그래밍 언어의 문법과 기초 프로그래밍 기법을 강의한다. 프로그래밍 실습을 통하여 프로그래밍 실력을 배양시키는 것이 강의의 목표이다."
                },
                {
                    "name": "프로그래밍의 원리",
                    "description": "이과목은 기계중심/구현중심의 프로그래밍을 보완하는 논리중심/기획중심의 프로그래밍 기술을 익히도록 한다. 학생들이 프로그램 작성의 기본 원리, 구성 요소, 프로그래밍 미학등을 습득하게 함으로써, 소프트웨어 시스템이 드러내는 복잡성을 손쉽게 다룰 수 있는 능력과 자신감을 익히게 한다. 더군다나, 프로그램이 기계를 사용하기 위한 도구라는 제한된 시각에서 벗어나 기계가 프로그램 실행을 위한 도구라는 시각을 갖추도록 보정해준다. 이 강의는 프로그래밍 연습(training)이 아니라 프로그래밍 교육(education)이다. 실습언어는 학생들이 명료하고 효과적으로 생각할 수 있게 하는 프로그래밍 교육에 적절한 ML과 Scheme이다. 대형 소프트웨어를 2명이상의 팀이 기획하고, 구현하고, 형상 관리하는 과정을 프로젝트를 통해 익힌다. 대형 소프트웨어를 구성하는 프로젝트를 학기말에 요구한다."
                }
            ],
            "산업공학전공": [
                {
                    "name": "데이터관리와 분석",
                    "description": "본 과목에서는 정형 데이터와 비정형 데이터를 효과적으로 관리하고 분석하는 데에 필요한 제반 이론 및 기법을 배운다. 구체적으로, 본 과목의 전반부에서는 데이터베이스 (DB)를 기반으로 한 정보 시스템의 설계 및 구현, 그리고 DB 마이닝과 DB 기반 추천 시스템과 관련된 모형과 기법을 다루고, 후반부에서는 텍스트 데이터를 대상으로 정보 검색, 문서 분류 및 군집화를 위한 주요 이론과 방법론들을 소개한다. 아울러, 본 과목은 소개된 모형 및 기법들을 구현하여 다양한 형태의 데이터에 실적용해보는 프로젝트들을 포함하는 바, 이를 통해 실제 문제에 대한 해결 능력을 기르고, 관련된 기술적 이슈들을 경험해보는 것을 목표로 한다."
                },
                {
                    "name": "생산관리",
                    "description": "생산시스템의 운영과 관련된 제반문제들의 해결을 위한 계량적 접근방법을 소개하고 이를 이용한 생산시스템의 효율적인 관리 및 통제기법을 소개하며, 글로벌 시대에 요구되는 고객만족 설계와 물류관리 혁신, CALS/EC, ERP기법을 소개하고 있다. 주요 내용으로는 생산시스템에 대한 기본개념, 고객 만족, 생산기획, 물류관리, 생산일정계획, 생산성 향상 공장자동화와 생산전략 등을 포함하고 있다."
                },
                {
                    "name": "인간공학",
                    "description": "Man-Machine-Computer-Environment의 total integrated system effectiveness를 향상시키기 위한 human capability, limiting function, performance output의 측정, 변수의 선정, 분석, 평가, 개선을 위한 설계과정을 심리학, 사회학, 생리학, 역학 등의 방법론을 동원하여 훈련한다. 위의 목적을 이루기 위한 방안으로서 input 기능과 신뢰도, information processing 기능과 측정, output의 분석 및 주위환경의 변화가 인간성능에 미치는 내용을 주요 강의 내용으로 구성한다."
                },
                {
                    "name": "인간공학실험",
                    "description": "Man-Machine-Computer-Environment의 total integrated system effectiveness를 향상시키기 위한 human capability, limiting function, performance output의 측정, 변수의 선정, 분석, 평가, 개선을 위한 설계과정을 심리학, 사회학, 생리학, 역학 등의 방법론을 동원하여 훈련한다. 위의 목적을 이루기 위한 방안으로서 input 기능과 신뢰도, information processing 기능과 측정, output의 분석 및 주위환경의 변화가 인간성능에 미치는 요인들에 대한 실험으로 구성한다."
                },
                {
                    "name": "공학연구의 실습 1",
                    "description": "학부 학생들이 대학원 연구실에서 교수의 지도하에 한 학기 동안 실제적인 공학 연구에 참여하는 기회를 갖도록 한다. 이 과목을 수강하는 학생은 일주일에 1회 이상 정기적으로 지도 교수와 연구 미팅을 갖고, 학기 중에 대학원 연구에 참여하며, 학기 말에 연구 보고서를 제출하여야 한다. 연구 태도와 연구 성과를 근거로 지도교수가 S/U 학점을 부여한다."
                },
                {
                    "name": "공학도를 위한 창의적 사고",
                    "description": "본 과목의 목적은 공과대 학부 과정 학생들을 대상으로 신제품, 신서비스의 개발과 어려운 공학적 문제의 해결을 위한 창의적 사고 기법들을 소개하고, 이를 응용하는 능력을 배양시키는 데 있다. Brainstorming, mind mapping, lateral thinking, TRIZ, attribute listing and morphological analysis, transformation theory, physical stress reduction principles, portability design principles 등의 기법을 다루게 된다. 수강생들은 다수의 설계 및 기획 문제를 과제로서 해결하고 그룹 프로젝트를 수행함으로써, 습득한 지식을 실제 문제 해결에 응용하는 능력을 배양하게 된다."
                },
                {
                    "name": "공학연구의 실습 1",
                    "description": "학부 학생들이 대학원 연구실에서 교수의 지도하에 한 학기 동안 실제적인 공학 연구에 참여하는 기회를 갖도록 한다. 이 과목을 수강하는 학생은 일주일에 1회 이상 정기적으로 지도 교수와 연구 미팅을 갖고, 학기 중에 대학원 연구에 참여하며, 학기 말에 연구 보고서를 제출하여야 한다. 연구 태도와 연구 성과를 근거로 지도교수가 S/U 학점을 부여한다."
                },
                {
                    "name": "산업 텍스트 애널리틱스",
                    "description": "본 강의에서는 다양한 산업에서 발생하는 텍스트 데이터에 대한 이해와 함께, 이에 대한 분석 기법들을 학습하는 것을 목적으로 한다. 크게 텍스트 데이터의 이해, 텍스트 데이터의 전처리 및 표상화, 언어 모델의 구조 이해, 그리고 텍스트 데이터의 응용 과업 등의 네 가지 파트로 구성하여 강의를 진행한다. 텍스트 데이터의 이해 파트에서는 제조업, 마케팅, 금융 등의 비즈니스에서 발생하는 텍스트 데이터의 특징과 이에 대한 활용 사례를 주로 다룬다. 텍스트 데이터의 전처리 및 표상화 파트에서는 전통적인 bag-of-words 방식을 포함하여, word2vec, GloVe, Fasttext와 같은 신경망 기반의 텍스트 표상화 방법을 강의한다. 언어모델의 구조 이해 파트에서는 Seqence-to-sequence Learning과 Transformer 구조에 대한 이해를 바탕으로 BERT 및 GPT 등의 대표적인 언어모델 구조를 강의한다. 마지막으로 텍스트 데이터의 응용 과업 파트에서는 감성 분석, 문서 요약, 질의 응답 등의 실제 비즈니스에서 자주 사용되는 텍스트 데이터 분석 과업을 소개하고 이를 해결하기 위한 적절한 방법론을 강의한다."
                },
                {
                    "name": "산업경영수리기법",
                    "description": "산업공학과 경영과학에 필요한 수리적 이론과 과학계산 기법을 제공하는 것을 목적으로 하며 구체적인 내용은 행렬계산, 미분방정식, 푸리에 변환, MCMC 등을 기본적인 방법론으로 하여 산업공학에서 제기되는 다양한 수학적, 계산적 문제들을 MATLAB 또는 R 프로그래밍을 사용하여 분석하는 능력의 배양에 초점을 맞춘다."
                },
                {
                    "name": "산업공학개론",
                    "description": "산업공학은 인간, 물질, 기계 및 환경으로 구성된 종합적인 시스템에 대한 설계, 해석, 평가 및 제어에 관한 학문으로 이에 대한 개괄적이고 총체적인 내용을 소개하고 이를 이해하는데 그 목적이 있다."
                }
            ],
            "에너지자원공학과": [
                {
                    "name": "에너지자원 전달 현상",
                    "description": "본 교과목은 에너지자원 분야의 열, 물질, 운동량의 전달 현상을 이해하고 전달 방정식의 풀이 방법을 학습하는 것을 목표로 한다. 전반부에서는 전달 현상의 기본 원리를 다루며, 유체역학적 개념을 포함한 열, 물질, 운동량 전달 방정식을 학습한다. 전달 방정식을 풀이하고 전달 현상을 해석하기 위해 해석적 및 수치적 기법을 배운다. 후반부에서 학생들은 상용 시뮬레이터를 이용하여 에너지자원 분야의 복잡한 물리적 시스템의 전달 현상 예제 실습을 수행한다."
                },
                {
                    "name": "에너지자원공학실습",
                    "description": "에너지자원공학실습은 1학년 2학기 전공필수 교과목으로 1학년 1학기에 개설된 ‘에너지자원공학의 이해’ 교과목을 수강한 학생들을 대상으로 한다. 본 교과목은 1학년을 위한 현장실습 교과목으로, 에너지자원분야 산업현장을 방문하여 1학기 에너지자원공학의 이해 수업에서 학습한 기초이론과 응용기술을 실습과정을 통하여 체험한다."
                },
                {
                    "name": "에너지자원유체역학",
                    "description": "강좌는 다공성매질, 균열암반, 시추공 및 송유관에서의 유체유동, 지하구조물에서의 통기 등 에너지자원공학 분야에서 필수적으로 갖추어야 할 유체역학 지식을 습득하는 데 있다. 통상적인 유체역학 기본원리인 유체의 성질, 유체정역학 및 유체동역학, 이상 유체 및 비압축성 유체와 관련된 기초 방정식 소개 및 유도, 나비에 스토크스 방정식(Navier Stokes Equation), 실제유체의 유동, 관유동, 판유동, 유체마찰, 상사율과 차원해석 등을 다룬다. 유체역학 기본원리가 에너지자원공학 분야에 적용되는 사례에 대한 학습을 통해 유체역학의 활용성에 대한 이해도를 향상시킨다."
                },
                {
                    "name": "에너지자원처리공학",
                    "description": "본 교과목에서는 천연광물 및 폐자원의 품위를 향상시키기 위한 물리화학적 처리법인 자원처리에 대해서 학습한다. 천연광물 및 폐자원은 다양한 불순물을 함유하고 있어 산업원료로 활용하거나 또는 제련공정 원료로 사용 전 정제과정이 필요하다. 이러한 정제기술은 광범위한 기초 학문을 바탕으로 개발되었으며 본 과목에서는 파분쇄에 의한 단체분리, 분립/분급 및 중력선별, 자력선별 및 부유선별 등과 같은 선별법에 대해서 학습한다."
                },
                {
                    "name": "에너지환경기술경영",
                    "description": "에너지환경기술경영은 에너지와 환경문제가 공학기술과 만났을 때 일어나는 다양한 현상 중 특히 공과대학생이 간과하기 쉬운 경제?경영적인 측면을 분석하고 토론하는 교과목이다. 강의의 주요 내용은 경제성분석, 에너지산업경영분석, 그리고 기술대안분석 등이며 경쟁형 팀별 실습 및 토론에 중점을 두어 수업을 진행한다."
                },
                {
                    "name": "에너지자원지구화학",
                    "description": "미래의 주요 산업들에서 수요가 증가할 것으로 예상되는 광물 자원 및 에너지 자원에 대해 알아보고, 해당 자원의 회수법에 대한 지식을 습득한다. 응집/침전, 흡착, 증류/결정화, 분리막, 액체추출 등 다양한 공정을 이용한 회수법에 대해 학습하며, 전극을 이용한 전기화학적 회수 또한 소개한다. 특히, 주요 광물들의 개발 시 사용되던 전통적인 회수법과 새로이 자원의 source로 대두되고 있는 오염수 등 에 적용되는 회수법들의 차이점 및 공통점에 대해 학습한다. 또한, 자원회수법 중 전극을 이용한 전기화학적 회수에 대해 이해하기 위하여 전기화학의 기초 지식을 습득하고 그 응용 분야에 대해 학습한다."
                },
                {
                    "name": "암반공학응용 및 설계",
                    "description": "암석역학의 기본이론에서 출발하여 보다 심화된 이론들을 공부하며 지하광산의 안정성해석 및 설계에 초점을 맞추어 강의를 진행한다. 주요 주제로는 응력과 변형률, 암반구조와 분류, 암석강도와 변형성 등의 암반공학 이론과 층상암반에서의 굴착, 블록암반에서의 굴착, 채광 및 지보 등이 있다."
                },
                {
                    "name": "에너지사업 타당성평가",
                    "description": "신재생에너지 및 기존 에너지 사업의 사업 타당성 평가 수행을 위해 주요 요인들을 분석하는 기법들을 교육한다. 경제적 평가 (비용-편익, 순현재가치), 태양에너지 풍력에너지에 대한 자원량 평가, 부지의 환경 및 지반 안정성 평가, 환경적 평가에 대한 전반적인 이론적 수업과 더불어 자원량 계산, 발전시설 부지의 지반 안정성, 지리정보시스템 (Geographic Information Systems)을 이용한 다변량 입지분석 (지형, 접근성, 지반 조건, 기후, 자원량 등), 전과정평가 (LCA, Life Cycle Assessment) 기반의 환경적 영향 분석, 에너지 믹스와 신재생에너지 사업 타당성 평가 사례를 다룬다. 석유, 천연가스 기반의 전통적인 에너지 사업과 신재생에너지 사업의 비교 분석을 통해 의사결정을 위한 평가 기법을 배우게 된다."
                },
                {
                    "name": "에너지자원순환공학",
                    "description": "본 교과목은 미래 주요 산업들에서 수요 증가가 예상되는 광물 및 에너지 자원에 대해 강의하고, 해당 자원 내 유가금속 회수에 대한 기초 지식 및 각 회수 공법들에 대해 가르친다. 이를 위해, 자원의 회수 및 정제에 필수적인 물질전달 및 확산 현상을 이해하고, 다양한 회수 공정의 원리와 적용 사례를 다룬다. 강의는 전처리 및 분리/회수 기술을 중심으로 진행되며, 대표적인 습식 및 건식 공정을 포함한다. 학생들은 본 수업을 통해 에너지 자원의 순환과 지속가능한 활용을 위한 주요 회수 공정의 핵심 기술을 익히고, 자원 재활용 및 순환을 포함한 다양한 산업 현장에서 적용 가능한 실무 능력을 기른다."
                },
                {
                    "name": "에너지자원물리화학 2",
                    "description": "물리화학 중 동역학에 해당하는 내용을 다루는 교과목으로, 에너지화학의 반응속도론과 자원의 정제를 이해하기 위해 핵심적인 기반이 되는 물리화학 개념을 습득하는 것을 목표로 한다. 액체와 기체 내에서의 분자의 움직임에 대해 학습한 뒤 화학 반응의 속도에 영향을 미치는 여러 요인을 반응 메커니즘과 에너지의 관점에서 이해한다. 고체의 표면에서 일어나는 촉매 반응과 전기화학 반응에 대해서 배운다. 이를 바탕으로 금속 자원의 정련과 제련, 에너지 변환 및 저장 분야에 대한 응용력을 습득한다."
                },
                {
                    "name": "에너지자원공학개론",
                    "description": "석유·가스 등의 전통적 에너지 및 비재래 에너지, 신재생 에너지를 포함하여 에너지·자원의 전반에 대하여 소개한다. 에너지의 정의와 역사, 환경, 소비구조 현황, 전망에 대해 배운다. 석유·가스의 탐사 및 개발기술, 생산현황과 전망에 대하여 학습하고, 태양열, 풍력, 수소, 지열, 연료전지, 조력, 바이오매스 등 재생에너지의 종류와 특성, 소비현황, 기술개발현황에 대해 학습한다."
                },
                {
                    "name": "에너지환경 전기화학시스템",
                    "description": "본 강좌는 에너지자원 및 환경 분야에서 이용되는 다양한 전기화학 시스템 전반에 걸친 심도 있는 이해와 응용력 배양을 목표로 한다. 여러 작동 방식의 정적, 동적 전기화학 시스템들을 자세히 배운다. 이러한 전기화학 시스템들이 사용되고 있는 전해제련과 전해정련 등 에너지자원 분야의 공정, 에너지 변환 및 저장 장치, 이산화탄소 저감을 위한 관련 환경 기술들을 학습한다. 탄소중립 에너지 발전을 위한 차세대 전기화학 시스템과 앞으로의 발전 방향에 대해 논의한다."
                },
                {
                    "name": "중자력 및 전자기탐사",
                    "description": "이 과목에서는 자원탐사 및 지구조 해석연구에서 기본적으로 수행되는 중자력탐사와 광물자원탐사 및 지하수 탐사 등에 주로 이용되는 전기탐사와 전자기탐사에 대해 학습한다. 중력, 자력, 전기·전자탐사법 각각에 대해 기본원리, 자료획득, 자료처리, 자료해석 방법을 학습한다. 자료획득 부분에서는 탐사측선의 설계 방법, 탐사장비의 원리, 다양한 자료취득 방법에 대해 배우고 실습한다. 자료처리의 원리를 학습한 후 자료처리 소프트웨어를 이용하여 자료처리과정을 실습하고, 최종적으로 얻어지는 자료해석 단면의 해석 방법에 대해 학습한다. 특히, 다양한 현장 적용 사례를 소개하면서 물리탐사의 장단점 및 물리탐사 적용 시 문제점을 다룬다."
                },
                {
                    "name": "중자력 및 전자기탐사",
                    "description": "이 과목에서는 자원탐사 및 지구조 해석연구에서 기본적으로 수행되는 중자력탐사와 광물자원탐사 및 지하수 탐사 등에 주로 이용되는 전기탐사와 전자기탐사에 대해 학습한다. 중력, 자력, 전기·전자탐사법 각각에 대해 기본원리, 자료획득, 자료처리, 자료해석 방법을 학습한다. 자료획득 부분에서는 탐사측선의 설계 방법, 탐사장비의 원리, 다양한 자료취득 방법에 대해 배우고 실습한다. 자료처리의 원리를 학습한 후 자료처리 소프트웨어를 이용하여 자료처리과정을 실습하고, 최종적으로 얻어지는 자료해석 단면의 해석 방법에 대해 학습한다. 특히, 다양한 현장 적용 사례를 소개하면서 물리탐사의 장단점 및 물리탐사 적용 시 문제점을 다룬다."
                }
            ],
            "연합전공 인공지능": [
                {
                    "name": "인공지능 이론 및 응용 세미나",
                    "description": "기업체 전문가, 해당분야 연구실 교수가 강의하며, 인공지능의 코어 기술과 응용의 최신 연구, 개발 트렌드를 소개한다. 각 분야별로 현재 및 미래의 중요한 인공지능 문제들을 소개하고, 이를 접근하기 위한 가용 학습데이터, 그리고 이를 이용한 최신 인공지능 설계기술 및 응용현황을 소개한다. 구체적으로는, 비전/음성/텍스트의 전통적인 문제, 학습데이터와 솔루션 뿐 아니라 인공지능 기반 시스템의 형평성, 개인데이터 기반 학습결과의 저작권, 공공데이터의 활용 방안 등 인공지능의 응용분야가 넓어지며 만나게 되는 새로운 이슈들에 대한 소개와 토의를 진행한다."
                },
                {
                    "name": "AI와 법",
                    "description": "인공지능 기술의 도입은 다양한 법적 제도적 이슈들을 제기한다. 인공지능 기술의 도입이 가져오는 사회적 경제적 변화는 어떠한 것인지 살펴보고, 그와 함께 고려해야 할 법제도적 이슈들이 어떤 것인지 파악하고 정리해 보는 기회를 갖도록 한다. 인공지능의 작동방식에 대해 재검토하고, 인공지능이 인터넷 플랫폼, 검색, 프로파일링 등 다양한 영역에 미치는 영향을 검토하고, 금융이나 의료 등 개별 산업에는 어떠한 변화를 가져오는지 살펴본다. 그와 함께, 새로이 제기되는 법제도적 이슈들에 대해 검토한다. 법적 책임에 관한 문제를 비롯하여, 공정성이나 차별의 이슈, 데이터 활용과 관련된 프라이버시 이슈 등 관련된 다양한 이슈들에 대해 논의하도록 한다."
                }
            ],
            "연합전공 지능형통신": [
                {
                    "name": "이동통신 표준 및 상용망의 이해",
                    "description": "이동통신 시스템을 구현하기 위한 핵심 기술을 담고 있는 ITU-R 및 3GPP 표준, 특히 3GPP 표준의 구성을 체계적으로 이해하고, 표준화 과정에 대해 파악하며, 표준을 기반으로 구축된 상용망의 특징에 대해 학습한다. 3GPP 표준의 이해를 위해 단말, 엑세스망, 코어망, 외부망으로 구성된 이통통신 시스템 구조 (system architecture)를 사용자 평면 및 제어 평면 관점에서 표준문서 별로 분석하는 과정을 LTE 및 5G 표준에 대해 진행한다. 이를 위해 Release 10-12 표준문서 및 Release 13-16 (또는 17) 표준문서들 중 주요 문서들을 활용한다. 표준에 대한 이해 및 상용망에 관한 이해를 심화하기 위해, 단말, 엑세스망, 코어망 각각에 대해 프로젝트 팀을 구성하고, 표준이 고도화됨에 따라 기술들이 발전해 가는 과정 및 기술간 상관관계를 체계적으로 이해할 수 있는 발표회를 프로젝트 팀별로 표준 문서, 기술 백서, 최신 논문 등에 기반하여 진행한다."
                }
            ],
            "연합전공 인공지능반도체공학": [
                {
                    "name": "인공지능 반도체 소자 설계 프로젝트",
                    "description": "CMOS 반도체 소자 제작은 다양한 단위 공정으로 구성된다. 이온주입공정, 사진공정, CVD공정, 산화공정, 건식식각공정, 금속화공정 등의 CMOS 공정에 필요한 단위공정의 일부 혹은 전 과정을 실습함으로써, 강의를 통하여 습득한 지식을 검증하고 제작 과정에서 발생하는 문제점을 해결한다. 이 프로젝트에서는 반도체 소자의 개발 및 검증 이르는 적절한 모든 과정들을 수행하며, 프로젝트 진행 과정에 관하여 설명하는 결과 보고서 및 제작품의 특성을 설명하는 구두 발표를 포함한다."
                },
                {
                    "name": "인공지능 반도체 회로 설계 프로젝트",
                    "description": "AI용 응용 혹은 서비스의 처리과정을 구현한 시스템반도체 회로 설계 프로젝트를 수행한다. CPU, GPU, AP, microcontroller, DSP등의 프로세서, 모뎀등 통신용 반도체, 이미지 센서등 다양한 센서 반도체 및 구동회로등 다양한 시스템반도체 개발을 위한 아키텍처, 하드웨어 회로 설계, 및 구현 과정들을 수행한다. 설계된 회로의 동작 검증을 위하여 시뮬레이션을 통한 모의 검증, FPGA 구현 검증, 혹은 칩 제작을 통한 검증을 수행한다. 또한, 프로젝트 진행 과정에 관하여 설명하는 결과 보고서 및 제작품의 특성을 설명하는 구두 발표를 포함한다."
                },
                {
                    "name": "인공지능시스템 설계 프로젝트",
                    "description": "본 과정에서는 인공지능에 대한 개요 및 deep learning에 대해 이해하며 TensorFlow 개념 및 기초 programming 실습을 진행한다. 그리고 Deep Learning 기반 Object Detection 방법과 무인점포 개발 응용을 위한 학습 trainset 자동 생성 방법을 실습을 통해 익힌다. 또한 AI Chip이 내장된 NPU 가속기 Board와 nVidia Jetson TX2 Board를 이용하여 YOLO V3 Object Detection 실습을 진행한다. 마지막으로 nVidia CUDA를 이용한 GPU Programming 개념 및 병렬 Programming 실습을 통해 GPU 구조에 대해 배운다."
                }
            ]
        },
        "자연과학대학": {
            "자연과학대학": [
                {
                    "name": "과학, 권력, 그리고 돈",
                    "description": "본 교과목은 과학기술이 어떻게 국가와 산업과 관계를 맺으면서 성장해 왔는지, 그리고 그 과정에서 어떻게 과학기술이 권력과 부의 원천으로서 등장하게 되었는지를 개괄한다. 과목의 전반부에서는 20세기 과학이 국가와 산업에 어떻게 밀접하게 관계를 맺게 되었는지를 다루며, 거대과학, 정보 및 데이터 과학, 생의학 및 생명공학 연구, 환경과학 등의 영역의 부상과 그 특징을 다룬다. 이를 통해 과학의 정치경제학에 관련된 이론적 논의와 사례 등에 살펴볼 것이다. 과목의 후반부에서는 21세기 BT, AI, 실리콘밸리의 주요 혁신 사례들을 중심으로 과학의 상업화, 지식재산, 과학과 국가안보 및 외교, 창업가형 과학자, 혁신과 사회정의 등 과학기술학의 주요 논의들을 다루며 과학과 권력, 부의 관계의 진화와 바람직한 지향 등을 논의할 것이다. 본 교과목은 이공계 전공 학생에게 과학기술사, 과학기술과 경제, 과학기술과 법의 주요 이슈들에 대한 토론을 통해 향후 다양한 차원에서 과학기술 관련 커리어를 전망하는데 도움을 줄 수 있고, 인문사회계 학생들 또한 21세기 과학기술사회를 이해하고 전망하는데 도움이 될 수 있을 것이다."
                },
                {
                    "name": "과학과 근대사회",
                    "description": "과학혁명 이후의 근대과학분야들의 발전, 이에 대한 사상적, 사회적, 제도적 요소들의 영향을 다룬다. 주된 내용으로 근대 사회 형성에 있어서의 과학의 역할, 과학단체와 과학의 전문직업화, 과학과 기술, 과학과 종교, 현대 과학분야들의 출현, 현대적 과학연구활동의 출현, 과학과 현대 사회 등을 포함하며, 과학이 현대사회에서 중요한 요소가 되게 된 과정을 특히 주목한다."
                },
                {
                    "name": "과학기술과 법",
                    "description": "이 과목은 현대 사회에서 점점 더 빈번하게 일어나는 과학기술과 법의 접점과 상호작용에 대해서 다룬다. 과학기술과 법의 상호작용에 대해서 이해하는 것은 이공계를 전공하는 학생들에게 현대 사회 속에서 과학기술의 역할을 더 잘 이해할 수 있게 한다. 수업에서 다루는 주제는 과학적 사실과 법적 사실, 증거의 의미, 정보통신기술과 법, 생명공학과 법, 신경과학과 법, 규제과학과 같은 주제를 포함한다. 몇 가지 주제에 대해서는 법학전문대학원의 교수들을 초빙해서 초청강연을 들을 계획이다. 이 수업은 이공계학생들을 위해서 개설되는 것이지만, 과학기술사회를 더 잘 이해하고 싶은 인문사회계열 학생이나 법학전문대학원 학생에게도 도움이 될 수 있다."
                },
                {
                    "name": "뇌인지과학의 이해",
                    "description": "본 교과목의 목적은 학부생들이 인간을 비롯한 동물의 고등인지 기능에 대한 뇌인지과학적 원리를 이해하는 것을 돕는 것이다. 여기서 고등인지 기능은 지각적 의사결정, 학습과 기억, 공간 인지, 주의, 의식, 동기와 정서, 언어, 사회인지, 지능 등을 포함한다. 각각의 주제는 뇌인지과학과의 해당 분야의 전문가들이 기초 이론부터 현재 활발히 연구되고 있는 학문적 이슈를 소개하는 방식으로 전달할 계획이다. 본 교과목은 기존의 신경해부학/신경생물적/신경생리학적 이해를 바탕으로 단순한 감각과 학습 등의 인지 기능을 소개하는 수준보다 더 상위의 뇌의 고등인지 기능을 시스템 수준에서 이해하기 위한 것으로서 신경과학이나 인지과학 분야를 처음 접하는 학부생들도 쉽게 이해할 수 있도록 구성되었다. 본 교과목을 이수한 학부생은 인간의 뇌 인지에 대한 통찰을 얻을 수 있을 것이며, 융합과학적 성격의 뇌인지과학적 지식을 활용하여 자신의 현재 혹은 미래의 전공 분야에서 자신만의 독특한 문제를 개발할 수 있을 것이다."
                },
                {
                    "name": "생명과학의 인문학적 쟁점들",
                    "description": "본 과목의 목표는 생명과학을 전공하거나 관심이 있는 학부생들에게 생명과학의 인문학적 쟁점들이 무엇이고, 생명과학이 기존 인문사회학에 던지는 도전과 함의가 무엇인지를 소개하고 토론해보도록 하는 것이다. 이를 위해 진화생물학, 신경과학, 유전학, 발생생물학, 생태학 등이 유전자, 뇌, 인간, 사회에 대해서 어떠한 논쟁적 이론들을 제시해왔는지를 핵심적으로 살펴볼 것이며, 그런 이론들이 어떠한 개념적, 철학적 쟁점들을 담고 있는지를 논의할 것이다. 다른 한편으로는 현대 생명과학이 인간의 마음과 행동을 이해하는 데에 어떠한 새로운 함의를 주는지를 탐구함으로써, 과학의 발전과 인간에 대한 이해가 어떻게 연결되어 있는지를 논의할 것이다."
                },
                {
                    "name": "테크노사이언스의 역사와 철학",
                    "description": "이 수업은 고대에서 20세기에 이르는 기술사를 검토함으로써 현대 사회에서 과학 못지 않게 중요한 역할을 담당하고 있는 기술의 발전 과정과 그에 영향을 미치는 다양한 기술 내적, 외적 요소를 살펴봄은 물론, 기술과 과학, 기술과 문화, 기술과 산업, 기술과 경영, 기술과 사회 구성원들 사이의 다양한 상호 작용을 폭넓게 이해하는 것을 목적으로 한다. 최근에 nanotechnology, biotechnology라는 말이 널리 사용되는 예에서 보듯이, 과학을 전공하는 학생들에게도 기술에 대한 이해는 필수적이다."
                }
            ],
            "통계학과": [
                {
                    "name": "확률의 개념 및 응용",
                    "description": "자연과학뿐만 아니라 현대사회에서 거의 모든 현상을 이해하기 위하여 확률적 방법이 도입되고 있다. 또한 확률 이론은 현대수학의 중요한 분야이며 인공지능, 컴퓨터통신 등 컴퓨터과학에도 응용범위가 매우 크다. 이 과목에서는 먼저 확률의 기본 개념을 이해하고 이를 통하여 자연과학, 공학, 사회과학 등에서 사용되는 확률적 사고 및 접근방법을 공부하며, 아울러 이에 필요한 수학적 기법도 소개한다. 통계학 전공 필수과목인 수리통계를 수강하는데도 큰 도움이 된다."
                },
                {
                    "name": "확률의 개념 및 응용",
                    "description": "자연과학뿐만 아니라 현대사회에서 거의 모든 현상을 이해하기 위하여 확률적 방법이 도입되고 있다. 또한 확률 이론은 현대수학의 중요한 분야이며 인공지능, 컴퓨터통신 등 컴퓨터과학에도 응용범위가 매우 크다. 이 과목에서는 먼저 확률의 기본 개념을 이해하고 이를 통하여 자연과학, 공학, 사회과학 등에서 사용되는 확률적 사고 및 접근방법을 공부하며, 아울러 이에 필요한 수학적 기법도 소개한다. 통계학 전공 필수과목인 수리통계를 수강하는데도 큰 도움이 된다."
                },
                {
                    "name": "전산통계 및 실험",
                    "description": "본 과목은 통계학 전공에 필요한 계산적 사고력, 즉 논리로 표현하는 문제 해결 방법 및 논리적으로 컴퓨터 프로그램을 작성하는 능력을 함양하는 것을 목표로 한다. 특히 프로그래밍과 프로그래밍 언어의 기본 개념, 즉 데이터 구조, 추상화, 계층화, 모듈화, 반복, 재귀, 절차적 사고, 가치 지향 사고, 재사용, 계산복잡도, 자료형 등에 대해 공부한다. 개념의 구체화를 위한 도구로 특정 프로그래밍 언어(예: R)를 사용할 수 있으나, 다루는 내용은 언어 중립적이다. 추가적으로 함수적 프로그래밍과 객체 지향 프로그래밍 패러다임에 주의를 기울이며, 자료 분석을 위한 데이터 랭글링, 조작 및 탐색의 기초에 대해 다루고 다양한 데이터 유형의 추세를 시각화, 제시 및 전달하는 방법에 대해서도 공부한다."
                },
                {
                    "name": "전산통계 및 실험",
                    "description": "본 과목은 통계학 전공에 필요한 계산적 사고력, 즉 논리로 표현하는 문제 해결 방법 및 논리적으로 컴퓨터 프로그램을 작성하는 능력을 함양하는 것을 목표로 한다. 특히 프로그래밍과 프로그래밍 언어의 기본 개념, 즉 데이터 구조, 추상화, 계층화, 모듈화, 반복, 재귀, 절차적 사고, 가치 지향 사고, 재사용, 계산복잡도, 자료형 등에 대해 공부한다. 개념의 구체화를 위한 도구로 특정 프로그래밍 언어(예: R)를 사용할 수 있으나, 다루는 내용은 언어 중립적이다. 추가적으로 함수적 프로그래밍과 객체 지향 프로그래밍 패러다임에 주의를 기울이며, 자료 분석을 위한 데이터 랭글링, 조작 및 탐색의 기초에 대해 다루고 다양한 데이터 유형의 추세를 시각화, 제시 및 전달하는 방법에 대해서도 공부한다."
                },
                {
                    "name": "확률과정론",
                    "description": "이산시간 마코프연쇄, 연속시간 마코프연쇄, 그리고 갱신과정에 대하여 다룬다. 마코프체인에서는 재귀성, 에르고딕 성질, 가역성, 흡수성, 그리고 MCMC로의 응용 등이 중요 주제이고, 갱신과정에서는 포아송 프로세스 및 여러 갱신과정에 대한 성질을 다룬다."
                },
                {
                    "name": "다변량자료분석 및 실습",
                    "description": "본 교과목은 다변량 통계 분석의 이론과 응용을 다루며, 학생들이 다변량 데이터를 효과적으로 분석하고 해석할 수 있는 능력을 기르는 것을 목표로 한다. 주요 내용으로 다변량 정규분포 및 관련 분포 이론을 학습하고, 다변량 가설검정을 통한 그룹 비교 및 통계적 유의성 분석을 수행한다. 또한, 주성분 분석(PCA)과 요인 분석(Factor Analysis) 등 다양한 다변량 통계 기법들을 배우며, 구조방정식 모델(Structural Equation Modeling, SEM)을 활용하여 변수 간의 관계를 분석하는 방법을 익힌다. 마지막으로, 분류(Classification) 기법을 통해 데이터의 패턴을 분류하고 예측하는 방법을 학습한다. 이를 통해 학생들은 다양한 다변량 데이터 분석 기법을 실습하고 실전 문제에 적용할 수 있는 역량을 갖추게 된다."
                },
                {
                    "name": "베이즈통계 및 실습",
                    "description": "베이즈 추론은 베이즈 정리를 이용하여 불확실성을 가진 정보를 확률로 표현하고 이를 이용하여 추론을 하는 방법이다. 이 과목에서는 베이즈 추론의 역사적 배경, 베이즈 추론의 기본 요소를 다루고, 현실적인 베이즈 추론을 위해 필요한 베이즈 계산 방법들, 즉 마르코프 체인 몬테 카를로와 변분방법 등을 다룬다. 또한 베이즈 추론을 이표본 검정, 선형 회귀모형, 로지스틱 회귀모형 등 기본적인 통계모형에 적용하여 데이터 분석하는 방법을 배운다."
                },
                {
                    "name": "생존자료분석 및 실습",
                    "description": "생존시간(survival time)에 관한 추정과 검정을 하거나 생존시간에 관한 회귀모형을 사용하여 생존 시간에 영향을 미치는 위험인자를 찾아내는 통계기법을 공부한다. 개체가 생존할 확률을 나타내는 생존함수(survival function)를 추정하기 위한 생명표(life table)법과 카플란-마이어(Kaplan-Meyer) 추정법을 소개하고 여러 처리(treatment) 그룹을 비교하기 위한 검정법을 다룬다. 또한 회귀모형에 관한 대표적인 모형인 Cox의 비례위험모형 (proportional hazard model)과 가속화된 회귀모형(accelerated regression model)에 관하여 공부한다."
                },
                {
                    "name": "이산자료분석 및 실습",
                    "description": "범주형 자료에 대한 이해와 분석 방법을 학습하는 과목이다. 범주형 자료는 사회과학, 보건의료 등 다양한 분야에서 일상적인 조사와 실험을 통해 널리 수집된다. 학생들은 분할표(contingency table) 분석을 포함하여, 일반화선형모형(generalized linear model), 로지스틱 회귀모형(logistic regression model), 로그 선형모형(log-linear model) 등 다양한 분석 방법을 학습한다. 이 과목을 통해, 자료의 특성을 이해하고, 적절한 분석 방법을 선택할 수 있는 능력을 개발한다. 또한 통계 소프트웨어를 통해 실제 데이터에 적용하고 구현하는 과정을 다룬다."
                },
                {
                    "name": "자료분석 및 실습",
                    "description": "이 강의에서는 실질적 문제해결을 위한 다양한 자료 분석 방법론의 이해와 적용을 경험한다. 해결하고자 하는 문제의 구체화를 포함하여, 데이터의 수집 및 정리, 탐색적 데이터분석, 시각화, 통계적 추론 및 예측 그리고 의사결정의 핵심 원리를 배운다. 정형 데이터뿐만 아니라 비정형 데이터(텍스트 데이터, 공간 데이터, 네트워크 데이터) 분석 방법도 다루며, 이러한 데이터에 적합한 시각화 및 분석 기법을 학습한다. 학생들은 다양한 데이터의 구조를 이해하고 적절한 자료 분석 방법을 선택하며, 실습을 통해 배운 내용을 실제 문제에 적용하여 해결하는 전 과정을 경험한다. 이를 통해 문제해결 능력과 실무에서 활용 가능한 분석 역량을 효과적으로 향상시킨다."
                },
                {
                    "name": "표본설계 및 조사실습",
                    "description": "기본적인 표본설계와 추정이론을 기초로 하여 보다 다양하고 실용적인 설계와 추정이론을 다룬다. 주요 교과내용은 랜덤추출법, 층화추출법, 군집추출법, 층화다단추출법, 회귀추정 중복추출법, 비표본오차에 대한 고찰 등이다. 각 추출방법에서 모수의 추정과 표본의 크기 추정, 표본의 최적배분, 상대효율 등을 다룬다. 실습을 통하여 통계조사과정과 실측방법의 문제에 접근한다. 조별 사례연구로써 실제 현장에서 표본설계 및 조사실습을 실시한다."
                }
            ],
            "물리학전공": [
                {
                    "name": "고급 양자물리",
                    "description": "양자물리의 심화 과정으로 양자물리의 주요 응용과 근사 계산 방법 등을 다룬다. 주요 내용은 대칭성과 각운동량, 섭동이론, 다양한 근사방법 및 산란이론, 양자 정보의 기초 등이다."
                },
                {
                    "name": "고급 양자물리 연습",
                    "description": "이 교과목은 <고급 양자물리> 교과에서 배운 내용의 이해를 증진시키고 학생들의 응용능력을 배양하기 위해 <고급 양자물리>에 관련된 구체적 문제들에 대해 그 풀이과정을 공부하는 것을 목적으로 한다."
                },
                {
                    "name": "중급물리실험 2",
                    "description": "이 과목은 자연과학과 공학전공자들에게 물리실험에 널리 쓰이는 기초 전자학 및 측정의 기본 기술을 소개한다. 학생들은 저항, 다이오드, 트랜지스터, OP-앰프, PROM/FPGA등의 선형 및 비선형 소자를 공부하기 위해 컴퓨터를 기반으로 오실로스코프, 전류/전압원, 전압계, 논리분석기 등의 기능을 가진 다기능 장치를 프로그램하게 된다. 학생들은 자신만의 실험을 설계하고 개발하며, 이 과정에서 얻어진 발견을 과학저널에 실리는 논문 형태로 제출하는 것이 장려된다. 이 과목은 매주 한 시간의 강의와 네 시간의 실험으로 구성되어지며, 학부생과 대학원생에게 모두 제공된다."
                },
                {
                    "name": "고급 양자물리",
                    "description": "양자물리의 심화 과정으로 양자물리의 주요 응용과 근사 계산 방법 등을 다룬다. 주요 내용은 대칭성과 각운동량, 섭동이론, 다양한 근사방법 및 산란이론, 양자 정보의 기초 등이다."
                },
                {
                    "name": "고급 양자물리 연습",
                    "description": "이 교과목은 <고급 양자물리> 교과에서 배운 내용의 이해를 증진시키고 학생들의 응용능력을 배양하기 위해 <고급 양자물리>에 관련된 구체적 문제들에 대해 그 풀이과정을 공부하는 것을 목적으로 한다."
                },
                {
                    "name": "열과 통계물리",
                    "description": "열과 통계물리학의 기본 개념을 다루며 <00.211 역학 1(또는 300.209 역학개론)>과 <300.214 전기와 자기(또는 884.002 전자기학개론)>이 먼저 수강했어야 하는 과목이다. 주요 내용은 상태수와 엔트로피, 열역학의 여러 법칙, 볼츠만 분포, 이상기체의 성질, 깁스 자유에너지와 화학반응, 상전이, 기체분자의 운동이론, 브라운 운동 등이다."
                },
                {
                    "name": "중급물리실험 2",
                    "description": "이 과목은 자연과학과 공학전공자들에게 물리실험에 널리 쓰이는 기초 전자학 및 측정의 기본 기술을 소개한다. 학생들은 저항, 다이오드, 트랜지스터, OP-앰프, PROM/FPGA등의 선형 및 비선형 소자를 공부하기 위해 컴퓨터를 기반으로 오실로스코프, 전류/전압원, 전압계, 논리분석기 등의 기능을 가진 다기능 장치를 프로그램하게 된다. 학생들은 자신만의 실험을 설계하고 개발하며, 이 과정에서 얻어진 발견을 과학저널에 실리는 논문 형태로 제출하는 것이 장려된다. 이 과목은 매주 한 시간의 강의와 네 시간의 실험으로 구성되어지며, 학부생과 대학원생에게 모두 제공된다."
                },
                {
                    "name": "핵과기본입자",
                    "description": "원자핵의 구성 및 핵력의 주요 특성, 그리고 소립자들의 종류 및 그 상호작용에 관한 이론의 골격, 특히 대칭성 및 대칭성의 깨짐을 다루며 구체적으로는 핵.입자물리의 기본언어, 핵.입자 실험장치 및 방법, 핵모형 및 핵력, 렙론의 상호작용, 하드론의 상호작용, 기본 힘의 통일에 관한 최근 이론 등을 포함한다."
                },
                {
                    "name": "고급 역학",
                    "description": "<역학>을 수강한 학생 대상의 심화 과목으로 다루는 주요 내용은 다체계의 운동, 비관성 기준틀에서의 역학, 강체의 동역학, 겹진동의 심화 과정, 연속체의 동역학 및 특수상대론 등이다."
                },
                {
                    "name": "고급 역학 연습",
                    "description": "이 교과목은 <고급 역학> 교과에서 배운 내용의 이해를 증진시키고 학생들의 응용능력을 배양하기 위해 <고급 역학>에 관련된 구체적 문제들에 대해 그 풀이과정을 공부하는 것을 목적으로 한다."
                },
                {
                    "name": "기초현대물리실험",
                    "description": "역학, 열역학, 전자기학이라는 전통적인 물리의 성공적인 정착 이후, 우리 인류는 지난 100여년간 양자 역학이라는 새로운 분야의 물리에 대한 큰 발전을 목격하였다. 이제 양자 물리는 소립자 단위의 상호작용과 광활한 우주 전체의 형성에 이르기까지 광범위한 자연 대상에서 적용되어, 우리 인류의 자연에 대한 이해를 혁명적으로 바꾸게 하였다. 이 교과목은 앞으로 물리학을 전공하거나 관련된 영역에서 물리학을 활용할 대학생이, 양자 역학 개념의 근간을 이루는 역사적으로 중요한 현대물리 실험을 수행한다. 동시에, 이 같은 역사적 실험의 결과로 발전된 원자, 고체, 핵, 입자 물리 영역의 대표적인 실험 개념을 이해하고 체험하고자 한다. 이 과목은 매주 한 시간의 강의와 네 시간의 실험으로 구성될 수 있으며, 본 과목에서, 빛의 양자화, 물질의 파동성과 입자성을 포괄하는 이중성, 보어의 원자 모형을 낳게 한 원자 분광학 등, 현대 물리의 핵심 개념을 정립하는데 도움 된 중요한 실험을 수행한다. 대표적인 예시 실험에는, 흑체 복사, 밀리컨 기름방울 실험, 플랑크-헤르츠 실험, 수소 가스, 네온 가스 등의 분광학, 광전 효과, 홀효과 실험 등이 포함될 수 있다."
                },
                {
                    "name": "기초현대물리실험",
                    "description": "역학, 열역학, 전자기학이라는 전통적인 물리의 성공적인 정착 이후, 우리 인류는 지난 100여년간 양자 역학이라는 새로운 분야의 물리에 대한 큰 발전을 목격하였다. 이제 양자 물리는 소립자 단위의 상호작용과 광활한 우주 전체의 형성에 이르기까지 광범위한 자연 대상에서 적용되어, 우리 인류의 자연에 대한 이해를 혁명적으로 바꾸게 하였다. 이 교과목은 앞으로 물리학을 전공하거나 관련된 영역에서 물리학을 활용할 대학생이, 양자 역학 개념의 근간을 이루는 역사적으로 중요한 현대물리 실험을 수행한다. 동시에, 이 같은 역사적 실험의 결과로 발전된 원자, 고체, 핵, 입자 물리 영역의 대표적인 실험 개념을 이해하고 체험하고자 한다. 이 과목은 매주 한 시간의 강의와 네 시간의 실험으로 구성될 수 있으며, 본 과목에서, 빛의 양자화, 물질의 파동성과 입자성을 포괄하는 이중성, 보어의 원자 모형을 낳게 한 원자 분광학 등, 현대 물리의 핵심 개념을 정립하는데 도움 된 중요한 실험을 수행한다. 대표적인 예시 실험에는, 흑체 복사, 밀리컨 기름방울 실험, 플랑크-헤르츠 실험, 수소 가스, 네온 가스 등의 분광학, 광전 효과, 홀효과 실험 등이 포함될 수 있다."
                },
                {
                    "name": "물리연구 2",
                    "description": "지도교수의 지도 아래 실험 물리의 특정 주제를 선택하여 집중적으로 공부하고 학사학위 논문을 작성한다. 물리학으로 학사학위를 받을 예정인 학생이 수강하게 된다. 특히 대학원에서 진행되는 연구에 참여하는 경험을 통하여 첨단실험 연구에 대한 경험을 쌓는다."
                },
                {
                    "name": "물리학과 신기술",
                    "description": "물리학의 원리, 특히 포토닉스가 실제 과학기술에 어떻게 응용되고 있는지 알아보고, 또 물리학적 발견이 미래의 과학기술로 연결될 가능성을 생각해 본다. 따라서, 물질물리, 고체 및 레이저 물리와 관련된 응용과 기술 개발 가능성에 대해 이론적, 실험적으로 다루고자 한다. 예를 들어 전자소자 및 광소자와 관련된 물리, 반도체 및 유전체, 나노공정 기술 등에 관한 원리 및 응용적 측면이 논의될 것이다. 중간고사 이전까지는 포토닉스를 중심으로 한 이론 수업이 이루어지고, 중간고사 이후에는 담당교수 연구실의 실험 장비를 활용한 실험 실습을 통해 현재 활발히 진행되고 있는 신기술 연구에 대해 알아보고자 한다. 중간고사는 이론 수업한 내용으로 치러지고, 기말고사는 실험 실습에 대한 보고서 및 최근 발표된 literature의 review로 대체될 것이다."
                },
                {
                    "name": "응집물질과 집단현상",
                    "description": "이 교과목은 “고체의 성질”을 수강한 학생들에게 “단단한 (hard)” 또는 “무른 (soft)” 응집물질계에 대한 이해의 틀을 제공하는 것으로 목적으로 한다. 응집물질계의 집단현상에 대한 개념을 중심으로 다루는 이 교과의 주요 주제는 상전이, 재규격화, 임계현상, 무질서계, 초전도, 양자상전이, 강상관계, 자체 조직 등을 포함한다. (※ 수강을 원하는 학생은 “양자물리 1, 2”, “열 및 통계물리” 및 “고체의 성질”에 대한 사전 지식이 필요하다.)"
                },
                {
                    "name": "전산물리",
                    "description": "물리학의 연구를 수행하는데 필요한 컴퓨터 사용 능력을 배양하기 위한 과목으로 기본적인 수치해석의 방법들은 비롯하여 몬테카를로방법, 테이터 분석의 기본방법 등을 다루며, 병렬처리와 신경 그물얼개 방법 등 최신 방법들의 입문을 포함한다. 또한 컴퓨터 연결장치의 기본 개념도 다룬다."
                },
                {
                    "name": "전자기파와 광학",
                    "description": "<전기와 자기 (303.214)>을 수강한 학생들을 대상으로, 막스웰방정식으로 부터 전자기파의 생성과 전달에 대한 내용까지 강의한다. 특히 파동광학에 관련된 분야도 함께 취급한다. 주요 내용으로는 막스웰방정식과 경계조건, 전기회로, 전자기파와 파동방정식, 도체와 유전체 내에서의 전자기파 전파, 두 유전체 경계면에서의 반사와 꺽임, 빛의 간섭과 에돌이 현상, 프라운호퍼 에돌이, 분해능, 진동하는 쌍극자에 의한 전자기파 방출, 리나드-비헤르트 퍼텐셜, 전자기장의 특수상대성이론 등이 있다."
                },
                {
                    "name": "전자기파와 광학 연습",
                    "description": "이 교과목은 <884.301 전자기파와 광학> 교과에서 배운 내용의 이해를 증진시키고 학생들의 응용능력을 배양하기 위해 <전자기파와 광학>에 관련된 구체적 문제들에 대해 그 풀이과정을 공부하는 것을 목적으로 한다."
                }
            ],
            "생명과학부": [
                {
                    "name": "분자생물학",
                    "description": "금세기 들어 생명과학의 급속한 발전은 분자생물학을 통하여 이루어진다고 할 만큼, 분자생물학이 전체 생명과학에 끼치는 영향이 크다. 본 교과목에서는 여러 생명현상 중 원핵과 진핵생물의 유전자 및 염색체의 구성, 유전자발현(전사 및 번역), 유전자의 복제, recombination 및 repair 등 유전자와 관련된 현상의 기작과 조절에 참여하는 분자와 그 상호작용의 관점에서 심도있게 살펴본다."
                },
                {
                    "name": "분자생물학",
                    "description": "금세기 들어 생명과학의 급속한 발전은 분자생물학을 통하여 이루어진다고 할 만큼, 분자생물학이 전체 생명과학에 끼치는 영향이 크다. 본 교과목에서는 여러 생명현상 중 원핵과 진핵생물의 유전자 및 염색체의 구성, 유전자발현(전사 및 번역), 유전자의 복제, recombination 및 repair 등 유전자와 관련된 현상의 기작과 조절에 참여하는 분자와 그 상호작용의 관점에서 심도있게 살펴본다."
                },
                {
                    "name": "생명과학학위논문연구",
                    "description": "자연과학도로서 생명과학과 관련한 자연과학적 진리들이 어떻게 발견되는 지 학부 졸업예정자들이 실제 실험실에서 실험연구 수행을 통해 이해하고 또한 실험 논문 작성법을 배우는 것을 강좌 개설 목적으로 한다. 학부 졸업예정자들은 각 연구실에서 수행한 실험 결과와 구상한 이론을 이 강좌를 통해 정기적으로 발표하며 최종 연구 결과물을 졸업 전에 포스터 발표를 통해 평가를 받고 졸업논문으로 제출한다."
                },
                {
                    "name": "생명과학학위논문연구",
                    "description": "자연과학도로서 생명과학과 관련한 자연과학적 진리들이 어떻게 발견되는 지 학부 졸업예정자들이 실제 실험실에서 실험연구 수행을 통해 이해하고 또한 실험 논문 작성법을 배우는 것을 강좌 개설 목적으로 한다. 학부 졸업예정자들은 각 연구실에서 수행한 실험 결과와 구상한 이론을 이 강좌를 통해 정기적으로 발표하며 최종 연구 결과물을 졸업 전에 포스터 발표를 통해 평가를 받고 졸업논문으로 제출한다."
                },
                {
                    "name": "생명과학학위논문연구",
                    "description": "자연과학도로서 생명과학과 관련한 자연과학적 진리들이 어떻게 발견되는 지 학부 졸업예정자들이 실제 실험실에서 실험연구 수행을 통해 이해하고 또한 실험 논문 작성법을 배우는 것을 강좌 개설 목적으로 한다. 학부 졸업예정자들은 각 연구실에서 수행한 실험 결과와 구상한 이론을 이 강좌를 통해 정기적으로 발표하며 최종 연구 결과물을 졸업 전에 포스터 발표를 통해 평가를 받고 졸업논문으로 제출한다."
                },
                {
                    "name": "생명과학학위논문연구",
                    "description": "자연과학도로서 생명과학과 관련한 자연과학적 진리들이 어떻게 발견되는 지 학부 졸업예정자들이 실제 실험실에서 실험연구 수행을 통해 이해하고 또한 실험 논문 작성법을 배우는 것을 강좌 개설 목적으로 한다. 학부 졸업예정자들은 각 연구실에서 수행한 실험 결과와 구상한 이론을 이 강좌를 통해 정기적으로 발표하며 최종 연구 결과물을 졸업 전에 포스터 발표를 통해 평가를 받고 졸업논문으로 제출한다."
                },
                {
                    "name": "생명과학학위논문연구",
                    "description": "자연과학도로서 생명과학과 관련한 자연과학적 진리들이 어떻게 발견되는 지 학부 졸업예정자들이 실제 실험실에서 실험연구 수행을 통해 이해하고 또한 실험 논문 작성법을 배우는 것을 강좌 개설 목적으로 한다. 학부 졸업예정자들은 각 연구실에서 수행한 실험 결과와 구상한 이론을 이 강좌를 통해 정기적으로 발표하며 최종 연구 결과물을 졸업 전에 포스터 발표를 통해 평가를 받고 졸업논문으로 제출한다."
                },
                {
                    "name": "유전학",
                    "description": "생물학을 전공하거나 관련과학을 전공하는 학생들을 위하여 유전학의 기본이론을 고전적, 현대적 수준에서 강의한다. 특히 현대 유전학의 발전과정을 상세하게 강의하여 우리 삶에 유전학적 기여에 대한 중심적 역할을 강조한다. 이에 더하여 분자유전학의 기초를 정립시키고, 나아가 유전학의 응용에 관한 유전공학적, 생명공학적 측면에서도 강의하여 우리 지구상의 생명체 생존에 있어서 유전학의 중요성을 강조한다."
                },
                {
                    "name": "유전학",
                    "description": "생물학을 전공하거나 관련과학을 전공하는 학생들을 위하여 유전학의 기본이론을 고전적, 현대적 수준에서 강의한다. 특히 현대 유전학의 발전과정을 상세하게 강의하여 우리 삶에 유전학적 기여에 대한 중심적 역할을 강조한다. 이에 더하여 분자유전학의 기초를 정립시키고, 나아가 유전학의 응용에 관한 유전공학적, 생명공학적 측면에서도 강의하여 우리 지구상의 생명체 생존에 있어서 유전학의 중요성을 강조한다."
                },
                {
                    "name": "면역학",
                    "description": "본 과정은 면역현상에 대한 기본적인 이해를 습득하는 것을 목표로 한다. 비특이적 면역현상과, 특이적 면역현상의 체액성 반응과 세포성 반응의 특성을 이해하는 것이 주 내용이다. 항원의 특성과 이에 대한 면역현상에 관련된 여러 가지 주요 유전자 및 단백질, 세포, 조직 및 조직의 구조와 기능을 유전학적, 생화학적, 분자세포생물학적 측면에서 분석하여 이해하고자 한다."
                },
                {
                    "name": "미생물학 2: 생체-마이크로바이옴 상호작용",
                    "description": "<미생물학 1: 미생물 유전체 발현과 기능 조절>을 수강한 학생들을 대상으로, 미생물의 다양한 대사활동과 다양성, 생태계에서의 역할, 감염과 면역현상 등 자연계에서 미생물의 다양한 역할에 대한 기본원리를 교육한다."
                },
                {
                    "name": "생명과학과 미래설계",
                    "description": "생명과학 분야에서 학생이 적합한 직업을 선택하고 생애를 설계할 수 있도록 도와주어 즐겁고 보람된 대학생활을 영위할 수 있도록 돕는 것이 목표이다. 학생 자신의 기질 및 성격, 진로 적성, 가치관에 대하여 학생 스스로가 자기 탐색을 통해 정체성을 확립하고, 이에 따라 알맞은 직업을 선택할 수 있도록 관련된 정보를 제공할 예정이다. 또한 실험 위주의 생명과학 분야에서 타인과의 원활한 소통을 위해 알아야 사항들, 예를 들어 타인에 대한 이해와 타인과의 관계 시 가져야 할 바람직한 태도 등을 가르치고 실제 연습(실습)을 통해 배운 것들을 숙지할 수 있도록 도와줄 것이다."
                },
                {
                    "name": "생명과학연구실습 1",
                    "description": "생명현상의 한 주제를 선택하여 짧은 시간 (8주 내외) 동안 수행할 수 있는 작은 실험을 구상하고, 실험을 수행하는 실습을 한다. 대학원 연구실중 한 연구실을 선택하여 실험실습의 지도를 받는다. 이를 통하여 교과서적인 지식이 어떠한 실험과정을 통해 얻어 질 수 있는지를 이해하고 향후 독립적인 연구자로 전공연구를 심화할 수 있는 배경을 제공한다. 전공에 막 진입한 학부 3학년 학생의 참여를 권장함."
                },
                {
                    "name": "생명과학연구실습 1",
                    "description": "생명현상의 한 주제를 선택하여 짧은 시간 (8주 내외) 동안 수행할 수 있는 작은 실험을 구상하고, 실험을 수행하는 실습을 한다. 대학원 연구실중 한 연구실을 선택하여 실험실습의 지도를 받는다. 이를 통하여 교과서적인 지식이 어떠한 실험과정을 통해 얻어 질 수 있는지를 이해하고 향후 독립적인 연구자로 전공연구를 심화할 수 있는 배경을 제공한다. 전공에 막 진입한 학부 3학년 학생의 참여를 권장함."
                },
                {
                    "name": "생명과학연구실습 4",
                    "description": "생명현상의 한 주제를 선택하여 짧은 시간 (8주 내외)동안 수행할 수 있는 작은 실험을 구상하고, 실험을 수행하는 실습을 한다. 대학원 연구실 중 한 연구실을 선택하여 실험실습의 지도를 받는다. 이를 통하여 교과서적인 지식이 어떠한 실험과정을 통해 얻어 질 수 있는지를 이해하고 향후 독립적인 연구자로 전공연구를 심화할 수 있는 배경을 제공한다. 학부 4학년 학생의 참여를 권장한다."
                },
                {
                    "name": "생명과학연구실습 3",
                    "description": "생명현상의 한 주제를 선택하여 짧은 시간 (8주 내외)동안 수행할 수 있는 작은 실험을 구상하고, 실험을 수행하는 실습을 한다. 대학원 연구실 중 한 연구실을 선택하여 실험실습의 지도를 받는다. 이를 통하여 교과서적인 지식이 어떠한 실험과정을 통해 얻어 질 수 있는지를 이해하고 향후 독립적인 연구자로 전공연구를 심화할 수 있는 배경을 제공한다. 학부 4학년 학생의 참여를 권장한다."
                },
                {
                    "name": "생명과학연구실습 2",
                    "description": "생명현상의 한 주제를 선택하여 짧은 시간 (8주 내외) 동안 수행할 수 있는 작은 실험을 구상하고, 실험을 수행하는 실습을 한다. 대학원 연구실중 한 연구실을 선택하여 실험실습의 지도를 받는다. 이를 통하여 교과서적인 지식이 어떠한 실험과정을 통해 얻어 질 수 있는지를 이해하고 향후 독립적인 연구자로 전공연구를 심화할 수 있는 배경을 제공한다. 고급생명과학실험 1, 2를 수강한 학부 4학년 학생의 참여를 권장함."
                },
                {
                    "name": "생명과학연구실습 2",
                    "description": "생명현상의 한 주제를 선택하여 짧은 시간 (8주 내외) 동안 수행할 수 있는 작은 실험을 구상하고, 실험을 수행하는 실습을 한다. 대학원 연구실중 한 연구실을 선택하여 실험실습의 지도를 받는다. 이를 통하여 교과서적인 지식이 어떠한 실험과정을 통해 얻어 질 수 있는지를 이해하고 향후 독립적인 연구자로 전공연구를 심화할 수 있는 배경을 제공한다. 고급생명과학실험 1, 2를 수강한 학부 4학년 학생의 참여를 권장함."
                },
                {
                    "name": "생명과학을 위한 인공지능",
                    "description": "생명과학 분야에서는 최근 인공지능(AI) 모델을 활용해 새로운 지식을 창출하는 연구가 활발히 진행되고 있다. AI를 활용하여 생명과학 연구를 수행하는 연구자는 생명과학에 대한 지식뿐만 아니라 컴퓨팅 및 AI에 대한 기본적인 소양을 갖출 필요가 있다. 따라서, 본 과목에서는 생명과학 전공 지식을 학습한 학부생들을 대상으로 컴퓨터 과학, 빅 데이터, AI에 대한 심화 지식을 습득하고 AI를 활용하는 능력을 함양할 수 있도록 한다. 본 과목에서는 프로젝트 기반 학습(Project-Based Learning, PBL) 방법을 사용하여, AI를 활용해 생명과학 분야의 문제들을 직접 분석해 보고, 이 과정에서 습득한 지식을 향후 생명과학 연구에 직접 활용할 수 있도록 한다. 본 교과목의 전반부에서는 차세대 시퀀싱(Next-Generation Sequencing, NGS)을 포함한 멀티오믹스 빅데이터의 이론적 배경을 학습하고 이 데이터를 직접 분석하여 생물정보학 연구 과정을 체험할 수 있도록 한다. 후반부에서는 생명과학의 문제를 해결할 수 있는 AI 모델을 개발하기 위한 수리과학 및 컴퓨터과학 지식을 습득한다. 또한, 딥 러닝을 활용하여 직접 모델을 훈련시키고 평가함으로서 AI를 활용한 과학적 문제 해결 과정을 경험한다. 본 과목에서는 이와 같이 학생 주도적으로 프로젝트를 수행하며, 프로젝트 수행 결과를 바탕으로 성적을 부여한다. 본 교과목은“자연과학자를 위한 프로그래밍 및 인공지능 개론”(자연대 AI∙컴퓨팅 공통기초 과목) 수강자에 한해 수강이 허용된다."
                },
                {
                    "name": "생명과학전공실험2",
                    "description": "현대생물학의 기초가 되는 연구방법들에 대해 소개 및 실습을 행한다. 본 실험(Ⅱ)에서는 유전학 및 생리학(동물, 미생물) 강좌의 주요 내용을 실험을 통하여 이해하기 위해 개설되었다. 유전학 분야에는 초파리 유전, 꽃 발달 유전적 조절, 동물세포혈질전환, 식물세포형질전환, 플라스미드 분리 및 재 조합 단백질 생산등의 실험이 있으며, 생리학 분야에서는 미생물 배양과 성장 분석법, 미생물광합성, 생쥐배아 발생, 호르몬 측정 등의 실험이 있다."
                },
                {
                    "name": "생명과학전공실험2",
                    "description": "현대생물학의 기초가 되는 연구방법들에 대해 소개 및 실습을 행한다. 본 실험(Ⅱ)에서는 유전학 및 생리학(동물, 미생물) 강좌의 주요 내용을 실험을 통하여 이해하기 위해 개설되었다. 유전학 분야에는 초파리 유전, 꽃 발달 유전적 조절, 동물세포혈질전환, 식물세포형질전환, 플라스미드 분리 및 재 조합 단백질 생산등의 실험이 있으며, 생리학 분야에서는 미생물 배양과 성장 분석법, 미생물광합성, 생쥐배아 발생, 호르몬 측정 등의 실험이 있다."
                },
                {
                    "name": "생명과학전공실험2",
                    "description": "현대생물학의 기초가 되는 연구방법들에 대해 소개 및 실습을 행한다. 본 실험(Ⅱ)에서는 유전학 및 생리학(동물, 미생물) 강좌의 주요 내용을 실험을 통하여 이해하기 위해 개설되었다. 유전학 분야에는 초파리 유전, 꽃 발달 유전적 조절, 동물세포혈질전환, 식물세포형질전환, 플라스미드 분리 및 재 조합 단백질 생산등의 실험이 있으며, 생리학 분야에서는 미생물 배양과 성장 분석법, 미생물광합성, 생쥐배아 발생, 호르몬 측정 등의 실험이 있다."
                },
                {
                    "name": "생명과학전공실험2",
                    "description": "현대생물학의 기초가 되는 연구방법들에 대해 소개 및 실습을 행한다. 본 실험(Ⅱ)에서는 유전학 및 생리학(동물, 미생물) 강좌의 주요 내용을 실험을 통하여 이해하기 위해 개설되었다. 유전학 분야에는 초파리 유전, 꽃 발달 유전적 조절, 동물세포혈질전환, 식물세포형질전환, 플라스미드 분리 및 재 조합 단백질 생산등의 실험이 있으며, 생리학 분야에서는 미생물 배양과 성장 분석법, 미생물광합성, 생쥐배아 발생, 호르몬 측정 등의 실험이 있다."
                },
                {
                    "name": "생명과학전공실험2",
                    "description": "현대생물학의 기초가 되는 연구방법들에 대해 소개 및 실습을 행한다. 본 실험(Ⅱ)에서는 유전학 및 생리학(동물, 미생물) 강좌의 주요 내용을 실험을 통하여 이해하기 위해 개설되었다. 유전학 분야에는 초파리 유전, 꽃 발달 유전적 조절, 동물세포혈질전환, 식물세포형질전환, 플라스미드 분리 및 재 조합 단백질 생산등의 실험이 있으며, 생리학 분야에서는 미생물 배양과 성장 분석법, 미생물광합성, 생쥐배아 발생, 호르몬 측정 등의 실험이 있다."
                },
                {
                    "name": "생명과학전공실험2",
                    "description": "현대생물학의 기초가 되는 연구방법들에 대해 소개 및 실습을 행한다. 본 실험(Ⅱ)에서는 유전학 및 생리학(동물, 미생물) 강좌의 주요 내용을 실험을 통하여 이해하기 위해 개설되었다. 유전학 분야에는 초파리 유전, 꽃 발달 유전적 조절, 동물세포혈질전환, 식물세포형질전환, 플라스미드 분리 및 재 조합 단백질 생산등의 실험이 있으며, 생리학 분야에서는 미생물 배양과 성장 분석법, 미생물광합성, 생쥐배아 발생, 호르몬 측정 등의 실험이 있다."
                },
                {
                    "name": "생명과학전공실험2",
                    "description": "현대생물학의 기초가 되는 연구방법들에 대해 소개 및 실습을 행한다. 본 실험(Ⅱ)에서는 유전학 및 생리학(동물, 미생물) 강좌의 주요 내용을 실험을 통하여 이해하기 위해 개설되었다. 유전학 분야에는 초파리 유전, 꽃 발달 유전적 조절, 동물세포혈질전환, 식물세포형질전환, 플라스미드 분리 및 재 조합 단백질 생산등의 실험이 있으며, 생리학 분야에서는 미생물 배양과 성장 분석법, 미생물광합성, 생쥐배아 발생, 호르몬 측정 등의 실험이 있다."
                },
                {
                    "name": "생명과학전공실험2",
                    "description": "현대생물학의 기초가 되는 연구방법들에 대해 소개 및 실습을 행한다. 본 실험(Ⅱ)에서는 유전학 및 생리학(동물, 미생물) 강좌의 주요 내용을 실험을 통하여 이해하기 위해 개설되었다. 유전학 분야에는 초파리 유전, 꽃 발달 유전적 조절, 동물세포혈질전환, 식물세포형질전환, 플라스미드 분리 및 재 조합 단백질 생산등의 실험이 있으며, 생리학 분야에서는 미생물 배양과 성장 분석법, 미생물광합성, 생쥐배아 발생, 호르몬 측정 등의 실험이 있다."
                },
                {
                    "name": "생명과학전공실험2",
                    "description": "현대생물학의 기초가 되는 연구방법들에 대해 소개 및 실습을 행한다. 본 실험(Ⅱ)에서는 유전학 및 생리학(동물, 미생물) 강좌의 주요 내용을 실험을 통하여 이해하기 위해 개설되었다. 유전학 분야에는 초파리 유전, 꽃 발달 유전적 조절, 동물세포혈질전환, 식물세포형질전환, 플라스미드 분리 및 재 조합 단백질 생산등의 실험이 있으며, 생리학 분야에서는 미생물 배양과 성장 분석법, 미생물광합성, 생쥐배아 발생, 호르몬 측정 등의 실험이 있다."
                },
                {
                    "name": "생명과학전공실험2",
                    "description": "현대생물학의 기초가 되는 연구방법들에 대해 소개 및 실습을 행한다. 본 실험(Ⅱ)에서는 유전학 및 생리학(동물, 미생물) 강좌의 주요 내용을 실험을 통하여 이해하기 위해 개설되었다. 유전학 분야에는 초파리 유전, 꽃 발달 유전적 조절, 동물세포혈질전환, 식물세포형질전환, 플라스미드 분리 및 재 조합 단백질 생산등의 실험이 있으며, 생리학 분야에서는 미생물 배양과 성장 분석법, 미생물광합성, 생쥐배아 발생, 호르몬 측정 등의 실험이 있다."
                },
                {
                    "name": "생명과학전공실험2",
                    "description": "현대생물학의 기초가 되는 연구방법들에 대해 소개 및 실습을 행한다. 본 실험(Ⅱ)에서는 유전학 및 생리학(동물, 미생물) 강좌의 주요 내용을 실험을 통하여 이해하기 위해 개설되었다. 유전학 분야에는 초파리 유전, 꽃 발달 유전적 조절, 동물세포혈질전환, 식물세포형질전환, 플라스미드 분리 및 재 조합 단백질 생산등의 실험이 있으며, 생리학 분야에서는 미생물 배양과 성장 분석법, 미생물광합성, 생쥐배아 발생, 호르몬 측정 등의 실험이 있다."
                },
                {
                    "name": "생명과학전공실험2",
                    "description": "현대생물학의 기초가 되는 연구방법들에 대해 소개 및 실습을 행한다. 본 실험(Ⅱ)에서는 유전학 및 생리학(동물, 미생물) 강좌의 주요 내용을 실험을 통하여 이해하기 위해 개설되었다. 유전학 분야에는 초파리 유전, 꽃 발달 유전적 조절, 동물세포혈질전환, 식물세포형질전환, 플라스미드 분리 및 재 조합 단백질 생산등의 실험이 있으며, 생리학 분야에서는 미생물 배양과 성장 분석법, 미생물광합성, 생쥐배아 발생, 호르몬 측정 등의 실험이 있다."
                },
                {
                    "name": "생명과학전공실험2",
                    "description": "현대생물학의 기초가 되는 연구방법들에 대해 소개 및 실습을 행한다. 본 실험(Ⅱ)에서는 유전학 및 생리학(동물, 미생물) 강좌의 주요 내용을 실험을 통하여 이해하기 위해 개설되었다. 유전학 분야에는 초파리 유전, 꽃 발달 유전적 조절, 동물세포혈질전환, 식물세포형질전환, 플라스미드 분리 및 재 조합 단백질 생산등의 실험이 있으며, 생리학 분야에서는 미생물 배양과 성장 분석법, 미생물광합성, 생쥐배아 발생, 호르몬 측정 등의 실험이 있다."
                },
                {
                    "name": "생명과학특수연구 1",
                    "description": "학부생의 졸업논문 작성을 위한 강좌로 각 분야에 따른 학문연구의 자세와 실험의 계획 및 이론 전개에 대한 철저한 훈련을 그 내용으로 한다. 이를 보다 효율적으로 수행하기 위하여 각자의 졸업논문작성에 있어 각 전공별로 실험실에 배치시켜 실제로 실험하고 보고 배우며, 각자의 실험계획 및 그에 필요한 문헌 등을 고찰하고, 이에 따라 각자의 졸업논문실험을 진행함으로써 앞으로 보다 진보된 학문을 수행할 수 있는 연구자세를 갖추도록 유도하는 강좌이다."
                },
                {
                    "name": "생명과학특수연구 1",
                    "description": "학부생의 졸업논문 작성을 위한 강좌로 각 분야에 따른 학문연구의 자세와 실험의 계획 및 이론 전개에 대한 철저한 훈련을 그 내용으로 한다. 이를 보다 효율적으로 수행하기 위하여 각자의 졸업논문작성에 있어 각 전공별로 실험실에 배치시켜 실제로 실험하고 보고 배우며, 각자의 실험계획 및 그에 필요한 문헌 등을 고찰하고, 이에 따라 각자의 졸업논문실험을 진행함으로써 앞으로 보다 진보된 학문을 수행할 수 있는 연구자세를 갖추도록 유도하는 강좌이다."
                },
                {
                    "name": "생명과학특수연구 1",
                    "description": "학부생의 졸업논문 작성을 위한 강좌로 각 분야에 따른 학문연구의 자세와 실험의 계획 및 이론 전개에 대한 철저한 훈련을 그 내용으로 한다. 이를 보다 효율적으로 수행하기 위하여 각자의 졸업논문작성에 있어 각 전공별로 실험실에 배치시켜 실제로 실험하고 보고 배우며, 각자의 실험계획 및 그에 필요한 문헌 등을 고찰하고, 이에 따라 각자의 졸업논문실험을 진행함으로써 앞으로 보다 진보된 학문을 수행할 수 있는 연구자세를 갖추도록 유도하는 강좌이다."
                },
                {
                    "name": "생명과학특수연구 1",
                    "description": "학부생의 졸업논문 작성을 위한 강좌로 각 분야에 따른 학문연구의 자세와 실험의 계획 및 이론 전개에 대한 철저한 훈련을 그 내용으로 한다. 이를 보다 효율적으로 수행하기 위하여 각자의 졸업논문작성에 있어 각 전공별로 실험실에 배치시켜 실제로 실험하고 보고 배우며, 각자의 실험계획 및 그에 필요한 문헌 등을 고찰하고, 이에 따라 각자의 졸업논문실험을 진행함으로써 앞으로 보다 진보된 학문을 수행할 수 있는 연구자세를 갖추도록 유도하는 강좌이다."
                },
                {
                    "name": "생물물리학",
                    "description": "생명체를 물리학적인 개념에서 해석하고자 하는 시도를 소개한다. 분자수준의 분자생물물리학, 세포수준의 세포생물물리학, 그리고 그 이상의 수준을 다루는 복합계 생물물리학으로 나누어 그 개념들을 소개한다."
                },
                {
                    "name": "생물다양성과 환경",
                    "description": "생물다양성에 관한 연구는 계통분류학이다. 따라서 본 과목은 생명과학전공 탐색과목으로 3학년에서 개설되는 동물계통분류학 및 실험, 식물계통분류학 및 실험, 미생물계통분류학 및 실험의 선수과목이라고 할 수 있다. 그러므로 본 과목에서는 계통분류학에서 다루는 기본적인 내용들, 즉 계통분류학의 발전사, 계통분류학상의 분류군과 카테고리, 종의 동정, 기재, 명명, 분류의 방법들을 강의하고, 생물계를 이루는 종의 개념을 고찰해 본다. 또한 생물의 여러 문과 계통 등에 관한 기본적인 원리를 서술하고, 분자생물계통학의 역사와 연구방법, 원리, 현재까지의 결과 등을 강의하며 실제 지구상에 존재하는 생물들을 분류군 단위로 대략적으로 강의하는데, 3분의 전공교수님들이 동물, 식물, 미생물에 관해 위의 내용을 근간으로 각각 강의한다."
                },
                {
                    "name": "시스템 신경과학 개론",
                    "description": "시스템 신경과학에서는 두뇌의 기능을 담당하는 시스템들과 신경회로에 대해 공부하게 된다 (시스템의 예로 청각계, 시각계, 운동계, 보상계 등을 들 수 있다.). 이에 더불어 감정, 꿈, 생체시계, 언어 등의 고등기능과 시스템의 문제로 야기되는 신경정신질환에 대한 것도 포함된다. 이러한 시스템과 신경회로가 어떻게 발생 시에 만들어지는 지와 시스템에서의 정보를 저장하고 사용하는 기억과 학습의 원리를 공부하게 된다. 종국적으로 이러한 공부를 통해 어떻게 감각정보가 두뇌에서 분석, 종합되어 우리가 외부세계를 지각하며 이를 근거로 결정을 내리고 행동을 실행하는 지에 대해 보다 나은 이해를 추구하고자 한다."
                },
                {
                    "name": "시스템생물학",
                    "description": "본 강좌는 시스템생물학 교과목으로 (1) 시스템 선정 및 교란, (2) 오믹스 데이터 생산, (3) 주요 분자 선별, (4) 네트워크 모델링 및 분석, (5) 주요 조절 메커니즘 가설 수립, (6) 실험적 검증에 해당하는 시스템생물학의 기본 방법론을 수업한다. 또한 방법론 이해를 위해 필요한 오믹스 기술, 기본/심화 통계, 데이터 통합, 네트워크 분석법, 시스템 디자인/오퍼레이션 원리 등을 함께 강의함. 마지막으로 학습한 방법론의 실제 문제에 대한 간접적 경험을 습득을 위해 실제 생물학적 문제에 적용한 사례를 강의함."
                },
                {
                    "name": "식물생리학",
                    "description": "식물의 생리현상을 구조와 기능면에서 다룬다. 식물의 체내에서 일어나는 온갖 생리적인 반응들을 세포학, 형태학, 생화학, 분자생물학, 생태학 등의 방법론을 사용하여 포괄적으로 분석한다."
                },
                {
                    "name": "조직세포학",
                    "description": "생체를 구성하고 있는 세포들은 비록 동일한 유전체를 가지고 있지만 형태적으로 매우 다양하다. 또한 생체의 다양한 생명활동을 지지할 수 있도록 기능적으로도 세분화되어있다. 이는 각 세포가 발현하는 유전자의 종류가 서로 다르기 때문이다. 본 과목에서는 생체를 구성하고 있는 다양한 세포들의 구조를 기능과 연관하여 공부한다. 본 과목은 생명체의 구조 및 기능을 종합적으로 이해하는데 기본을 제공하므로 앞으로 생리학, 발생학, 면역학 등을 수강하는데 유용할 것이다."
                },
                {
                    "name": "진화생물학",
                    "description": "생물의 진화에 관한 학문발전의 역사와 고전적인 진화이론을 소개하고 학부 수준에서의 생물학 전반의 지식을 수용하며, 현대적인 진화의 이론을 해설한다. 특히 분자수준에서의 진화학의 개발과 종의 분화, 속 이상의 상위 분류군의 진화를 계통적으로 설명하고, 화석생물과 현존생물의 계통적인 유연관계를 밝혀서 생물이 진화해 온 길을 체계적으로 해석할 수 있도록 유도한다."
                }
            ],
            "화학부": [
                {
                    "name": "유기무기실험",
                    "description": "본 과목에서는 실험을 통해 유기화학 및 무기화학 이론과 실제를 이해한다. 유기합성의 기본 개념을 활용하여 실질적인 유기물질을 합성해 보고 이를 바탕으로 다양한 화학적 현상을 관찰함으로써 학부 수준의 유기반응, 분리 및 분석법을 활용하여 유기화학의 기본에 대한 이해를 돕는다. 또한 무기화학적 접근을 통해서 다양한 착화합물의 합성 및 분석, 나노물질의 합성들을 통해서 무기화합물의 다양한 현상들에 대한 이해를 높이고자 한다."
                },
                {
                    "name": "유기무기실험",
                    "description": "본 과목에서는 실험을 통해 유기화학 및 무기화학 이론과 실제를 이해한다. 유기합성의 기본 개념을 활용하여 실질적인 유기물질을 합성해 보고 이를 바탕으로 다양한 화학적 현상을 관찰함으로써 학부 수준의 유기반응, 분리 및 분석법을 활용하여 유기화학의 기본에 대한 이해를 돕는다. 또한 무기화학적 접근을 통해서 다양한 착화합물의 합성 및 분석, 나노물질의 합성들을 통해서 무기화합물의 다양한 현상들에 대한 이해를 높이고자 한다."
                },
                {
                    "name": "유기무기실험",
                    "description": "본 과목에서는 실험을 통해 유기화학 및 무기화학 이론과 실제를 이해한다. 유기합성의 기본 개념을 활용하여 실질적인 유기물질을 합성해 보고 이를 바탕으로 다양한 화학적 현상을 관찰함으로써 학부 수준의 유기반응, 분리 및 분석법을 활용하여 유기화학의 기본에 대한 이해를 돕는다. 또한 무기화학적 접근을 통해서 다양한 착화합물의 합성 및 분석, 나노물질의 합성들을 통해서 무기화합물의 다양한 현상들에 대한 이해를 높이고자 한다."
                },
                {
                    "name": "유기무기실험",
                    "description": "본 과목에서는 실험을 통해 유기화학 및 무기화학 이론과 실제를 이해한다. 유기합성의 기본 개념을 활용하여 실질적인 유기물질을 합성해 보고 이를 바탕으로 다양한 화학적 현상을 관찰함으로써 학부 수준의 유기반응, 분리 및 분석법을 활용하여 유기화학의 기본에 대한 이해를 돕는다. 또한 무기화학적 접근을 통해서 다양한 착화합물의 합성 및 분석, 나노물질의 합성들을 통해서 무기화합물의 다양한 현상들에 대한 이해를 높이고자 한다."
                },
                {
                    "name": "화학연구실험",
                    "description": "화학전공 학부 학생이 본인이 희망하는 특정 교수 연구실에 소속되어 실제 연구를 수행함으로 장래에 화학도로서의 연구를 수행 할 수 있는 역량을 기름을 목적으로 함. 3회 반복수강할 수 있으며 이 경우 2개 연구실 이상에서 수강하여야 한다."
                },
                {
                    "name": "화학연구실험",
                    "description": "화학전공 학부 학생이 본인이 희망하는 특정 교수 연구실에 소속되어 실제 연구를 수행함으로 장래에 화학도로서의 연구를 수행 할 수 있는 역량을 기름을 목적으로 함. 3회 반복수강할 수 있으며 이 경우 2개 연구실 이상에서 수강하여야 한다."
                },
                {
                    "name": "화학연구실험",
                    "description": "화학전공 학부 학생이 본인이 희망하는 특정 교수 연구실에 소속되어 실제 연구를 수행함으로 장래에 화학도로서의 연구를 수행 할 수 있는 역량을 기름을 목적으로 함. 3회 반복수강할 수 있으며 이 경우 2개 연구실 이상에서 수강하여야 한다."
                },
                {
                    "name": "화학연구실험",
                    "description": "화학전공 학부 학생이 본인이 희망하는 특정 교수 연구실에 소속되어 실제 연구를 수행함으로 장래에 화학도로서의 연구를 수행 할 수 있는 역량을 기름을 목적으로 함. 3회 반복수강할 수 있으며 이 경우 2개 연구실 이상에서 수강하여야 한다."
                },
                {
                    "name": "화학과 AI",
                    "description": "화학 현상을 설명하는데 근본이 되는 분자 구조-기능 상관관계에 대한 전통적인 원리기반 접근법을 보완하고 확장하는, 데이터 기반 접근법의 원리와 응용에 대해 다룬다. (1) 기초 단계로서, 컴퓨터에서 분자를 표현하는 기법과 여러 분자 데이터에 대해 소개한다. 구체적으로, 분자를 1D, 2D, 3D 표현법으로 나타내는 방법에 대해 익히고, 다양한 화학 데이터베이스에 대해 배우며, 이를 컴퓨터에서 다루어 본다. (2) 더 나아가 분자의 성질을 예측하고 기능성 분자를 설계하기 위해 활용되는 여러 계산 도구 및 기계학습 기법을 소개한다. 전통적인 화학 계산 방법인 양자화학계산과 분자동력학 시뮬레이션의 원리와 관련 소프트웨어에 대해 소개하고, 현대 기계학습 방법으로 전통적인 화학계산 방법을 어떻게 보완하고 한계를 극복할 수 있을지 탐구한다. 더불어 분자 구조 및 성질을 예측하는 모델과 분자 생성 모델의 원리에 대해 배우고 활용한다. (3) 마지막으로, 화학, 생물학, 재료, 공학 등에서 효용성이 높은 분자의 성질을 예측하는 최신 연구 사례에 대해 소개하고 미래 방향에 대해 토론한다."
                },
                {
                    "name": "기기분석",
                    "description": "분석화학 수강경력과 물리화학의 기초가 있는 화학 관련 분야 학생들을 위해 설계된 현대 기기분석법 심화강의로서 에너지과학/생명과학/환경과학/영양과학등 다양한 분야에서 활용되는 정량분석장비의 핵심 작동원리를 다룬다. 수강생들은 분석기법의 바탕이 되는 물리화학 및 전기화학적 원리 뿐 아니라 기초회로이론까지 이해할 수 있도록 한다. 강의 초반엔 질량분석과 크로마토그래피등 다양한 분리분석 이론을 다루고, 중반에는 전위차법/전기량법/전압전류법등 전기화학기법을 다룬다. 이후 분자 분광 분석법인 UV-Vis흡광, 적외선흡광, 라만산란과 원자분광법인 원자흡광 및 원자방출분광학을 이해한다. 덧붙여 측정된 결과를 분석할 수 있는 기초 컴퓨터 해석법을 다룬다. 이를 통해 차세대 이차전지, 태양광전지등 에너지-환경 문제와 다양한 생명과학 및 농식약품등내 미지 시료 분석 및 새로운 메커니즘 규명등을 할 수 있는 시야를 넓힌다."
                },
                {
                    "name": "나노소재화학",
                    "description": "나노소재화학(Nanomaterials Chemistry)이란, 나노미터(nm, 10-9m) 크기의 물질을 합성하여 이들이 가지는 독특한 성질과 현상을 연구하고, 더 나아가 유용한 소재로 개발하는 새로운 학문분야이다. 나노화학을 이용한 21세기의 나노기술이 인류생활에 미칠 파급효과는 20세기에 항생제, 집적회로, 고분자 발견 등이 이룩한 효과보다 훨씬 클 것으로 예상되고 있는데, 이를 위해서는 다양한 나노물질의 합성법과 나노물질들이 원하는 구조로 배열되도록 하는 조작방법의 개발이 필수적이다. 본 강좌에서는 대표적인 나노물질로 알려져 있는 나노입자(nanocluster), 나노막대(nanorod), 그리고 나노관(nanotube)의 여러가지 합성법과 새로운 성질에 관하여 알아보고, 이들을 이용한 여러가지 신소재의 개발에 관하여 개괄적으로 소개하고자 한다."
                },
                {
                    "name": "대사생화학",
                    "description": "<기초생화학>의 계속임. 생체에서 일어나는 화학 작용들의 분자적 근거를 이해하는 기초를 배운다. 다루는 분야는 다음과 같다. 원핵생물과 진핵생물의 유전자의 발현조절, 생합성된 단백질의 운반, 지방 아미노산 탄수화물의 분해과정 및 합성과정, 대사.단백질 합성, RNA전사 및 번역"
                },
                {
                    "name": "기기분석",
                    "description": "분석화학 수강경력과 물리화학의 기초가 있는 화학 관련 분야 학생들을 위해 설계된 현대 기기분석법 심화강의로서 에너지과학/생명과학/환경과학/영양과학등 다양한 분야에서 활용되는 정량분석장비의 핵심 작동원리를 다룬다. 수강생들은 분석기법의 바탕이 되는 물리화학 및 전기화학적 원리 뿐 아니라 기초회로이론까지 이해할 수 있도록 한다. 강의 초반엔 질량분석과 크로마토그래피등 다양한 분리분석 이론을 다루고, 중반에는 전위차법/전기량법/전압전류법등 전기화학기법을 다룬다. 이후 분자 분광 분석법인 UV-Vis흡광, 적외선흡광, 라만산란과 원자분광법인 원자흡광 및 원자방출분광학을 이해한다. 덧붙여 측정된 결과를 분석할 수 있는 기초 컴퓨터 해석법을 다룬다. 이를 통해 차세대 이차전지, 태양광전지등 에너지-환경 문제와 다양한 생명과학 및 농식약품등내 미지 시료 분석 및 새로운 메커니즘 규명등을 할 수 있는 시야를 넓힌다."
                },
                {
                    "name": "나노소재화학",
                    "description": "나노소재화학(Nanomaterials Chemistry)이란, 나노미터(nm, 10-9m) 크기의 물질을 합성하여 이들이 가지는 독특한 성질과 현상을 연구하고, 더 나아가 유용한 소재로 개발하는 새로운 학문분야이다. 나노화학을 이용한 21세기의 나노기술이 인류생활에 미칠 파급효과는 20세기에 항생제, 집적회로, 고분자 발견 등이 이룩한 효과보다 훨씬 클 것으로 예상되고 있는데, 이를 위해서는 다양한 나노물질의 합성법과 나노물질들이 원하는 구조로 배열되도록 하는 조작방법의 개발이 필수적이다. 본 강좌에서는 대표적인 나노물질로 알려져 있는 나노입자(nanocluster), 나노막대(nanorod), 그리고 나노관(nanotube)의 여러가지 합성법과 새로운 성질에 관하여 알아보고, 이들을 이용한 여러가지 신소재의 개발에 관하여 개괄적으로 소개하고자 한다."
                },
                {
                    "name": "대사생화학",
                    "description": "<기초생화학>의 계속임. 생체에서 일어나는 화학 작용들의 분자적 근거를 이해하는 기초를 배운다. 다루는 분야는 다음과 같다. 원핵생물과 진핵생물의 유전자의 발현조절, 생합성된 단백질의 운반, 지방 아미노산 탄수화물의 분해과정 및 합성과정, 대사.단백질 합성, RNA전사 및 번역"
                },
                {
                    "name": "무기화학 1: 구조와 결합",
                    "description": "원자가 모여서 분자가 이루어지는 과정, 분자 사이의 상호작용을 통해 초분자가 만들어지는 과정, 원자의 규칙적인 배열을 통해 결정상 고체 물질이 얻어지는 과정 등 다양한 수준에서 일어나는 화학결합을 제대로 이해하는 것을 목표로 한다. 양자화학에 기반한 전자구조 이론을 복잡하고 다양한 실제 분자 시스템에 적용하기 위해서, 대칭성과 화학군론으로 문제를 단순화시킨 분자 오비탈 이론을 학습한다. 분자/이온 사이의 브뢴스테드 산-염기 반응, 루이스 산–염기 착물 형성, 수소결합, 전자전달 과정 등을 제어하는 전자구조와 입체구조의 역할을 배운다. 고체화학의 기본개념을 익히고, 분자 오비탈 이론이 전자밴드 이론으로 확장되는 과정을 이해한다. 다양한 s/p/d-블록 원소로 이루어진 화합물의 구조-물성-반응성 사이의 상관관계를 전자구조–화학결합의 관점에서 보는 법을 배우고, 이를 통해 현대 무기화학에 대한 새로운 시각을 갖게 된다."
                },
                {
                    "name": "물리화학2",
                    "description": "본 과목에서는 양자화학 및 분자분광학의 기본 원리 및 응용에 대하여 공부한다. 먼저, 전자 구조로부터 원자 및 분자의 성질을 이해하고자 하는 양자화학에 대하여 공부한다. 이 후 분자와 전자기파의 상호작용을 통해 물질의 물리적, 화학적 성질을 규명하는 분자분광학의 이론적 기초와 응용을 다룬다."
                },
                {
                    "name": "분자생화학",
                    "description": "분자생화학은 기초생화학. 대사생화학에서 공부한 내용을 기초로 생체분자들의 합성과정, 유전정보의 복제와 발현기작, 감각기관과 면역작용의 생화학과 신약개발 과정을 학습함."
                },
                {
                    "name": "분자설계및합성",
                    "description": "<유기화학 1·2>에서 배운 지식을 전제로 하여 실제 유기화합물을 합성할 수 있는 다양한 합성방법을 소개하고 여러가지 유형의 유기화합물 합성의 실례들을 배운다. 본 과정에서는 다음과 같은 반응을 다루게 될 것이다; 친핵성의 탄소를 이용한 알킬화 반응; 친핵성 탄소와 카보닐기와의 반응, 친핵성 치환반응에 의한 작용기의 변환, 탄소-탄소 다중결합에 대한 친전자체의 첨가반응, 환원반응, 고리화 첨가반응, 자리옮김 반응, 유기금속 화합물을 포함하는 반응, 전이금속을 포함하는 반응, 붕소·실리콘·주석을 포함하는 화합물을 이용한 탄소-탄소 결합반응, 산화 반응."
                },
                {
                    "name": "양자화학",
                    "description": "양자화학은 원자 및 분자의 성질을 전자 구조로부터 이해하려는 학문이다. 본 교과목에서는 양자역학의 공리로부터 출발하여 양자화학의 기본원리를 배우고, 이를 여러 다양한 화학적 현상에 응용하는 것에 대하여 배운다. 또한 컴퓨터 프로그램을 사용하여 화학적으로 흥미있는 계에 대한 양자화학 계산을 수행하는 방법에 대해서도 공부한다."
                },
                {
                    "name": "유기재료화학: 설계 및 응용",
                    "description": "본 ‘유기재료화학: 설계 및 응용‘ 과목은 유기 화학의 범위를 확장하고자 하는 학부생을 대상으로 하며, 다양한 구조의 유기 분자 및 고분자의 설계와 합성을 다룬다. 합성된 유기 고분자의 구조를 재료 화학적 관점에서 분석하고, 전기·광학적 특성과 생물화학적 특성 간의 상관관계를 탐구한다. 본 강의에서는 유기 분자 및 고분자의 설계·합성에 대한 기본 개념을 습득하고, 실험적 접근법과 재료 특성 분석 능력을 배양하여 관련 재료 (전자재료, 에너지재료, 바이오소재) 연구 분야에서의 활용 능력을 기른다."
                },
                {
                    "name": "유기화학 2",
                    "description": "유기화학은 탄소의 화학이다. 유기화학 1에 이어 유기화학 2에서는 탄소화합물의 다양한 작용기들에 대해서 학습하고 이러한 작용기들의 특성과 반응에 대한 이해를 토대로 유기화합물의 골격을 합성할 수 있는 기초지식을 배양한다. 이러한 유기화학의 기초지식은 나아가서 유기재료화학이라고 볼 수 있는 고분자화학, 생명현상의 기본이 되는 생체분자들에 대한 연구인 생화학, 그리고 화학공정 및 대량생산에 응용될 수 있는 촉매분야 등 다양한 응용분야의 기초가 될 것이다."
                },
                {
                    "name": "재료화학: 설계 및 응용",
                    "description": "본 교과에서는 학부생을 대상으로 화학적 관점에서 재료의 설계, 합성 원리, 특성 규명 및 응용성을 다룬다. 금속, 반도체, 산화물, 고분자, 바이오 재료를 포함한 다양한 (나노)재료의 화학적 결합 원리를 이해하고, 이를 기반으로 재료의 합성 원리 및 물성을 이해한다. 아울러, (나노)재료의 전기, 광학, 촉매, 에너지 저장 및 변환, 센싱, 약물전달 등 다양한 분야에서의 응용성을 소개하는 것이 목적이다."
                },
                {
                    "name": "전기화학: 기초와 응용",
                    "description": "전기화학은 근대 화학의 태동과 발전을 공유해온 오래된 학문 분야이다. 열역학의 완성에 힘입어 각종 산업에 적용됨으로써 지난 세기 동안 광범위한 응용 영역을 구축하였다. 반면 분자 수준의 기초 학문 측면에서의 전기화학은 상대적으로 진보가 더디어 분석화학 분야에의 응용을 중심으로 전개 되어왔다. 21세기 들어 기후변화에 따른 에너지 대전환 및 생체-전자 인터페이스, 반도체 시대가 도래하면서 전기화학적 현상에 대한 미시적인 이해가 급격히 요구되었다. 기초 학문 분야 뿐만 아니라 응용 산업에 이르기까지 학생들에게 전기화학에 관한 개요와 기초적인 이해를 제공한다."
                }
            ],
            "천문학전공": [
                {
                    "name": "천문관측 및 실험 2",
                    "description": "광학 영역을 포함한 전 영역의 전자기파와 고에너지 입자를 통해 우주를 연구함으로써 우주에 대한 이해의 폭을 비약적으로 넓힐 수 있다. 이를 위해 학생들은 우선 여러 파장 대역에서 망원경과 검출기의 원리와 특성을 공부한다. 또한 다파장 관측으로 천체를 이해하는 기본 소양을 갖추기 위해 광학 분광 관측법과 전파를 비롯한 다른 파장 대역에서의 관측법을 배운다. 이어서 교내의 광학 망원경, 분광기, 전파 망원경, 태양 망원경 등을 사용해서 관측 을 수행하고 관측 자료를 처리하면서 천체의 물리량을 유도하는 과정을 습득한다."
                },
                {
                    "name": "천체물리학개론 1",
                    "description": "다양한 천문현상을 이해하기 위해서 필요한 천문기체역학과 복사론에 관한 기본적인 지식을 학습한다. 천문기체역학 강의는 기체역학의 기본방정식, 정상흐름과 초음속흐름의 특성, 역학적 불안정과 열적 불안정, 자기기체역학 등의 주제로 구성되며, 수치실험을 병행한다. 복사론 강의는 복사의 기본 개념, 복사와 물질간의 상호작용에 관한 현상학적 기술, 선스펙트럼의 형성 등의 주제로 구성된다."
                },
                {
                    "name": "현대우주론",
                    "description": "현대 우주론의 핵심 내용을 소개한다. 우주론 이해에 필요한 개념을 학습하고 이론과 관측 양면에서 최근에 밝혀진 우주론의 연구 결과를 학습한다. 주요 주제는 우주의 구조와 역학적 상태, 우주의 구성 성분, 거대 구조의 형성 과정,은하의 형성과 진화, 우주배경복사의 특성 등이다."
                },
                {
                    "name": "은하와 우주",
                    "description": "우주를 구성하는 기본 단위인 은하의 세계와 우주에 대하여 전반적으로 학습하여 올바른 현대적 우주관을 배양한다. 우리 은하의 구조 및 진화, 정상은하의 특성, 퀘이사와 활동은하의 본질, 우주의 거대구조, 우주의 팽창과 나이, 우주배경복사, 우주론 등을 학습한다. 현대천문학에서 중요한 연구과제인 중력렌즈와 아직도 정체가 명확히 밝혀지지 않고 있는 암흑물질 등을 소개한다."
                },
                {
                    "name": "천문기기개론",
                    "description": "오늘날 천문학 발전은 새로운 개념과 기술에 기반한 혁신적 천문 기기에 크게 의존한다. 본 과목은 학부생에게 천문 기기의 기본 지식을 제공하고, 실습을 통해 천문기기에 대한 흥미를 갖게 하는 것이 목표이다. 천문학적 시상과 적응광학, 망원경(광학/적외선/전파/우주)과 후초점기기, 검출기 등의 원리를 간략하게 다룬 후 담당 교수의 전문성을 살린 프로젝트 중심으로 실습과 수업을 진행한다."
                }
            ],
            "수리과학부": [
                {
                    "name": "해석개론 2",
                    "description": "<해석개론 1>의 연속강의로서 함수열의 고른 수렴, 함수열의 미분과 적분, 멱급수와 해석함수, 삼각급수, 바이어쉬트라스점근정리, 아르젤라-아스콜리 정리, 수열공간, 특이적분, 적분으로 정의된 함수, 감마함수, 적분변환, 푸리에 급수의 기본 성질, 연속함수와 미분가능함수의 푸리에 급수, 르벡적분과 푸리에 급수 등을 공부한다."
                },
                {
                    "name": "현대대수학 2",
                    "description": "현대대수학1의 연속 과목으로 심화된 군 이론을 배우고, 체이론과 군이론을 접목시킨 갈루아 이론을 배운다. 현대대수학1에서는 유한 가환군의 분류를 배웠다면, 본 강좌의 전반부에서는 Sylow 정리와 Jordan-Hoelder 정리를 이용하여 더 많은 종류의 군을 다루는 법을 배운다. 후반부에서는 여러 가지 종류의 확대체를 정의하고 그 성질을 배운다. 특별히 유한체의 경우 그 확장체를 완벽히 분류할 수 있음을 증명하고, 유한 확장체의 성질를 활용하여 각의 3등분의 작도 불가능성을 증명한다. 또한 확대체와 군의 대응관계를 뜻하는 갈루아 대응관계를 설명하고 이를 통해 5차 방정식의 일반해가 존재하지 않음을 증명한다."
                },
                {
                    "name": "해석개론",
                    "description": "연속함수 및 미분가능한 함수열의 극한, 함수열의 고른 수렴, Arzela-Ascoli 정리, Weierstrass 정리, 멱급수, 해석함수, 삼각급수, Fourier 급수 등을 배운다."
                },
                {
                    "name": "해석개론",
                    "description": "연속함수 및 미분가능한 함수열의 극한, 함수열의 고른 수렴, Arzela-Ascoli 정리, Weierstrass 정리, 멱급수, 해석함수, 삼각급수, Fourier 급수 등을 배운다."
                },
                {
                    "name": "해석개론 및 연습 2",
                    "description": "<해석개론 1>의 연속강의로서 다변수 벡터함수의 미분과 적분을 다루고, 이 두 가지가 어떻게 연관되는지 살펴본다. 구체적으로 다변수함수의 미분, 역함수정리와 음함수정리, 다변수함수의 최대최소, 다중 적분, Fubini 정리, 적분의 변수변환, Green 정리, Stokes 정리, Gauss 발산정리 등을 다룬다."
                },
                {
                    "name": "확률미분방정식",
                    "description": "확률 미분방정식과 그 응용에 대한 일반적 이론을 익히기 위한 과정으로 다음과 같은 주제를 공부한다. 이산시간 마팅게일, 연속시간 마팅게일, 이토 적분, 제곱가능 마팅게일, 국소 마팅게일, 세미 마팅게일, 이토 공식, 이토 표현 이론, 기르사노프 정리, 마코브 프로세스, 디퓨전 프로세스, 무한소 생성자, 확률 미분 방정식, strong and weak 해, 파인만-케츠 공식, strong 마코브 성질을 다룬다."
                },
                {
                    "name": "현대기하학탐구",
                    "description": "이 과목에서는 기하학 연구의 최전선에서 다루어지는 중요한 주제들을 소개한다. 각 학기마다 담당 교수에 따라 매듭이론, 일반상대론, 리만곡면, 행렬군 등 다양한 주제들로 구성될 예정이다. 이를 통해 학생들이 기하학과 위상수학 분야의 다채로운 주제와 그 사이의 연결고리, 최신 연구 방향 등을 배울 수 있는 기회를 제공하고자 한다."
                },
                {
                    "name": "미분방정식 및 연습",
                    "description": "시간에 따라 변하는 자연 현상이나 사회 현상은 흔히 미분방정식으로 표현된다. 따라서 이의 해법이나 성질을 아는 것은 자연과학이나 사회 현상을 이해하는데 필수적이다. 본 과목에서는 미분방정식의 기본적인 해법과 성질을 공부한다."
                },
                {
                    "name": "미분방정식 및 연습",
                    "description": "시간에 따라 변하는 자연 현상이나 사회 현상은 흔히 미분방정식으로 표현된다. 따라서 이의 해법이나 성질을 아는 것은 자연과학이나 사회 현상을 이해하는데 필수적이다. 본 과목에서는 미분방정식의 기본적인 해법과 성질을 공부한다."
                },
                {
                    "name": "미분방정식",
                    "description": "상미분방정식의 기본적인 해법, 급수해법, Laplace 변환에 의한 해법, 해의 존재 정리 및 해의 유일성에 관한 정리 등을 배운다."
                },
                {
                    "name": "미분방정식",
                    "description": "상미분방정식의 기본적인 해법, 급수해법, Laplace 변환에 의한 해법, 해의 존재 정리 및 해의 유일성에 관한 정리 등을 배운다."
                },
                {
                    "name": "복소변수함수론",
                    "description": "Cauchy-Riemann 방정식, 해석함수, 조화함수, Taylor 급수, Moebius 변환, 선적분, Cauchy 적분공식, 최대 최소치정리, Laurent 급수, 유수정리를 활용한 실적분 계산, 등각사상, Poisson 적분공식, Dirichlet 경계치 문제, Riemann 제타함수 등을 다룬다."
                },
                {
                    "name": "복소함수론 2",
                    "description": "<복소함수론 1>의 후속강의로서, 복소해석함수에 관한 몇몇 고등이론 및 이론 자체의 다양한 응용을 소개한다. 이렇게 함으로써, 복소함수론과 수학의 타 분야 사이의 연계성을 강조한다. 이 강의에서 다루는 내용은 대체로 다음과 같다; 복소적분을 이용한 Fourier 변환의 계산, Weierstrass의 무한곱정리를 이용한 함수의 무한곱 표현, Hadamard의 인수분해정리 및 그 응용을 포함한 전해석함수 이론, Stirling 공식의 증명을 포함한 gamma 함수이론, 리만의 zeta함수와 함수방정식, 소수정리의 증명, 등각사상, Dirichlet 문제, 단순연결영역, 리만사상정리, Schwarz-Christoffel 적분, 타원적분, Weierstrass의 타원함수, Jacobi의 theta 함수 및 그 응용."
                },
                {
                    "name": "선형대수학",
                    "description": "행렬 연산의 기초를 배우고 이를 응용해 연립일차방정식을 풀어보는 것으로 시작하여, 선형대수학의 기본 개념을 학습하고 그 내용이 수학 및 인접 분야에 어떻게 응용되는지 알아본다. 세부 내용으로, CR분해와 선형독립, LU분해와 일차연립방정식, 영공간과 열 공간, 선형사상과 행렬식, 직교성과 QR분해, 고윳값과 고유벡터, 대각화, 특잇값 분해를 배운다. 시간이 남으면 유니타리 행렬, 스펙트랄 정리, 고속푸리에변환 등을 소개한다.."
                },
                {
                    "name": "선형대수학",
                    "description": "행렬 연산의 기초를 배우고 이를 응용해 연립일차방정식을 풀어보는 것으로 시작하여, 선형대수학의 기본 개념을 학습하고 그 내용이 수학 및 인접 분야에 어떻게 응용되는지 알아본다. 세부 내용으로, CR분해와 선형독립, LU분해와 일차연립방정식, 영공간과 열 공간, 선형사상과 행렬식, 직교성과 QR분해, 고윳값과 고유벡터, 대각화, 특잇값 분해를 배운다. 시간이 남으면 유니타리 행렬, 스펙트랄 정리, 고속푸리에변환 등을 소개한다.."
                },
                {
                    "name": "선형대수학 2",
                    "description": "본 강좌에서는 선형대수학1에서 배운 내용을 바탕으로 특정한 선형사상들이 가지는 성질에 대해 보다 구체적으로 다룬다. 이를 위해 선형대수학 1 시간에 배웠던 내적공간과 선형 사상의 수반 사상에 대해서 복습하고, 이후 정규작용소, 자가수반 선형사상, 유니타리 사상에 대해서 이해하고, 스펙트럼 정리와 특잇값 분해에 대해 배운다. 또한 이중선형 형식과 이차 형식, 직교작용소의 분류에 대해 배우고, 대각화의 일반화인 조던폼 정리, 최소다항식, 유리표준형 등을 다룬다"
                },
                {
                    "name": "선형대수학",
                    "description": "행렬 연산의 기초를 배우고 이를 응용해 연립일차방정식을 풀어보는 것으로 시작하여, 선형대수학의 기본 개념을 학습하고 그 내용이 수학 및 인접 분야에 어떻게 응용되는지 알아본다. 세부 내용으로, CR분해와 선형독립, LU분해와 일차연립방정식, 영공간과 열 공간, 선형사상과 행렬식, 직교성과 QR분해, 고윳값과 고유벡터, 대각화, 특잇값 분해를 배운다. 시간이 남으면 유니타리 행렬, 스펙트랄 정리, 고속푸리에변환 등을 소개한다.."
                },
                {
                    "name": "선형대수학 2",
                    "description": "본 강좌에서는 선형대수학1에서 배운 내용을 바탕으로 특정한 선형사상들이 가지는 성질에 대해 보다 구체적으로 다룬다. 이를 위해 선형대수학 1 시간에 배웠던 내적공간과 선형 사상의 수반 사상에 대해서 복습하고, 이후 정규작용소, 자가수반 선형사상, 유니타리 사상에 대해서 이해하고, 스펙트럼 정리와 특잇값 분해에 대해 배운다. 또한 이중선형 형식과 이차 형식, 직교작용소의 분류에 대해 배우고, 대각화의 일반화인 조던폼 정리, 최소다항식, 유리표준형 등을 다룬다"
                },
                {
                    "name": "수리과학졸업논문지도",
                    "description": "본 수업은 수리과학부 전공 학부생들의 논문작성 능력을 함양하는 것을 목적으로 한다. 한글 혹은 영어로 논문을 작성할 때 필요한 논리적인 구성, 논문형태에 대한 이해, 다른 연구자의 연구결과를 인용하는 방법, 표절 등을 내용으로 한 강좌를 구성한다."
                },
                {
                    "name": "수리과학졸업논문지도",
                    "description": "본 수업은 수리과학부 전공 학부생들의 논문작성 능력을 함양하는 것을 목적으로 한다. 한글 혹은 영어로 논문을 작성할 때 필요한 논리적인 구성, 논문형태에 대한 이해, 다른 연구자의 연구결과를 인용하는 방법, 표절 등을 내용으로 한 강좌를 구성한다."
                },
                {
                    "name": "수리과학졸업논문지도",
                    "description": "본 수업은 수리과학부 전공 학부생들의 논문작성 능력을 함양하는 것을 목적으로 한다. 한글 혹은 영어로 논문을 작성할 때 필요한 논리적인 구성, 논문형태에 대한 이해, 다른 연구자의 연구결과를 인용하는 방법, 표절 등을 내용으로 한 강좌를 구성한다."
                },
                {
                    "name": "수리과학졸업논문지도",
                    "description": "본 수업은 수리과학부 전공 학부생들의 논문작성 능력을 함양하는 것을 목적으로 한다. 한글 혹은 영어로 논문을 작성할 때 필요한 논리적인 구성, 논문형태에 대한 이해, 다른 연구자의 연구결과를 인용하는 방법, 표절 등을 내용으로 한 강좌를 구성한다."
                },
                {
                    "name": "수치선형대수",
                    "description": "Gauss 소거법, Cholesky 분해, Householder와 Gram-Schmidt 해법, 데이터 맞춤, 비선형 최소자승법, 심플렉스 해법, 행렬의 분할, Jacobi와 Seidel 반복법, 이완해법, 유한차분법, ADI 해법, 켤레 그래디언트 해법 등을 다룬다."
                },
                {
                    "name": "수학자를 위한 물리학",
                    "description": "이 교과목의 목적은 수리과학을 전공하는 학생들에게 수학적 엄밀성을 기반으로 물리학의 근간을 이루는 고전역학, 전자기학, 양자역학, 열역학 및 통계역학을 소개하는 것이다. 이를 통해, 앞으로 선택하게 될 수학의 세부 전공분야에서 등장하는 물리학적인 요소에 대한 전반적인 통찰을 얻고 연구의 기반 동력으로 활용할 수 있도록 한다."
                },
                {
                    "name": "수학특강 2",
                    "description": "수학분야는 최근 들어 매우 빠른 속도로 변화하고 있다. 분야간 장벽이 무너지고 있고, 매우 흥미로운 새 응용분야가 계속 발견되고 있으며, 이러한 교류와 융합을 통해 새로운 수학이 창시되고 있다. 본 과목의 목표는 이러한 수학의 새로운 흥미로운 동향을 학부생들에게 적시에 소개하는 것이다. 본 과목에서 다룰 과목을 예시하면 아래와 같다. 순수수학 및 논리학의 새로운 발전; 계산과학 및 수치해석; 유체역학 및 지구물리학; 웨이블렛과 신호처리; 암호론; 양자계산; 생물정보학, 프로테오믹스 및 신경과학을 포함한 수리생물학; 지능과학; 금융수학 및 수리경제학; 확률론 및 응용. 그러나 매학기 강의될 내용은 위에 국한되지 않으며 그 당시의 수학의 상황에 맞는 토픽이 추가로 고려될 것이며 궁극적으로는 강사의 선택에 의해 결정될 것이다."
                },
                {
                    "name": "심층신경망의 수학적 기초",
                    "description": "심층신경망은 현대의 인공지능 혁신의 중심이며 공학, 과학, 그리고 응용수학 전반에 폭 넓게 활용되고 있다. 이 과목은 심층신경망의 수학적 기반이론을 배운다. 최적화의 기초, stochastic gradient descent의 수렴 정리, 재생핵 힐베르트 공간, multilayer perceptron, 자동 미분법, 콘볼류션 신경망, 잔차 네트워크, regularization, 데이터 증강, universal approximation theorem, 생성모델을 다룬다."
                },
                {
                    "name": "암호론",
                    "description": "암호학은 정보의 기밀성과 무결성, 인증등을 제공하기 위한 암호화와 전자서명 기술을 연구하는 학문이다. 본 강의에서는 정수론의 기본적인 성질을 공부하고 이를 이용하여 각각 데이터의 저장, 통신, 계산시 필요한 암호기술인 대칭키암호, 공개키암호, 동형암호를 다룬다. 암호의 안전성을 추정하는 도구로 계산 복잡도와 암호의 해독기술, 안전성 증명 기술도 소개한다. 그리고 전자서명과 해시함수의 응용인 블록체인과 동형암호의 응용인 AI시대의 암호기술, 양자 컴퓨터에 안전한 암호기술에 소개한다."
                },
                {
                    "name": "위상수학개론 2",
                    "description": "<위상수학개론 1>의 연속과목으로서 다양체 상의 위상, 기본군, 피복공간 등을 다룬다 ."
                },
                {
                    "name": "유한군의 표현론",
                    "description": "표현론은 추상적인 대수 구조를 이해하는 현대 수학의 대표적인 방법론이다. 좀 더 구체적으로, 주어진 대수의 각 원소를 특정 벡터 공간의 선형변환에 대응시키는 함수를 표현이라고 하며 표현론에서는 이러한 표현들을 분석하여 그 대수의 성질을 얻는다. 이 강의에서는 가장 간단한 대수 구조인 유한군의 표현론을 배운다. 유한군의 유한차원 표현의 완전 가약성을 증명하고, 지표라는 개념을 도입함으로써 기약 표현의 분류법을 배운다. 대칭군의 유한차원 표현론의 경우, 이를 이해하는 조합론적 시각도 소개한다."
                },
                {
                    "name": "이산수학",
                    "description": "이산수학은 기본적으로 수학적 대상을 세는 것으로 부터 시작한다. 기본적인 개수를 세는 문제들을 다루는 것으로 시작해서 합성, 집합과 정수의 분할에 대해 배운다. 순열(permutation) 에 대해서도 다루며 이후 포함 배제의 원리를 포함하는 Sieve 방법론과 생성함수에 대해서 배운다. 이후 그래프 이론 중에서는 헤밀토니안 사이클, 색칠문제, 부합문제, Ramsey 정리 등에 대해서 배운다."
                },
                {
                    "name": "집합과수리논리",
                    "description": "공리계, 집합론, 수의 체계, 선택공리, 기수와 서수, 문장의 진위성, 증명의 방법론 등을 선택적으로 학습한다."
                },
                {
                    "name": "카오스와 동역학계",
                    "description": "Kepler 운동, 생태계, Hamilton 계, 안정성과 혼돈, 극한사이클, Poincare 사상, 야릇한 끌개 등을 다룬다."
                },
                {
                    "name": "푸리에해석과 응용",
                    "description": "고전적인 Fourier 급수 및 Fourier 적분의 구체적인 응용을 다루고, 최근 여러 가지 공학에 응용되고 있는 이산 코사인 변환, 빠른 Fourier 변환, 웨이블렛과 다해상도 분석, 웨이블렛 변환과 Fourier 변환, 신호 및 영상처리, 역문제에의 응용 등을 공부한다."
                }
            ],
            "지구환경과학부": [
                {
                    "name": "해양유기화학 및 실험",
                    "description": "해양환경에서 다양한 유기물의 생태적 기능은 그 중요성이 날로 증가하고 있다. 본 교과목에서는 유기화학 기본 개념에 대해 공부하고, 이를 바탕으로 해양 환경 내에서 존재하는 다양한 유기물과 이들 물질의 생태적 기능 및 생리적 역할에 대해 다루고자 한다. 실험에서는 해양유기물의 다양한 추출법, 각종 크로마토그래피를 이용한 해양유기물의 분리 및 정제법이 다루어진다."
                },
                {
                    "name": "행성지질학",
                    "description": "화성이나 달과 같은 지구 밖 천체를 대상으로 하는 본격적인 탐사는 비교적 최근까지 인류의 유일한 연구대상이었던 지구의 지질학적 현상에 대한 지식을, 초기 형성물질 및 환경에서 큰 차이를 지닌 다른 천체를 대상으로 시험하고 활용할 기회를 제공한다. 본 강의에서는 태양계의 지구형 행성과 위성의 지질학적 역사와 구성물질, 행성의 지표환경, 행성 탐사를 위한 지질학적 연구 방법 등을 주로 다루며, 이를 바탕으로 인류에게 주어진 자원으로서 지구 밖 천체의 가능성 또한 탐색해 본다."
                },
                {
                    "name": "해양오염 및 실험",
                    "description": "해양오염에 관련된 제반 문제들을 폭넓게 다룸으로써 오염현상의 특성과 그 인과관계에 대한 기본적 이해를 도모하는 교과목이다. 해양환경을 오염시키는 무기 및 유기물질의 종류와 특성, 이들 오염물질의 근원과 유입경로, 해양생태계 내에서의 순환경로 및 변화과정, 오염으로 인한 해양생태계의 피해, 그리고 해양오염 방지를 위한 노력 등 해양오염에 대한 다양한 주제들을 강의와 강독 및 토론을 통하여 종합적으로 접근한다."
                },
                {
                    "name": "해양암석지구화학 및 실험",
                    "description": "본 교과목은 해양저 화성활동을 통해 고체 지구의 지구화학적 조성과 지각 형성과정을 이해하는 데 초점을 둔다. 해양지각, 맨틀, 섭입대, 해양 열점 환경에서의 마그마 작용과 원소 순환과정을 탐구하며, 이를 통해 지화학적 데이터를 활용하여 지각의 형성과 맨틀의 진화를 해석하는 능력을 배양한다."
                },
                {
                    "name": "환경해양학 및 실험",
                    "description": "해양환경을 이해하는 데 필수적인 과정들, 즉 일차생산, 침강유동량, 신생상, 해양의 먹이망, 생물다양성, 기후와 해양생물간의 관계에 대해 배운다. 그리고, 연안환경에서 인간의 활동에 의해 생기는 환경의 교란과 관련된 주제에 대해 논의한다. 아울러 지구시스템의한 구성성분으로서의 해양환경의 역할을 이해하기 위하여 해양환경을 구성하는 주요 요소를 살핀다. 최근의 기후문제 등의 지구환경문제에서의 해양의 역할을 이해하는 데 주 초점을 맞추어져 수업이 진행된다. 실험 및 현장학습을 통해 교과목에 대한 이해도를 높인다."
                },
                {
                    "name": "구조지질학 및 실험",
                    "description": "지구는 생성된 이래로 전 지질시대를 통하여 계속적으로 여러번의 조산운동과 이에 수반된 변형작용을 받아왔다. 이 교과목에서는 이때에 형성된 여러 형태의 지질구조들이 뜻하는 의미와 그 해석방법 등에 관하여 학습을 한다. 지층들이 변형작용 중에 역전되었는지 아니면 정상적으로 놓여 있는지를 규명하기 위하여 암석이 형성될 당시에 만들어진 일차 구조들의 형태와 의미를 이해한다. 암석내에 힘이 가하여지면 힘의 방향과 종류에 따라서 다양한 지질구조가 만들어지며, 이들 암석 내에 함유되어 있는 변형된 물질들을 이용하여 변형력을 해석한다. 변형작용층에 형성되는 이차적인 면상구조와 선구조를 학습한다. 조산운동과 관련하여 정단층, 쓰러스트단층, 주향이동단층, 습곡과 절리구조, 전단대 등의 특성을 학습한다. 학기 중에 이를 야외에서 학습하기 위하여 2박 3일간의 야외실습을 한다."
                },
                {
                    "name": "환경해양학 및 실험",
                    "description": "해양환경을 이해하는 데 필수적인 과정들, 즉 일차생산, 침강유동량, 신생상, 해양의 먹이망, 생물다양성, 기후와 해양생물간의 관계에 대해 배운다. 그리고, 연안환경에서 인간의 활동에 의해 생기는 환경의 교란과 관련된 주제에 대해 논의한다. 아울러 지구시스템의한 구성성분으로서의 해양환경의 역할을 이해하기 위하여 해양환경을 구성하는 주요 요소를 살핀다. 최근의 기후문제 등의 지구환경문제에서의 해양의 역할을 이해하는 데 주 초점을 맞추어져 수업이 진행된다. 실험 및 현장학습을 통해 교과목에 대한 이해도를 높인다."
                },
                {
                    "name": "구조지질학 및 실험",
                    "description": "지구는 생성된 이래로 전 지질시대를 통하여 계속적으로 여러번의 조산운동과 이에 수반된 변형작용을 받아왔다. 이 교과목에서는 이때에 형성된 여러 형태의 지질구조들이 뜻하는 의미와 그 해석방법 등에 관하여 학습을 한다. 지층들이 변형작용 중에 역전되었는지 아니면 정상적으로 놓여 있는지를 규명하기 위하여 암석이 형성될 당시에 만들어진 일차 구조들의 형태와 의미를 이해한다. 암석내에 힘이 가하여지면 힘의 방향과 종류에 따라서 다양한 지질구조가 만들어지며, 이들 암석 내에 함유되어 있는 변형된 물질들을 이용하여 변형력을 해석한다. 변형작용층에 형성되는 이차적인 면상구조와 선구조를 학습한다. 조산운동과 관련하여 정단층, 쓰러스트단층, 주향이동단층, 습곡과 절리구조, 전단대 등의 특성을 학습한다. 학기 중에 이를 야외에서 학습하기 위하여 2박 3일간의 야외실습을 한다."
                },
                {
                    "name": "대기분석 및 실험",
                    "description": "실제 기상 관측자료로 구성되는 전문을 이용하여 직접 고도별 일기도를 작성하고 분석하면서 일기예보를 위한 대기의 입체적인 3차원 구조를 밝힐 수 있는 능력을 배양할 수 있도록 실험을 병행한다. 따라서 이 강좌는 기상전문을 이용하여 일기예보에 필요한 일기도를 작성하여 대기운동 특성을 파악한다."
                },
                {
                    "name": "대기물리 2",
                    "description": "대기중의 물에 의하여 나타나는 물리적 현상을 이해하고 대기중에서 전기적인 현상을 이해하기 위하여 기본적이며 초보적인 지식을 다룬다. 주요내용으로는 물의 성질, 대기중에서의 응결과정과 강수과정, 구름의 생성과 구조, 대기에서의 전하분류, 방전현상, 지구의 전자기장과 그 유지 등이다."
                },
                {
                    "name": "연안해양역학",
                    "description": "연안 해수 운동을 지배하는 기본 역학 방정식을 유도한 후, 이를 적용하여 연안 역학과정을 이해한다. 주요 내용은 만과 하구의 역학, 연안 풍성류, 밀도류, 해수교환, 체류시간, 한반도 주변의 연안 특성 등이다."
                },
                {
                    "name": "위성기상기후학",
                    "description": "위성관측의 발달은 기상학과 기후학 분야에서 괄목할 만한 활용의 증대를 가져왔다. 위성자료는 자료동화를 통해 수치예보의 성능을 좌우하는 가장 중요한 요소로 대두되었다. 또한 장기간 위성관측 자료는 대기물리과정, 기후/환경변화 감시, 기후모델의 검증과 이해 등 기후변화연구에서 필요불가결한 부분이 되고 있다. 이 강의에서는 인공위성 관측이 어떻게 이루어지며, 기상/기후분야에서 어떠한 활용이 이루어지고 있는지에 초점을 맞추어 진행한다."
                },
                {
                    "name": "자원지질학 및 실험",
                    "description": "유용 지구자원 물질의 기원, 운반기구와 이들의 농집 과정, 농집 후의 변화에 따른 증거들을 광물조성 및 화학조성 산출상태, 조직을 관찰하고 분석함으로서 어떻게 특정 원소를 함유하는 유용자원이 생성되었는지 그 생성과정과 기원에 대한 지식을 습득한다. 실험을 통하여 유용광물을 육안과 현미경하에서 관찰함으로서 각 광물들을 식별하고 조직의 특징을 구별할 수 있는 능력을 배양한다."
                },
                {
                    "name": "지구환경 데이터과학",
                    "description": "본 교과목은 이론과 실습을 병행하여 다양한 지구환경 데이터를 가시화하고 분석함으로써 기후변화를 비롯한 지구환경과학 문제에 컴퓨터 프로그래밍과 인공지능을 활용할 수 있는 능력을 기르는 것을 목적으로 한다. 주 1회 이론 수업을 통해 지구환경과학 문제에 대한 이해 및 데이터에 대한 배경 지식을 습득하며, 주 2회 실습 수업을 통해 컴퓨터 프로그래밍과 인공지능 활용을 직접 연습하도록 한다. 이를 바탕으로 각자 지구환경 데이터과학 프로젝트 주제 제안 발표 및 결과 발표를 수행함으로써 다양한 지구환경 데이터과학 연구를 경험하도록 한다. 자연대 AI/컴퓨팅 공통 교과목인 “자연과학자를 위한 프로그래밍 및 인공지능 개론”을 수강하였거나, 그에 준하는 지식과 능력을 갖춘 수강자를 대상으로 한다."
                },
                {
                    "name": "지구화학 및 실험",
                    "description": "암석 및 고화물을 구성하는 원소들의 이동 및 분배현상이 지질학적 제과정(화성활동, 변성작용, 교대작용. 열수변질, 풍화작용, 지하수 순환 등)을 통해 어떻게 일어나는가를 취급하며 이러한 현상을 지배하는 지구화학적 법칙을 고찰하고 아울러 환경지구화학의 기본 원리를 익히게 된다. 물리화학적 변화를 받은 암석, 광물 및 지하수의 상호간 반응과 그 반응의 진행 방향을 열역학적 함수의 변화에 따라 추정하여 그 평형관계를 공부하게 된다."
                },
                {
                    "name": "지질해양학 및 실험",
                    "description": "이 교과목에서는 지질해양학과 해양지질학의 다양한 주제들을 다룰 것이다. 연안에서 일어나는 현상, 퇴적분지의 발달과 특성, 대륙붕에서의 지질학적 작용 뿐만 아니라 심해에서의 다양한 지구과학적 현상을 공부할 것이다. 특히 판과 판 경계에서 일어나는 지질 및 지구물리현상을 공부할 것이며 지각과 상부맨틀의 구조와 특성도 다루게 될 것이다."
                },
                {
                    "name": "지질도학 실험",
                    "description": "이 과목은 지도를 사용하여 간단한 지질분석을 실습해 보는 입문과목이다. 간단한 지질도를 작성하는 방법, 단층을 기술하는 방법, 그리고 단층면을 따라 이동한 거리를 측정하는 방법 등을 익힌다. 지질도는 4차원 상에 존재하는 암석과 지체구조의 진화를 2차원에 표기하는데 쓰이며, 또한 지구의 지질학적 역사를 재구성하는데 쓰인다."
                },
                {
                    "name": "지구환경과학논문연구",
                    "description": "학부 졸업논문 작성을 지원하기 위한 과목으로 학생들은 세부 연구주제별 지도교수를 결정하고, 세부 연구를 진행하고 졸업논문 작성법을 익히게 된다. 본 과목에서는 오리엔테이션 참석, 논문작성 지도교수 신청, 중간보고서 작성, 학위논문연구 발표를 단계적으로 진행한다. 신청자격은 6학기 이상의 학부과정을 마쳤고, 지구환경과학부 전공선택과목을 21학점 이상 이수한 학생에게 주어진다."
                },
                {
                    "name": "지구환경과학연구실습",
                    "description": "지구환경과학부에서 제공하는 학부생의 인턴과정 연구를 지원하기 위한 과목으로 학생들은 지도교수를 결정하고, 대기과학, 지구시스템과학, 혹은 해양학 연구를 진행한 다음, 기말보고서를 작성하게 된다. 본 과목에서는 오리엔테이션 참석, 인턴 지도교수 신청, 중간보고서 작성, 최종보고서 발표를 단계적으로 진행한다. 신청자격은 2학기 이상의 학부과정을 마친 학생에게 주어진다."
                },
                {
                    "name": "지구환경과학논문연구",
                    "description": "학부 졸업논문 작성을 지원하기 위한 과목으로 학생들은 세부 연구주제별 지도교수를 결정하고, 세부 연구를 진행하고 졸업논문 작성법을 익히게 된다. 본 과목에서는 오리엔테이션 참석, 논문작성 지도교수 신청, 중간보고서 작성, 학위논문연구 발표를 단계적으로 진행한다. 신청자격은 6학기 이상의 학부과정을 마쳤고, 지구환경과학부 전공선택과목을 21학점 이상 이수한 학생에게 주어진다."
                },
                {
                    "name": "표영환경생태학",
                    "description": "해양의 표면으로부터 저부에 이르는 표영환경의 무생물적 환경요인의 특성을 파악하고 이러한 특성과 상호작용하는 생물학적 과정을 학습하는 것이 목적이다. 해양 환경의 생물학적 과정을 표영생태계의 먹이사슬 중 하위영양단계의 일차생산을 통한 유기물질의 상위영양단계로 상향이동에 의존하므로 식물 및 동물플랑크톤의 분류와 분포, 영양섭취의 동역학, 플랑크톤의 상태, 미소동물플랑크톤의 섭식 등의 이해는 전 해양환경의 생태학을 이해하는 기본이 된다."
                }
            ],
            "연계전공 과학기술학": [
                {
                    "name": "과학커뮤니케이션",
                    "description": "이 과목은 과학언론에 대한 기본적인 이해를 목적으로 한다. 현대사회는 과학기술이 실생활에 많은 영향을 끼치고 있어, 과학과 그 응용분야에 대한 시민들의 관심이 아주 많다. 그러나 시민 스스로 과학 분야의 새로운 변화나 진보를 알기에는 어려움이 많다. 이런 상황에서 중요한 역할을 할 수 있는 것이 언론이다. 과학이 정치, 경제, 사회 등 다른 분야와 구별되는 차이 중 하나는 재연성이다. 이는 예측 가능성과도 관련이 있다. 한 과학자의 주장은 다른 과학자의 재연 또는 검증에 의해 뒷받침되어야 한다. 이처럼 과학이 여타 분야와 다른 만큼, 과학언론에 대한 요구도 차이점이 있다. 이 과목을 통해서 과학언론의 특징 및 과학언론 연구의 방법을 살펴볼 것이다. 후반부에서는 과학, 기술과 관련된 지식의 효과적인 전달에 대해, 특히 21세기에 떠오르는 새로운 매체와 테크놀로지의 특성을 살펴볼 것이다. 마지막으로 과학뉴스란 무엇이며, 이를 전문으로 하는 기자란 무엇인가? 일반기자와 구분되는 과학기자의 차이는 무엇인지 고찰한 후, 실제 취재와 작문을 통해 이를 실습해 볼 것이다."
                },
                {
                    "name": "과학기술과 환경",
                    "description": "이 과목은 과학기술과 환경에 대한 상호작용을 다학제적으로 분석하는 것을 그 목적으로 한다. 우선 과학기술의 발달이 자연에 대한 인간의 이해와 사용에 어떠한 방식으로 영향을 미쳤는지 살펴볼 것이다. 이를 통해 학생들은 과학기술의 발전과 환경의 관계에 대한 여러 학문적인 작업과 역사적, 사회학적, 정책적 연구들을 살펴볼 것이다. 수업에 다루어질 주제로는 인간과 자연의 관계, 생태적 위기의 기원과 과학기술, 자연의 산업적 이용과 자본주의의 성장, 그리고 전 지구적 환경위기의 기원과 현황 등이 될 것이다."
                },
                {
                    "name": "과학기술과 환경",
                    "description": "이 과목은 과학기술과 환경에 대한 상호작용을 다학제적으로 분석하는 것을 그 목적으로 한다. 우선 과학기술의 발달이 자연에 대한 인간의 이해와 사용에 어떠한 방식으로 영향을 미쳤는지 살펴볼 것이다. 이를 통해 학생들은 과학기술의 발전과 환경의 관계에 대한 여러 학문적인 작업과 역사적, 사회학적, 정책적 연구들을 살펴볼 것이다. 수업에 다루어질 주제로는 인간과 자연의 관계, 생태적 위기의 기원과 과학기술, 자연의 산업적 이용과 자본주의의 성장, 그리고 전 지구적 환경위기의 기원과 현황 등이 될 것이다."
                },
                {
                    "name": "과학기술과 사회정의",
                    "description": "현대 사회에서 과학기술의 발달은 다양한 사회적, 윤리적 논의들을 제기하고 있다. 본 과목은 과학기술학(STS)의 관점에 기반하여 과학자 개인, 과학자 사회, 과학 제도와 문화 등 여러 층위에서 과학적 실행과 지식이 불러일으키는 윤리적 이슈와 사회 정의의 문제를 이해하는 것을 목적으로 한다. 학생들은 생명공학, 인공지능, 빅데이터와 같은 첨단 분야에서 일어나는 혁신의 과정에서, 정의로운 혁신은 무엇인지 논의할 것이다. 나아가 환경오염, 기후변화, 과학기술적 재난에 대한 논의를 통해 과학기술과 사회가 맺는 복잡한 상호관계에 대해 살펴볼 것이다. 본 과목은 이러한 논의를 통해 민주주의, 분배정의, 돌봄과 지속가능성 등 사회정의에 관한 쟁점들을 과학기술학의 분석적 관점을 통해 탐구할 것이다. 본 수업은 과학기술과 혁신, 사회정의 이슈들에 관심있는 이공계열 및 인문사회계열 학생들 모두에게 권장한다."
                },
                {
                    "name": "미래 에너지 시스템과 과학정책",
                    "description": "이 과목은 화석연료 기반의 기존 에너지시스템의 한계를 지적하고 이를 대체하는 지속가능한 에너지 시스템으로의 전환에 대해 다룬다. 미래 지속가능한 에너지시스템의 특징과 요건에 대해 조망하고, 시스템 전환을 준비하는 과학기술정책에 대해 알아본다. 이를 위해 과학기술혁신정책의 최신 동향과 주요 이론을 알아보고, 수소경제, 신재생에너지, 친환경자동차 등 가능한 대안과 과제들을 고찰한다. 이 과목은 에너지시스템에 관한 과학기술 지식과 과학기술학(STS), 그리고 과학정책을 넘나드는 융합을 지향하며, 수강생들이 미래 사회의 주역으로서 필수적인 지식을 갖출 뿐 아니라 실천적 지식인으로서의 소양을 함양하는 것을 목표로 한다."
                }
            ]
        }
    }
}